-- 江南区 临安 路人_临安公差.lua （消灭采花贼任务）
-- By: Dan_Deng(2004-05-27)

Include("\\script\\global\\repute_head.lua")

function main(sel)
	Uworld43 = GetTask(43)
--	if (Uworld43 < 10) and (GetLevel() >= 70) and (GetReputeLevel(GetRepute()) >= 6) then
		--		Say(10713 ,2,"奸淫妇女乃十恶不涉之罪，我既知晓，自然要管。/U43_get","没有/no")
	if (Uworld43 == 40) and (HaveItem(381) == 1) then
		Talk(6,"U43_40","果然不出我所料. 由莫空月带头的那群采花贼原就住在雷云寨","就是那个'万花丛中过; 片叶不沾身'的莫空月吗?!","正是他! 原出身望族，挥霍无度。雷云寨前任过世之后，他继任, 不但没有发扬，相反还解散了山寨,做一个独行盗贼。他的轻功很好，之前都没人可以抓到他，他不知已经害了多少清白姑娘。","这么说来，差大人的意思是已经找出他的行踪了?","如果这么简单的话我也不会到这找你帮手。这个人行踪难料. 敢肯定的是他在找云雷匙开大门! 你手中已经有雷匙了！我推算没错的话另外那把在云债主手中. ","我去找另外一把. 不抓住他不知道又要有多少姑娘受害")
	elseif (Uworld43 == 80) and (HaveItem(382) == 1) then
		Talk(1,"U43_80","果然不出我所料, 莫空月现正隐匿于临安城内. 让你找的好苦. 依我看他正在西夏领域")
	elseif (Uworld43 == 10) then
		Talk(1,"","这么久了还是没有找到采花贼的踪迹")
	elseif (Uworld43 == 20) then
		Talk(1,"","没有找到我们的军营吗？如果找到云匙就去找我给你指引的地方")
	else
		Talk(1,"","公差：天子脚下，怎容宵小撒野。有谁胆敢在临安作奸犯科的，千万不要落在我手里！")
	end
end;

function U43_get()
	Talk(1,"","好! 据我调查这些采花大盗风流，喜欢用扇子. 他们曾出现过? 蜀山. 那原是雷云的山寨地. 之前你还入山见过雷帮主. 他必知道这事. 有一点, 这个人阴险毒恶. 你要小心提防")
	SetTask(43,10)
	AddNote("接受临安城委托的公差任务: 消灭采花大盗. 刺探他们的情况. 最近他们已近做了很多案. ")
	Msg2Player("接受临安城委托的公差任务: 消灭采花大盗. 刺探他们的情况. 最近他们已近做了很多案.")
end;

function U43_40()
	SetTask(43,50)
	Msg2Player("之后去找云拿云匙) ")
end

function U43_80()
	SetTask(43,90)
	Msg2Player("寻找莫空月在临安的藏身处 ")
end

function no()
end;
