--中原北区 汴京府 路人1程大爷对话
-----------------------------------------------------------------------
function main(sel)

if(GetItemCount(351) >= 1)then
	Say("金人送给我们很多宝贝，交给我们任务去找什么山河社稷地图，不知道有什么作用？",4,"我找到一块碎片 /gift1","我找到两块碎片/gift2","我找到一块碎片 /gift3","我不换 /no")
else
	default()
end

end;

-----------------------------------------------------------------------

function default()
	i = random(0,2)
	if (i == 0) then
		Talk(1,"","程大爷：咱汴京城的那座铁塔，可有些年头啦。那座塔是用琉璃砖盖成的，因其色如铁，所以老百姓都叫它“铁塔”。")
	elseif (i == 1) then
		Talk(1,"","程大爷：如今这汴京被金人占了去，咱们的日子可苦啦。")
	else
		Talk(1,"","程大爷：皇上只顾自己在南边享福，哪会管我们这些老百姓的死活！")
	end
end

-----------------------------------------------------------------------

function gift1()
if(GetItemCount(351) >= 3)then
	DelItem(351)
	DelItem(351)
	DelItem(351)
	for i = 1, 3 do
		x = 238 + random(0,2)
		AddEventItem(x)			-- 随机给宝石
		AddEventItem(353)			-- 猩红宝石
--		AddItem(6, 1, 21, 1, 0, 0, 0)			-- 猩红宝石
	end
	Say("你的地图已拿，送给你这些，你拿着。最近几年不是很安稳! ",0)
else
	Say("年轻人不能小看老者，你怎么有3个地图碎片?",0)
end
end

-----------------------------------------------------------------------

function gift2()
if(GetItemCount(351) >= 2)then
	DelItem(351)
	DelItem(351)
	x = 238 + random(0,2)
	AddEventItem(x)
	AddEventItem(353)			-- 猩红宝石
--	AddItem(6, 1, 21, 1, 0, 0, 0)			-- 猩红宝石
	Say("你的地图已拿，送给你这些，你拿着。最近几年不是很安稳! ",0)
else
	Say("年轻人不能小看老者，你怎么有3个地图碎片?",0)
end
end

-----------------------------------------------------------------------

function gift3()
if(GetItemCount(351) >= 1)then
	DelItem(351)
	AddEventItem(353)			-- 猩红宝石
--	AddItem(6, 1, 21, 1, 0, 0, 0)			-- 猩红宝石
	Say("你的地图已拿，送给你这些，你拿着。最近几年不是很安稳! ",0)
else
	Talk(1,"","年轻人不能小看老者，你怎么有3个地图碎片?")
end
end

-----------------------------------------------------------------------

function no()
end

-----------------------------------------------------------------------
