-------------------------------------------------------------------------
-- FileName		:	task_huoqimihan.lua
-- Author		:	zifeiyu
-- CreateTime	:	2005-09-10 
-- Desc			:	<#>火漆密函
-------------------------------------------------------------------------
DescLink_huoqimihan ="<#><link=image:\\spr\\item\\questkey\\taskobj075.spr>火漆密函<link>"
function main()
	Describe(DescLink_huoqimihan.."<#><enter>夏青衣先生：近来主上催逼得越来越紧，计划中那个行动请务必在九月中秋之前实施。由于独孤剑号召天下武林中人齐聚明月镇，这个计划的实现或许会带来意想不到的好处。到那时，夏先生一家的荣华也就唾手可得了。"
	.."<enter>    鹤顶红已着下人送至，您应该收到了。考虑到唐缺乃绝顶高手，唐门又精擅用毒，配置这副药材的人下了很大的功夫，其毒无色无味，中者立毙。您务必妥善保管，一定一定不能被人发觉。如果计划失败或者发生意外，那么您也可以用这味毒药了断自己。那样的话，相信您的家人会被我们照顾得很好。否则，一切都不可知了。万望珍重。", 1, "结束对话/no")
	return 1
end

function no()
end