-------------------------------------------------------------------------
-- FileName		:	task_shenzhaoyuan1.lua
-- Author		:	xiaoyang
-- CreateTime	:	2005-08-31 18:02:14
-- Desc			:	沈昭远的手稿一乱起西方
-------------------------------------------------------------------------

DescLink_ShenZhaoYuan ="<#><link=image:\\spr\\item\\questkey\\taskobj075.spr>沈昭远的手稿<link>"

function main()
	Describe(DescLink_ShenZhaoYuan.."<#>：绍兴三十年，酣战已久的中原宋国与北方金国之间进入了相对平静的一年。双方罢战休兵，除了边境上时而发生零星冲突，大时代的烽火似乎暂时熄灭了。中原地区的百姓得以休养生息，原本百里内袅无人烟的村庄死镇又焕发出新的活力。这年夏季，稻穗上挂满了星星点点的露水。<enter>"
	.."然而这一年放到整个历史长河中都必将是惊心动魄，而又回味久长的一年。极西的大草原上，蒙古包里传来了婴儿们稚嫩的啼哭。他们留连于母亲饱和的奶水，显示出超越前辈的旺盛生命力。大人们都说，这些孩子将来一定会成为乞颜部的巴特尔。他们都不曾想到，在嗷嗷待哺的婴儿中间，有一个人不仅成为了蒙古部族的英雄，甚至统领着他的雕弓铁骑横扫欧亚大陆，完成了旷古烁今的霸业。他的名字，叫铁木真。<enter>"
	.."阳光洒满从北至南广袤的华夏领域，却独独照不到西北边陲贫瘠的夏国。这个从敦煌城的风沙中走出来的国家，遭遇了百年难遇的旱灾。坐在王庭之上，西夏国主仁孝寝食难安。近些年他对外连宋臣金，长袖广舞，对内励精图治，开一代风气，使得西夏国广有陕甘全境，触角甚至探入了蒙古境内。然而，那些剽悍的游牧民族后代，正以一种铁血和无情的作风重建着大草原的秩序，大动乱的时代终将过去，一个统一而强势的封建国家将崛起。颇有政治前瞻性的仁孝预见到了这一点，这让他忧虑不堪。已被教化的西夏子民们抵挡不住金国强兵，也抵挡不住蒙古铁骑，仁孝似乎看到了大夏灭亡那日滔天的大火。鸟儿落在王庭外嬉戏，一点都没感觉到冷清的御殿正被阴翳笼罩，西夏王仁孝喷火的双目逐渐黯淡下去，他召入侍从，以六百里加急快马送走了一封信。那封绝秘的信函会不会带来另一场冥狱之火呢？从今晚的星空中我得不到答案。可是，这一年的九月注定不会平静。<enter>"
	.."                                             观星者  沈昭远",1,"结束对话/no")
	return 1
end

function no()
end