--西南南区 点苍山to沧浪客居所
--Trap ID：沧浪客 1

function main(sel)
	Uworld42 = GetTask(42)
--	Msg2Player("沧浪客居所")
	if (Uworld42 == 60) then
		SetTask(42,70)
		Talk(15,"U42_go","哈哈! ","哈哈哈! ","好孩子，来这里，爷爷背你...哎呀，好重啊！","爷爷，我想吃糖.","我也想.","爷爷，他们有，我的呢?","可以了，谁都有份.","请问沧浪客在房间吗?","外面是谁?","晚辈拜见!","我正和孙子们在玩耍，没时间接待，回去吧!","实不相瞒，这几个小孩的母亲也很担心，寝食不安，请前辈放了他们.","他们都是我的孙子，你说什么他们的母亲？你小子敢来这戏弄我啊？","前辈，不要和我开玩笑了，谅解一下!","谅解？大胆小子，接招!")
	elseif (Uworld42 == 70) then
		Talk(1,"U42_go","小子不知死活，还不快去! ")
	end
end;

function U42_go()
	NewWorld(231,1611,3193)
end
