IncludeLib("ITEM")
--DinhHQ
--20110407:不能在闯关时使用微山岛令牌
Include("\\script\\vng_feature\\forbiditem\\vngforbidspecialitem.lua")

TB_XINNIAN_GIFE = {
	[908] = {	{	{	0,	11,	97,	1,	1,	1	},
					{	0,	11,	98,	1,	1,	1	},
					{	0,	11,	99,	1,	1,	1	},
					{	0,	11,	100,	1,	1,	1	},
					{	0,	11,	101,	1,	1,	1	},
					{	0,	11,	107,	1,	1,	1	},
					{	0,	11,	108,	1,	1,	1	},
					{	0,	11,	109,	1,	1,	1	},
					{	0,	11,	110,	1,	1,	1	},
					{	0,	11,	111,	1,	1,	1	},	},	"所有五行属性少年和青年同伴面具",	0},
					
	[909] = {	{	{	0,	11,	97,	1,	1,	1	},
					{	0,	11,	98,	1,	1,	1	},
					{	0,	11,	99,	1,	1,	1	},
					{	0,	11,	100,	1,	1,	1	},
					{	0,	11,	101,	1,	1,	1	},
					{	0,	11,	107,	1,	1,	1	},
					{	0,	11,	108,	1,	1,	1	},
					{	0,	11,	109,	1,	1,	1	},
					{	0,	11,	110,	1,	1,	1	},
					{	0,	11,	111,	1,	1,	1	},	},	"随机五行属性少年和青年同伴面具其中一个",	0},
	
	[910] = {	{	6,	0,	1,	1,	0,	1	},	"十全大补丸一套",	3,	1,	10},
	[911] = {	{	0,	0,	0,	10,	0,	1	},	"五行属性玄铁剑各一把",	5,	0,	4},
	[912] = {	{	0,	0,	1, 10,	0,	1	},	"五行属性大风刀各一把",	5,	0,	4},
	[913] = {	{	0,	0,	2,	10,	0,	1	},	"五行属性金箍棒各一根",	5,	0,	4},
	[914] = {	{	0,	0,	3,	10,	0,	1	},	"五行属性破天戟各一支",	5,	0,	4},
	[915] = {	{	0,	0,	4,	10,	0,	1	},	"五行属性破天锤各一把",	5,	0,	4},
	[916] = {	{	0,	1,	0,	10,	0,	1	},	"五行属性霸王镖各一支",	5,	0,	4},
	[917] = {	{	0,	1,	1,	10,	0,	1	},	"五行属性碎月刀各一把",	5,	0,	4},
	[918] = {	{	0,	1,	2,	10,	0,	1	},	"五行属性孔雀翎各一支",	5,	0,	4},
	[919] = {	{	0,	8,	0,	10,	0,	1	},	"五行属性龙凤血玉镯各一对",	5,	0,	4},
	[920] = {	{	0,	8,	1,	10,	0,	1	},	"五行属行天蚕护腕各一对",	5,	0,	4},
	[921] = {	{	0,	7,	3,	10,	0,	1	},	"五行属性通天发冠各一顶",	5,	0,	4},
	[922] = {	{	0,	7,	4,	10,	0,	1	},	"五行属性掩日盔各一顶",	5,	0,	4},
	[923] = {	{	0,	6,	1,	10,	0,	1	},	"五行属性白金腰带各一根",	5,	0,	4},
	[924] = {	{	0,	5,	1,	10,	0,	1	},	"五行属性天蚕靴各一双",	5,	0,	4},
	[925] = {	{	0,	5,	3,	10,	0,	1	},	"五行属性飞凤靴各一双",	5,	0,	4},
	[926] = {	{	6,	1,	834,	2,	1,	1	},	"金刚不破·同伴秘籍2到5级各一本",	4,	2,	5},
	[927] = {	{	6,	1,	835,	2,	1,	1	},	"百毒不侵·同伴秘籍2到5级各一本",	4,	2,	5},
	[928] = {	{	6,	1,	836,	2,	1,	1	},	"冰雪初融·同伴秘籍2到5级各一本",	4,	2,	5},
	[929] = {	{	6,	1,	837,	2,	1,	1	},	"真火抗力·同伴秘籍2到5级各一本",	4,	2,	5},
	[930] = {	{	6,	1,	838,	2,	1,	1	},	"雷霆护甲·同伴秘籍2到5级各一本",	4,	2,	5},
	[931] = {	{	6,	1,	849,	1,	1,	1	},	"平和气诀·同伴秘籍1到5级各一本",	4,	1,	5},
	[932] = {	{	6,	1,	850,	1,	1,	1	},	"虚空闪影·同伴秘籍1到5级各一本",	4,	1,	5},
	[933] = {	{	6,	1,	851,	1,	1,	1	},	"会神精心·同伴秘籍1到5级各一本",	4,	1,	5},
	[934] = {	{	6,	1,	852,	1,	1,	1	},	"无念心经·同伴秘籍1到5级各一本",	4,	1,	5},
	[935] = {	{	6,	1,	853,	1,	1,	1	},	"五行无相·同伴秘籍1到5级各一本",	4,	1,	5},
	[936] = {	{	6,	1,	854,	1,	1,	1	},	"弥气飘踪·同伴秘籍1到5级各一本",	4,	1,	5},
	[937] = {	{	6,	1,	855,	1,	1,	1	},	"花飞蝶舞·同伴秘籍1到5级各一本",	4,	1,	5},
	[938] = {	{	6,	1,	901,	1,	1,	1	},	"无人无我·同伴秘籍1到5级各一本",	4,	1,	5},
	[939] = {	{	6,	1,	859,	1,	1,	1	},	"性傲三冬·同伴秘籍1到5级各一本",	4,	1,	5},
	[940] = {	{	6,	1,	860,	1,	1,	1	},	"点血截脉·同伴秘籍1到5级各一本",	4,	1,	5},
	[941] = {	{	6,	1,	861,	1,	1,	1	},	"万毒不复·同伴秘籍1到5级各一本",	4,	1,	5},
	[942] = {	{	6,	1,	862,	1,	1,	1	},	"身轻如燕·同伴秘籍1到5级各一本",	4,	1,	5},
	[943] = {	{	6,	1,	863,	1,	1,	1	},	"凝音归元·同伴秘籍1到5级各一本",	4,	1,	5},
	[944] = {	{	6,	1,	864,	1,	1,	1	},	"易骨经·同伴秘籍1到5级各一本",	4,	1,	5},
	[945] = {	{	6,	1,	865,	1,	1,	1	},	"束身术·同伴秘籍1到5级各一本",	4,	1,	5},
	[946] = {	{	6,	1,	866,	1,	1,	1	},	"缓身术·同伴秘籍1到5级各一本",	4,	1,	5},
	[947] = {	{	6,	1,	867,	1,	1,	1	},	"眩目定身术·同伴秘籍1到5级各一本",	4,	1,	5},
	[948] = {	{	6,	1,	868,	1,	1,	1	},	"益寿阴阳·同伴秘籍1到5级各一本",	4,	1,	5},
	[949] = {	{	6,	1,	869,	1,	1,	1	},	"安抚之语·同伴秘籍1到5级各一本",	4,	1,	5},
	[950] = {	{	6,	1,	870,	1,	1,	1	},	"三生有幸·同伴秘籍1到5级各一本",	4,	1,	5},
	[951] = {	{	6,	1,	871,	1,	1,	1	},	"鬼迷魅惑·同伴秘籍1到5级各一本",	4,	1,	5},
	[952] = {	{	6,	1,	872,	1,	1,	1	},	"夺命缠绕·同伴秘籍1到5级各一本",	4,	1,	5},
	[953] = {	{	6,	1,	873,	1,	1,	1	},	"妖狐倩影·同伴秘籍1到5级各一本",	4,	1,	5},
	[954] = {	{	6,	1,	874,	1,	1,	1	},	"惑神乱心·同伴秘籍1到5级各一本",	4,	1,	5},
	[955] = {	{	6,	1,	875,	1,	1,	1	},	"孤身碎影·同伴秘籍1到5级各一本",	4,	1,	5},
	[956] = {	{	6,	1,	876,	1,	1,	1	},	"死亡羁绊·同伴秘籍1到5级各一本",	4,	1,	5},
	[957] = {	{	6,	1,	877,	1,	1,	1	},	"深魂念唱·同伴秘籍1到5级各一本",	4,	1,	5},
	[958] = {	{	6,	1,	878,	1,	1,	1	},	"及魄之咒·同伴秘籍1到5级各一本",	4,	1,	5},
	[959] = {	{	6,	1,	879,	1,	1,	1	},	"化髓无意·同伴秘籍1到5级各一本",	4,	1,	5},
	[960] = {	{	6,	1,	880,	1,	1,	1	},	"融骨无踪·同伴秘籍1到5级各一本",	4,	1,	5},
	[961] = {	{	6,	1,	882,	1,	1,	1	},	"暗毒之手·同伴秘籍1到5级各一本",	4,	1,	5},
	[962] = {	{	6,	1,	883,	1,	1,	1	},	"三伏之气·同伴秘籍1到5级本一本",	4,	1,	5},
	
	[963] = {	{	{	6,	1,	926,	1,	1,	1	},
					{	6,	1,	927,	1,	1,	1	},
					{	6,	1,	928,	1,	1,	1	},
					{	6,	1,	929,	1,	1,	1	},
					{	6,	1,	930,	1,	1,	1	},	},	"五个同伴抗行技能书礼包",	0},
					
	[964] = {	{	{	6,	1,	949,	1,	1,	1	},
					{	6,	1,	931,	1,	1,	1	},
					{	6,	1,	932,	1,	1,	1	},
					{	6,	1,	935,	1,	1,	1	},
					{	6,	1,	936,	1,	1,	1	},
					{	6,	1,	937,	1,	1,	1	},
					{	6,	1,	944,	1,	1,	1	},
					{	6,	1,	948,	1,	1,	1	},
					{	6,	1,	950,	1,	1,	1	},	},	"九个同伴公共技能书礼包",	0},
					
	[965] = {	{	{	6,	1,	933,	1,	1,	1	},
					{	6,	1,	934,	1,	1,	1	},
					{	6,	1,	951,	1,	1,	1	},
					{	6,	1,	952,	1,	1,	1	},
					{	6,	1,	956,	1,	1,	1	},	},	"五个金属性同伴技能书礼包",	0},
					
	[966] = {	{	{	6,	1,	939,	1,	1,	1	},
					{	6,	1,	940,	1,	1,	1	},
					{	6,	1,	958,	1,	1,	1	},
					{	6,	1,	961,	1,	1,	1	},	},	"四个木属性同伴技能书礼包",	0},
					
	[967] = {	{	{	6,	1,	943,	1,	1,	1	},
					{	6,	1,	946,	1,	1,	1	},
					{	6,	1,	955,	1,	1,	1	},
					{	6,	1,	957,	1,	1,	1	},	},	"四个水属性同伴技能书礼包",	0},
					
	[968] = {	{	{	6,	1,	942,	1,	1,	1	},
					{	6,	1,	953,	1,	1,	1	},
					{	6,	1,	954,	1,	1,	1	},
					{	6,	1,	959,	1,	1,	1	},	},	"四个火属性同伴技能书礼包",	0},
					
	[969] = {	{	{	6,	1,	938,	1,	1,	1	},
					{	6,	1,	941,	1,	1,	1	},
					{	6,	1,	947,	1,	1,	1	},
					{	6,	1,	960,	1,	1,	1	},
					{	6,	1,	962,	1,	1,	1	},	},	"五个土属性同伴技能书礼包",	0},
					
	[970] = {	{	6,	1,	977,	1,	1,	1	},	"十个技能大白驹丸", -1, 10},
	
	[971] = {	{	6,	1,	130,	1,	1,	1	},	"十个大白驹丸", -1, 10},
	
	[972] = {	{	{	0,	11,	101,	1,	1,	1	},
					{	0,	11,	111,	1,	1,	1	},	},	"少年金锋、青年金锋面具各一个",	0},
	
	[973] = {	{	{	0,	11,	100,	1,	1,	1	},
					{	0,	11,	110,	1,	1,	1	},	},	"少年海棠、青年海棠面具各一个",	0},
					
	[974] = {	{	{	0,	11,	98,	1,	1,	1	},
					{	0,	11,	108,	1,	1,	1	},	},	"少年笑霜、青年笑霜面具各一个",	0},
					
	[975] = {	{	{	0,	11,	99,	1,	1,	1	},
					{	0,	11,	109,	1,	1,	1	},	},	"少年火刃、青年火刃面具各一个",	0},
					
	[976] = {	{	{	0,	11,	97,	1,	1,	1	},
					{	0,	11,	107,	1,	1,	1	},	},	"少年雷剑、青年雷剑面具各一个",	0},
					
	[995] = {	{	6,	1,	990,	1,	1,	1	},	"十个雷速丸",	-1,	10},
	[996] = {	{	6,	1,	985,	1,	1,	1	},	"十张乾坤挪移符",	-1,	10},
	[997] = {	{	6,	1,	986,	1,	1,	1	},	"十张移形换影符",	-1,	10},
	[998] = {	{	6,	1,	982,	1,	1,	1	},	"十个玄天陷阱",	-1,	10},
	[999] = {	{	6,	1,	984,	1,	1,	1	},	"十个冰封陷阱",	-1,	10},
	[1000] = {	{	6,	1,	988,	1,	1,	1	},	"十个高级经验令牌",	-1,	10},
	[1001] = {	{	6,	1,	993,	1,	1,	1	},	"十个雷神玉",	-1,	10},
	[1002] = {	{	6,	1,	992,	1,	1,	1	},	"十个玄冰玉",	-1,	10},
	[1003] = {	{	6,	1,	979,	1,	1,	1	},	"十个冰霜号角",	-1,	10},
	[1004] = {	{	6,	1,	980,	1,	1,	1	},	"十个暴雷号角",	-1,	10},
	[1014] = {	{	6,	0,	1012,	1,	1,	1	},	"十个蓝色妖姬",	-1,	10},
	[1015] = {	{	6,	0,	1013,	1,	1,	1	},	"十个雪花",	-1,	10},
	[1018] = {	{	6,	0,	1017,	1,	1,	1	},	"十个节日礼花",	-1,	10},
	[1049] = {	{	6,	1,	1016,	1,	1,	1	},	"十个如意卡",	-1,	10},
	[1055] = {	{	6,	1,	1053,	1,	1,	1	},	"十个幻彩贺卡",	-1,	10},
	[1074] = {	{	6,	1,	402,	1,	1,	1	},	"10个神秘大红包",	-1,	10},
	[1075] = {	{	6,	1,	906,	1,	1,	1	},	"10个高级辉煌果",	-1,	10},
	[1137] = {	{	4,	967,	1,	1,	0,	0	},	"10个冰石结晶",	-1,	10},
	[1138] = {	{	4,	963,	1,	1,	0,	0	},	"10个菊花石",	-1,	10},
	[1139] = {	{	4,	968,	1,	1,	0,	0	},	"10个天石碎片",	-1,	10},
	[1140] = {	{	4,	965,	1,	1,	0,	0	},	"10 冰蟾子",	-1,	10},
	[1141] = {	{	4,	966,	1,	1,	0,	0	},	"10 个鸡血石",	-1,	10},
	[1142] = {	{	4,	964,	1,	1,	0,	0	},	"10 个玛瑙",		-1,	10},
	[1143] = {	{	4,	969,	1,	1,	0,	0	},	"10 个田黄石",	-1,	10},
	[1373] = {	{	6,	1,	74,	1,	1,	1	},	"5 个白驹丸",	-1,	5},
	[1374] = {	{	6,	1,	1372,	1,	1,	1	},	"5 技能白驹丸",	-1,	5},
	[1665] = {	{	6,	1,	23,	1,	1,	1	},	"10 卷铁罗汉",	-1,	10},
	[2355] = {	{	6,	1,	2348,	1,	1,	0	},	"5 个玄天锤",	-1,	5},
	[2515] = {	{	6,	0,	1,	1,	1,	0	},	format("%d %s", 5,"长命丸"),	-1,	5},
	[2516] = {	{	6,	0,	2,	1,	1,	0	},	format("%d %s", 5,"家袍丸"),	-1,	5},
	[2517] = {	{	6,	0,	3,	1,	1,	0	},	format("%d %s", 5,"大力丸"),	-1,	5},
	[2518] = {	{	6,	0,	4,	1,	1,	0	},	format("%d %s", 5,"高闪丸"),	-1,	5},
	[2519] = {	{	6,	0,	5,	1,	1,	0	},	format("%d %s", 5,"高中丸"),	-1,	5},
	[2520] = {	{	6,	0,	6,	1,	1,	0	},	format("%d %s", 5,"飞速丸"),	-1,	5},
	[2521] = {	{	6,	0,	7,	1,	1,	0	},	format("%d %s", 5,"冰防丸"),	-1,	5},
	[2522] = {	{	6,	0,	8,	1,	1,	0	},	format("%d %s", 5,"雷防丸"),	-1,	5},
	[2523] = {	{	6,	0,	9,	1,	1,	0	},	format("%d %s", 5,"火防丸"),	-1,	5},
	[2524] = {	{	6,	0,	10,	1,	1,	0	},	format("%d %s", 5,"毒防丸"),	-1,	5},
	[2525] = {	{	6,	1,	2432,	1,	1,	0	},	format("%d %s", 5,"微山岛令牌"),	-1,	5},
}

function main(nItemIdx)
	_,_,detail = GetItemProp(nItemIdx)
	
	local strItemName = GetItemName(nItemIdx)
	if strItemName == "微山岛令牌礼包" then
		if tbVNGForbidItem:IsForbidMap(strItemName, {tbVNGForbidItem.CHALLENGE_OF_TIME}) == 1 then
			return 1
		end
	end
	
	tbGift = TB_XINNIAN_GIFE[detail][1]
	if ( tbGift == nil ) then
		print("error xinnian gift "..GetItemProp(nItemIdx))
		return 1
	end
	
	if (TB_XINNIAN_GIFE[detail][3] == -1) then	--按第4个参数值给多少个同一个物品
		if (CalcFreeItemCellCount() < TB_XINNIAN_GIFE[detail][4]) then
			Msg2Player("准备空位不足");
			return 1;
		end;
		if (detail == 1075) then
			for i = 1, TB_XINNIAN_GIFE[detail][4] do
				local nItemID = AddItem(tbGift[1],	tbGift[2],	tbGift[3],	tbGift[4],	tbGift[5],	tbGift[6])
				ITEM_SetExpiredTime(nItemID, 10080);
				SyncItem(nItemID)
			end
			
		else
			for i = 1, TB_XINNIAN_GIFE[detail][4] do
				addGiftitem(tbGift[1],	tbGift[2],	tbGift[3],	tbGift[4],	tbGift[5],	tbGift[6])
			end
		end

	elseif (detail == 909) then	--随机给一个
		ranitem = random( getn(tbGift) )
		addGiftitem(tbGift[ranitem][1],	tbGift[ranitem][2],	tbGift[ranitem][3],	tbGift[ranitem][4],	tbGift[ranitem][5],	tbGift[ranitem][6])
	
	elseif (TB_XINNIAN_GIFE[detail][3] == 0) then	--列表中的全给
		for i = 1, getn(tbGift) do
			addGiftitem(tbGift[i][1],	tbGift[i][2],	tbGift[i][3],	tbGift[i][4],	tbGift[i][5],	tbGift[i][6])
		end

	elseif (TB_XINNIAN_GIFE[detail][3] == 3) then	--第3个参数（详细类型）按条件
		for i = TB_XINNIAN_GIFE[detail][4],	TB_XINNIAN_GIFE[detail][5] do
			addGiftitem(tbGift[1],	tbGift[2],	i,	tbGift[4],	tbGift[5],	tbGift[6])
		end

	elseif (TB_XINNIAN_GIFE[detail][3] == 4) then	--第4个参数（等级）按条件
		for i = TB_XINNIAN_GIFE[detail][4], TB_XINNIAN_GIFE[detail][5] do
			addGiftitem(tbGift[1],	tbGift[2],	tbGift[3],	i,	tbGift[5],	tbGift[6])
		end

	elseif (TB_XINNIAN_GIFE[detail][3] == 5) then	--第5个参数（五行）按条件
		for i = TB_XINNIAN_GIFE[detail][4],	TB_XINNIAN_GIFE[detail][5] do
			addGiftitem(tbGift[1],	tbGift[2],	tbGift[3],	tbGift[4],	i,	tbGift[6])
		end
	end
	Msg2Player("您获得<color=yellow>"..TB_XINNIAN_GIFE[detail][2])
end

function addGiftitem(...)
	if ( arg.n == 6 ) then
		AddItem ( arg[1], arg[2], arg[3], arg[4], arg[5], arg[6] )
	elseif ( arg.n == 2 ) then
		AddGoldItem( arg[1], arg[2] )
	elseif ( arg.n == 1 ) then
		AddEventItem( arg[1] )
	else
		print("the table of gift is wrong!!!")
	end
end