Include("\\script\\lib\\awardtemplet.lua");

hero_nDate_S		= 2008061100;
hero_nDate_E		= 2008081124;
hero_Award_ExtPoint	= 4;
here_nFreeCell		= 9;
hero_tbAward 		= {
	[0]	= {	-- 少林
		[1] = {
			nRate = 20,
			[1] = {szName = "四空降魔戒刀碎片(1/9) /9)", tbProp = {4, 585, 1, 1, 0, 0}},
			[2] = {szName = "四空降魔戒刀碎片(2/9) /9)", tbProp = {4, 586, 1, 1, 0, 0}},
			[3] = {szName = "四空降魔戒刀碎片(3/9) /9)", tbProp = {4, 587, 1, 1, 0, 0}},
			[4] = {szName = "四空降魔戒刀碎片 (4/9) /9)", tbProp = {4, 588, 1, 1, 0, 0}},
			[5] = {szName = "四空降魔戒刀碎片 (5/9) /9)", tbProp = {4, 589, 1, 1, 0, 0}},
			[6] = {szName = "四空降魔戒刀碎片(6/9) /9)", tbProp = {4, 590, 1, 1, 0, 0}},
			[7] = {szName = "四空降魔戒刀碎片 (7/9) /9)", tbProp = {4, 591, 1, 1, 0, 0}},
			[8] = {szName = "四空降魔戒刀碎片 (8/9) /9)", tbProp = {4, 592, 1, 1, 0, 0}},
			[9] = {szName = "四空降魔戒刀碎片 (9/9) /9)", tbProp = {4, 593, 1, 1, 0, 0}},
		},
		[2] = {
			nRate = 20,
			[1] = {szName = "伏魔紫金棍碎片 (1/9) /9)", tbProp = {4, 576, 1, 1, 0, 0}},
			[2] = {szName = "伏魔紫金棍碎片  (2/9) /9)", tbProp = {4, 577, 1, 1, 0, 0}},
			[3] = {szName = "伏魔紫金棍碎片 (3/9) /9)", tbProp = {4, 578, 1, 1, 0, 0}},
			[4] = {szName = "伏魔紫金棍碎片  (4/9) /9)", tbProp = {4, 579, 1, 1, 0, 0}},
			[5] = {szName = "伏魔紫金棍碎片  (5/9) /9)", tbProp = {4, 580, 1, 1, 0, 0}},
			[6] = {szName = "伏魔紫金棍碎片  (6/9) /9)", tbProp = {4, 581, 1, 1, 0, 0}},
			[7] = {szName = "伏魔紫金棍碎片  (7/9) /9)", tbProp = {4, 582, 1, 1, 0, 0}},
			[8] = {szName = "伏魔紫金棍碎片  (8/9) /9)", tbProp = {4, 583, 1, 1, 0, 0}},
			[9] = {szName = "伏魔紫金棍碎片  (9/9) /9)", tbProp = {4, 584, 1, 1, 0, 0}},
		},
		[3]	= {
			nRate = 50,
			[1] = {szName = "金丝正红袈裟碎片(1/6) /6)", tbProp = {4, 789, 1, 1, 0, 0}},
			[2] = {szName = "金丝正红袈裟碎片(2/6) /6)", tbProp = {4, 790, 1, 1, 0, 0}},
			[3] = {szName = "金丝正红袈裟碎片(3/6) /6)", tbProp = {4, 791, 1, 1, 0, 0}},
			[4] = {szName = "金丝正红袈裟碎片(4/6) /6)", tbProp = {4, 792, 1, 1, 0, 0}},
			[5] = {szName = "金丝正红袈裟碎片 (5/6) /6)", tbProp = {4, 793, 1, 1, 0, 0}},
			[6] = {szName = "金丝正红袈裟碎片 (6/6) /6)", tbProp = {4, 794, 1, 1, 0, 0}},
		},
		[4] = {
			nRate = 10,
			[1] = {szName = "四空之护法腰带碎片 (1/6)", tbProp = {4, 1134, 1, 1, 0, 0}},
			[2] = {szName = "四空之护法腰带碎片 (2/6)", tbProp = {4, 1135, 1, 1, 0, 0}},
			[3] = {szName = "四空之护法腰带碎片(3/6)", tbProp = {4, 1136, 1, 1, 0, 0}},
			[4] = {szName = "四空之护法腰带碎片 (4/6)", tbProp = {4, 1137, 1, 1, 0, 0}},
			[5] = {szName = "四空之护法腰带碎片 (5/6)", tbProp = {4, 1138, 1, 1, 0, 0}},
			[6] = {szName = "四空之护法腰带碎片 (6/6)", tbProp = {4, 1139, 1, 1, 0, 0}},
		},
	},
	[1]	= {	-- 天王
		[1] = {
			nRate = 20,
			[1] = {szName = "奔雷钻龙枪碎片(1/9) /9)", tbProp = {4, 603, 1, 1, 0, 0}},
			[2] = {szName = "奔雷钻龙枪碎片 (2/9) /9)", tbProp = {4, 604, 1, 1, 0, 0}},
			[3] = {szName = "奔雷钻龙枪碎片 (3/9) /9)", tbProp = {4, 605, 1, 1, 0, 0}},
			[4] = {szName = "奔雷钻龙枪碎片 (4/9) /9)", tbProp = {4, 606, 1, 1, 0, 0}},
			[5] = {szName = "奔雷钻龙枪碎片 (5/9) /9)", tbProp = {4, 607, 1, 1, 0, 0}},
			[6] = {szName = "奔雷钻龙枪碎片(6/9) /9)", tbProp = {4, 608, 1, 1, 0, 0}},
			[7] = {szName = "奔雷钻龙枪碎片 (7/9) /9)", tbProp = {4, 609, 1, 1, 0, 0}},
			[8] = {szName = "奔雷钻龙枪碎片 (8/9) /9)", tbProp = {4, 610, 1, 1, 0, 0}},
			[9] = {szName = "奔雷钻龙枪碎片(9/9) /9)", tbProp = {4, 611, 1, 1, 0, 0}},
		},
		[2]	= {
			nRate = 20,
			[1] = {szName = "亮银宝刀碎片(1/9) /9)", tbProp = {4, 612, 1, 1, 0, 0}},
			[2] = {szName = "亮银宝刀碎片 (2/9) /9)", tbProp = {4, 613, 1, 1, 0, 0}},
			[3] = {szName = "亮银宝刀碎片 (3/9) /9)", tbProp = {4, 614, 1, 1, 0, 0}},
			[4] = {szName = "亮银宝刀碎片 (4/9) /9)", tbProp = {4, 615, 1, 1, 0, 0}},
			[5] = {szName = "亮银宝刀碎片(5/9) /9)", tbProp = {4, 616, 1, 1, 0, 0}},
			[6] = {szName = "亮银宝刀碎片(6/9) /9)", tbProp = {4, 617, 1, 1, 0, 0}},
			[7] = {szName = "亮银宝刀碎片(7/9) /9)", tbProp = {4, 618, 1, 1, 0, 0}},
			[8] = {szName = "亮银宝刀碎片 (8/9) /9)", tbProp = {4, 619, 1, 1, 0, 0}},
			[9] = {szName = "亮银宝刀碎片 (9/9) /9)", tbProp = {4, 620, 1, 1, 0, 0}},
		},
		[3]	= {
			nRate = 50,
			[1] = {szName = "撼天之乘龙战靴碎片  (1/6)", tbProp = {4, 1031, 1, 1, 0, 0}},
			[2] = {szName = "撼天之乘龙战靴碎片  (2/6)", tbProp = {4, 1032, 1, 1, 0, 0}},
			[3] = {szName = "撼天之乘龙战靴碎片  (3/6)", tbProp = {4, 1033, 1, 1, 0, 0}},
			[4] = {szName = "撼天之乘龙战靴碎片  (4/6)", tbProp = {4, 1034, 1, 1, 0, 0}},
			[5] = {szName = "撼天之乘龙战靴碎片  (5/6)", tbProp = {4, 1035, 1, 1, 0, 0}},
			[6] = {szName = "撼天之乘龙战靴碎片  (6/6)", tbProp = {4, 1036, 1, 1, 0, 0}},
		},
		[4] = {
			nRate = 10,
			[1] = {szName = "继业之白虎无双扣碎片(1/6)", tbProp = {4, 1146, 1, 1, 0, 0}},
			[2] = {szName = "继业之白虎无双扣碎片(2/6)", tbProp = {4, 1147, 1, 1, 0, 0}},
			[3] = {szName = "继业之白虎无双扣碎片(3/6)", tbProp = {4, 1148, 1, 1, 0, 0}},
			[4] = {szName = "继业之白虎无双扣碎片(4/6)", tbProp = {4, 1149, 1, 1, 0, 0}},
			[5] = {szName = "继业之白虎无双扣碎片(5/6)", tbProp = {4, 1150, 1, 1, 0, 0}},
			[6] = {szName = "继业之白虎无双扣碎片(6/6)", tbProp = {4, 1151, 1, 1, 0, 0}},
		}
	},
	[2]	= {	-- 唐门
		[1] = {
			nRate = 30,
			[1] = {szName = "冰寒之弹指飞刀碎片 (1/9)", tbProp = {4, 980, 1, 1, 0, 0}},
			[2] = {szName = "冰寒之弹指飞刀碎片  (2/9)", tbProp = {4, 981, 1, 1, 0, 0}},
			[3] = {szName = "冰寒之弹指飞刀碎片 (3/9)", tbProp = {4, 982, 1, 1, 0, 0}},
			[4] = {szName = "冰寒之弹指飞刀碎片  (4/9)", tbProp = {4, 983, 1, 1, 0, 0}},
			[5] = {szName = "冰寒之弹指飞刀碎片 (5/9)", tbProp = {4, 984, 1, 1, 0, 0}},
			[6] = {szName = "冰寒之弹指飞刀碎片  (6/9)", tbProp = {4, 985, 1, 1, 0, 0}},
			[7] = {szName = "冰寒之弹指飞刀碎片  (7/9)", tbProp = {4, 986, 1, 1, 0, 0}},
			[8] = {szName = "冰寒之弹指飞刀碎片  (8/9)", tbProp = {4, 987, 1, 1, 0, 0}},
			[9] = {szName = "冰寒之弹指飞刀碎片 (9/9)", tbProp = {4, 988, 1, 1, 0, 0}},
		},
		[2] = {
			nRate = 30,
			[1] = {szName ="飞星夺魂碎片 (1/9) /9)", tbProp = {4, 666, 1, 1, 0, 0}},
			[2] = {szName ="飞星夺魂碎片  (2/9) /9)", tbProp = {4, 667, 1, 1, 0, 0}},
			[3] = {szName ="飞星夺魂碎片 (3/9) /9)", tbProp = {4, 668, 1, 1, 0, 0}},
			[4] = {szName ="飞星夺魂碎片  (4/9) /9)", tbProp = {4, 669, 1, 1, 0, 0}},
			[5] = {szName ="飞星夺魂碎片  (5/9) /9)", tbProp = {4, 670, 1, 1, 0, 0}},
			[6] = {szName ="飞星夺魂碎片  (6/9) /9)", tbProp = {4, 671, 1, 1, 0, 0}},
			[7] = {szName ="飞星夺魂碎片  (7/9) /9)", tbProp = {4, 672, 1, 1, 0, 0}},
			[8] = {szName ="飞星夺魂碎片  (8/9) /9)", tbProp = {4, 673, 1, 1, 0, 0}},
			[9] = {szName ="飞星夺魂碎片 (9/9) /9)", tbProp = {4, 674, 1, 1, 0, 0}},
		},
		[3] = {
			nRate = 30,
			[1] = {szName = "天光之定心凝神符(1/6)", tbProp = {4, 989, 1, 1, 0, 0}},
			[2] = {szName = "天光之定心凝神符(2/6)", tbProp = {4, 990, 1, 1, 0, 0}},
			[3] = {szName = "天光之定心凝神符(3/6)", tbProp = {4, 991, 1, 1, 0, 0}},
			[4] = {szName = "天光之定心凝神符(4/6)", tbProp = {4, 992, 1, 1, 0, 0}},
			[5] = {szName = "天光之定心凝神符(5/6)", tbProp = {4, 993, 1, 1, 0, 0}},
			[6] = {szName = "天光之定心凝神符(6/6)", tbProp = {4, 994, 1, 1, 0, 0}},
		},
		[4] = {
			nRate = 10,
			[1] = {szName = "冰寒之心箭腰扣碎片 (1/6)", tbProp = {4, 1206, 1, 1, 0, 0}},
			[2] = {szName = "冰寒之心箭腰扣碎片  (2/6)", tbProp = {4, 1207, 1, 1, 0, 0}},
			[3] = {szName = "冰寒之心箭腰扣碎片  (3/6)", tbProp = {4, 1208, 1, 1, 0, 0}},
			[4] = {szName = "冰寒之心箭腰扣碎片  (4/6)", tbProp = {4, 1209, 1, 1, 0, 0}},
			[5] = {szName = "冰寒之心箭腰扣碎片 (5/6)", tbProp = {4, 1210, 1, 1, 0, 0}},
			[6] = {szName = "冰寒之心箭腰扣碎片  (6/6)", tbProp = {4, 1211, 1, 1, 0, 0}},
		},
	},
	[3]	= {	-- 5毒
		[1] = {
			nRate = 25,
			[1] = {szName = "冥幻之邪刹毒刃碎片(1/9) /9)", tbProp = {4, 648, 1, 1, 0, 0}},
			[2] = {szName = "冥幻之邪刹毒刃碎片(2/9) /9)", tbProp = {4, 649, 1, 1, 0, 0}},
			[3] = {szName = "冥幻之邪刹毒刃碎片 (3/9) /9)", tbProp = {4, 650, 1, 1, 0, 0}},
			[4] = {szName = "冥幻之邪刹毒刃碎片 (4/9) /9)", tbProp = {4, 651, 1, 1, 0, 0}},
			[5] = {szName = "冥幻之邪刹毒刃碎片 (5/9) /9)", tbProp = {4, 652, 1, 1, 0, 0}},
			[6] = {szName = "冥幻之邪刹毒刃碎片(6/9) /9)", tbProp = {4, 653, 1, 1, 0, 0}},
			[7] = {szName = "冥幻之邪刹毒刃碎片(7/9) /9)", tbProp = {4, 654, 1, 1, 0, 0}},
			[8] = {szName = "冥幻之邪刹毒刃碎片 (8/9) /9)", tbProp = {4, 655, 1, 1, 0, 0}},
			[9] = {szName = "冥幻之邪刹毒刃碎片 (9/9) /9)", tbProp = {4, 656, 1, 1, 0, 0}},
		},
		[2] = {
			nRate	= 40,
			[1] = {szName = "咒缚之灭雷颈符(1/6) /6)", tbProp = {4, 837, 1, 1, 0, 0}},
			[2] = {szName = "咒缚之灭雷颈符(2/6) /6)", tbProp = {4, 838, 1, 1, 0, 0}},
			[3] = {szName = "咒缚之灭雷颈符(3/6) /6)", tbProp = {4, 839, 1, 1, 0, 0}},
			[4] = {szName = "咒缚之灭雷颈符(4/6) /6)", tbProp = {4, 840, 1, 1, 0, 0}},
			[5] = {szName = "咒缚之灭雷颈符(5/6) /6)", tbProp = {4, 841, 1, 1, 0, 0}},
			[6] = {szName = "咒缚之灭雷颈符(6/6) /6)", tbProp = {4, 842, 1, 1, 0, 0}},
		},
		[3] = {
			nRate	= 25,
			[1] = {szName = "幽胧之金蛇发带碎片(1/6) /6)", tbProp = {4, 825, 1, 1, 0, 0}},
			[2] = {szName = "幽胧之金蛇发带碎片(2/6) /6)", tbProp = {4, 826, 1, 1, 0, 0}},
			[3] = {szName = "幽胧之金蛇发带碎片 (3/6) /6)", tbProp = {4, 827, 1, 1, 0, 0}},
			[4] = {szName = "幽胧之金蛇发带碎片(4/6) /6)", tbProp = {4, 828, 1, 1, 0, 0}},
			[5] = {szName = "幽胧之金蛇发带碎片 (5/6) /6)", tbProp = {4, 829, 1, 1, 0, 0}},
			[6] = {szName = "幽胧之金蛇发带碎片(6/6) /6)", tbProp = {4, 830, 1, 1, 0, 0}},
		},
		[4] = {
			nRate	= 10,
			[1] = {szName = "冥幻之腐骨护腕碎片 (1/6)", tbProp = {4, 1194, 1, 1, 0, 0}},
			[2] = {szName = "冥幻之腐骨护腕碎片  (2/6)", tbProp = {4, 1195, 1, 1, 0, 0}},
			[3] = {szName = "冥幻之腐骨护腕碎片 (3/6)", tbProp = {4, 1196, 1, 1, 0, 0}},
			[4] = {szName = "冥幻之腐骨护腕碎片 (4/6)", tbProp = {4, 1197, 1, 1, 0, 0}},
			[5] = {szName = "冥幻之腐骨护腕碎片  (5/6)", tbProp = {4, 1198, 1, 1, 0, 0}},
			[6] = {szName = "冥幻之腐骨护腕碎片  (6/6)", tbProp = {4, 1199, 1, 1, 0, 0}},
		},
	},
	[4]	= {	-- 峨嵋
		[1]	= {
			nRate = 20,
			[1] = {szName = "无间之倚天剑碎片 (1/9) /9)", tbProp = {4, 621, 1, 1, 0, 0}},
			[2] = {szName = "无间之倚天剑碎片  (2/9) /9)", tbProp = {4, 622, 1, 1, 0, 0}},
			[3] = {szName = "无间之倚天剑碎片  (3/9) /9)", tbProp = {4, 623, 1, 1, 0, 0}},
			[4] = {szName = "无间之倚天剑碎片  (4/9) /9)", tbProp = {4, 624, 1, 1, 0, 0}},
			[5] = {szName = "无间之倚天剑碎片  (5/9) /9)", tbProp = {4, 625, 1, 1, 0, 0}},
			[6] = {szName = "无间之倚天剑碎片  (6/9) /9)", tbProp = {4, 626, 1, 1, 0, 0}},
			[7] = {szName = "无间之倚天剑碎片  (7/9) /9)", tbProp = {4, 627, 1, 1, 0, 0}},
			[8] = {szName = "无间之倚天剑碎片  (8/9) /9)", tbProp = {4, 628, 1, 1, 0, 0}},
			[9] = {szName = "无间之倚天剑碎片  (9/9) /9)", tbProp = {4, 629, 1, 1, 0, 0}},
		},
		[2] = {
			nRate = 25,
			[1] = {szName = "洗象玉扣碎片(1/6) /6)", tbProp = {4, 801, 1, 1, 0, 0}},
			[2] = {szName = "洗象玉扣碎片 (2/6) /6)", tbProp = {4, 802, 1, 1, 0, 0}},
			[3] = {szName = "洗象玉扣碎片 (3/6) /6)", tbProp = {4, 803, 1, 1, 0, 0}},
			[4] = {szName = "洗象玉扣碎片 (4/6) /6)", tbProp = {4, 804, 1, 1, 0, 0}},
			[5] = {szName = "洗象玉扣碎片 (5/6) /6)", tbProp = {4, 805, 1, 1, 0, 0}},
			[6] = {szName = "洗象玉扣碎片 (6/6) /6)", tbProp = {4, 806, 1, 1, 0, 0}},
		},
		[3] = {
			nRate = 25,
			[1] = {szName = "红缁软禢鞋碎片(1/6) /6)", tbProp = {4, 807, 1, 1, 0, 0}},
			[2] = {szName = "红缁软禢鞋碎片(2/6) /6)", tbProp = {4, 808, 1, 1, 0, 0}},
			[3] = {szName = "红缁软禢鞋碎片 (3/6) /6)", tbProp = {4, 809, 1, 1, 0, 0}},
			[4] = {szName = "红缁软禢鞋碎片 (4/6) /6)", tbProp = {4, 810, 1, 1, 0, 0}},
			[5] = {szName = "红缁软禢鞋碎片 (5/6) /6)", tbProp = {4, 811, 1, 1, 0, 0}},
			[6] = {szName = "红缁软禢鞋碎片 (6/6) /6)", tbProp = {4, 812, 1, 1, 0, 0}},
		},
		[4] = {
			nRate = 20,
			[1] = {szName = "清心向善珠碎片(1/6) /6)", tbProp = {4, 813, 1, 1, 0, 0}},
			[2] = {szName = "清心向善珠碎片 (2/6) /6)", tbProp = {4, 814, 1, 1, 0, 0}},
			[3] = {szName = "清心向善珠碎片 (3/6) /6)", tbProp = {4, 815, 1, 1, 0, 0}},
			[4] = {szName = "清心向善珠碎片 (4/6) /6)", tbProp = {4, 816, 1, 1, 0, 0}},
			[5] = {szName = "清心向善珠碎片 (5/6) /6)", tbProp = {4, 817, 1, 1, 0, 0}},
			[6] = {szName = "清心向善珠碎片 (6/6) /6)", tbProp = {4, 818, 1, 1, 0, 0}},
		},
		[5]	= {
			nRate = 10,
			[1] = {szName = "无间之拂云丝带碎片  (1/6)", tbProp = {4, 1158, 1, 1, 0, 0}},
			[2] = {szName = "无间之拂云丝带碎片   (2/6)", tbProp = {4, 1159, 1, 1, 0, 0}},
			[3] = {szName = "无间之拂云丝带碎片   (3/6)", tbProp = {4, 1160, 1, 1, 0, 0}},
			[4] = {szName = "无间之拂云丝带碎片   (4/6)", tbProp = {4, 1161, 1, 1, 0, 0}},
			[5] = {szName = "无间之拂云丝带碎片   (5/6)", tbProp = {4, 1162, 1, 1, 0, 0}},
			[6] = {szName = "无间之拂云丝带碎片   (6/6)", tbProp = {4, 1163, 1, 1, 0, 0}},
		},
	},	
	[5]	= {	-- 翠烟
		[1] = {
			nRate = 30,
			[1] = {szName = "栖凰之凤仪刀碎片 (1/9) /9)", tbProp = {4, 630, 1, 1, 0, 0}},
			[2] = {szName = "栖凰之凤仪刀碎片  (2/9) /9)", tbProp = {4, 631, 1, 1, 0, 0}},
			[3] = {szName = "栖凰之凤仪刀碎片  (3/9) /9)", tbProp = {4, 632, 1, 1, 0, 0}},
			[4] = {szName = "栖凰之凤仪刀碎片 (4/9) /9)", tbProp = {4, 633, 1, 1, 0, 0}},
			[5] = {szName = "栖凰之凤仪刀碎片  (5/9) /9)", tbProp = {4, 634, 1, 1, 0, 0}},
			[6] = {szName = "栖凰之凤仪刀碎片 (6/9) /9)", tbProp = {4, 635, 1, 1, 0, 0}},
			[7] = {szName = "栖凰之凤仪刀碎片 (7/9) /9)", tbProp = {4, 636, 1, 1, 0, 0}},
			[8] = {szName = "栖凰之凤仪刀碎片  (8/9) /9)", tbProp = {4, 637, 1, 1, 0, 0}},
			[9] = {szName = "栖凰之凤仪刀碎片  (9/9) /9)", tbProp = {4, 638, 1, 1, 0, 0}},
		},
		[2] = {
			nRate = 30,
			[1] = {szName = "碧海鸳鸯连环刀碎片(1/9) /9)", tbProp = {4, 639, 1, 1, 0, 0}},
			[2] = {szName = "碧海鸳鸯连环刀碎片 (2/9) /9)", tbProp = {4, 640, 1, 1, 0, 0}},
			[3] = {szName = "碧海鸳鸯连环刀碎片(3/9) /9)", tbProp = {4, 641, 1, 1, 0, 0}},
			[4] = {szName = "碧海鸳鸯连环刀碎片 (4/9) /9)", tbProp = {4, 642, 1, 1, 0, 0}},
			[5] = {szName = "碧海鸳鸯连环刀碎片 (5/9) /9)", tbProp = {4, 643, 1, 1, 0, 0}},
			[6] = {szName = "碧海鸳鸯连环刀碎片 (6/9) /9)", tbProp = {4, 644, 1, 1, 0, 0}},
			[7] = {szName = "碧海鸳鸯连环刀碎片(7/9) /9)", tbProp = {4, 645, 1, 1, 0, 0}},
			[8] = {szName = "碧海鸳鸯连环刀碎片 (8/9) /9)", tbProp = {4, 646, 1, 1, 0, 0}},
			[9] = {szName = "碧海鸳鸯连环刀碎片 (9/9) /9)", tbProp = {4, 647, 1, 1, 0, 0}},
		},
		[3] = {
			nRate = 30,
			[1] = {szName = "栖凰之冰踪锦腕碎片 (1/6)", tbProp = {4, 1055, 1, 1, 0, 0}},
			[2] = {szName = "栖凰之冰踪锦腕碎片(2/6)", tbProp = {4, 1056, 1, 1, 0, 0}},
			[3] = {szName = "栖凰之冰踪锦腕碎片 (3/6)", tbProp = {4, 1057, 1, 1, 0, 0}},
			[4] = {szName = "栖凰之冰踪锦腕碎片 (4/6)", tbProp = {4, 1058, 1, 1, 0, 0}},
			[5] = {szName = "栖凰之冰踪锦腕碎片 (5/6)", tbProp = {4, 1059, 1, 1, 0, 0}},
			[6] = {szName = "栖凰之冰踪锦腕碎片 (6/6)", tbProp = {4, 1060, 1, 1, 0, 0}},
		},
		[4] = {
			nRate = 10,
			[1] = {szName="栖凰之风雪白云束带碎片 (1/6)", tbProp={4, 1176, 1, 1, 0, 0}},
			[2] = {szName="栖凰之风雪白云束带碎片(2/6)", tbProp={4, 1177, 1, 1, 0, 0}},
			[3] = {szName="栖凰之风雪白云束带碎片(3/6)", tbProp={4, 1178, 1, 1, 0, 0}},
			[4] = {szName="栖凰之风雪白云束带碎片 (4/6)", tbProp={4, 1179, 1, 1, 0, 0}},
			[5] = {szName="栖凰之风雪白云束带碎片(5/6)", tbProp={4, 1180, 1, 1, 0, 0}},
			[6] = {szName="栖凰之风雪白云束带碎片 (6/6)", tbProp={4, 1181, 1, 1, 0, 0}},
		},
	},
	[6]	= {	-- 丐帮
		[1] = {
			nRate = 30,
			[1] = {szName = "绿玉杖碎片 (1/9) /9)", tbProp = {4, 675, 1, 1, 0, 0}},
			[2] = {szName = "绿玉杖碎片 (2/9) /9)", tbProp = {4, 676, 1, 1, 0, 0}},
			[3] = {szName = "绿玉杖碎片(3/9) /9)", tbProp = {4, 677, 1, 1, 0, 0}},
			[4] = {szName = "绿玉杖碎片 (4/9) /9)", tbProp = {4, 678, 1, 1, 0, 0}},
			[5] = {szName = "绿玉杖碎片 (5/9) /9)", tbProp = {4, 679, 1, 1, 0, 0}},
			[6] = {szName = "绿玉杖碎片 (6/9) /9)", tbProp = {4, 680, 1, 1, 0, 0}},
			[7] = {szName = "绿玉杖碎片 (7/9) /9)", tbProp = {4, 681, 1, 1, 0, 0}},
			[8] = {szName = "绿玉杖碎片 (8/9) /9)", tbProp = {4, 682, 1, 1, 0, 0}},
			[9] = {szName = "绿玉杖碎片 (9/9) /9)", tbProp = {4, 683, 1, 1, 0, 0}},
		},
		[2] = {
			nRate = 30,
			[1] = {szName = "同仇之亢龙护手碎片 (1/6) /6)", tbProp = {4, 855, 1, 1, 0, 0}},
			[2] = {szName = "同仇之亢龙护手碎片 (2/6) /6)", tbProp = {4, 856, 1, 1, 0, 0}},
			[3] = {szName = "同仇之亢龙护手碎片 (3/6) /6)", tbProp = {4, 857, 1, 1, 0, 0}},
			[4] = {szName = "同仇之亢龙护手碎片 (4/6) /6)", tbProp = {4, 858, 1, 1, 0, 0}},
			[5] = {szName = "同仇之亢龙护手碎片 (5/6) /6)", tbProp = {4, 859, 1, 1, 0, 0}},
			[6] = {szName = "同仇之亢龙护手碎片 (6/6) /6)", tbProp = {4, 860, 1, 1, 0, 0}},
		},
		[3] = {
			nRate = 30,
			[1] = {szName = "同仇之降龙丐衣碎片(1/6) /6)", tbProp = {4, 849, 1, 1, 0, 0}},
			[2] = {szName = "同仇之降龙丐衣碎片 (2/6) /6)", tbProp = {4, 850, 1, 1, 0, 0}},
			[3] = {szName = "同仇之降龙丐衣碎片 (3/6) /6)", tbProp = {4, 851, 1, 1, 0, 0}},
			[4] = {szName = "同仇之降龙丐衣碎片 (4/6) /6)", tbProp = {4, 852, 1, 1, 0, 0}},
			[5] = {szName = "同仇之降龙丐衣碎片 (5/6) /6)", tbProp = {4, 853, 1, 1, 0, 0}},
			[6] = {szName = "同仇之降龙丐衣碎片 (6/6) /6)", tbProp = {4, 854, 1, 1, 0, 0}},
		},
		[4] = {
			nRate = 10,
			[1] = {szName = "敌忾之狗脊皮护腕碎片 (1/6)", tbProp = {4, 1091, 1, 1, 0, 0}},
			[2] = {szName = "敌忾之狗脊皮护腕碎片 (2/6)", tbProp = {4, 1092, 1, 1, 0, 0}},
			[3] = {szName = "敌忾之狗脊皮护腕碎片  (3/6)", tbProp = {4, 1093, 1, 1, 0, 0}},
			[4] = {szName = "敌忾之狗脊皮护腕碎片  (4/6)", tbProp = {4, 1094, 1, 1, 0, 0}},
			[5] = {szName = "敌忾之狗脊皮护腕碎片  (5/6)", tbProp = {4, 1095, 1, 1, 0, 0}},
			[6] = {szName = "敌忾之狗脊皮护腕碎片  (6/6)", tbProp = {4, 1096, 1, 1, 0, 0}},
		},
	},
	[7]	= {	-- 天忍
		[1]	= {
			nRate = 30,
			[1] = {szName="幽冥枪碎片(1/9) /9)", tbProp = {4, 684, 1, 1, 0, 0}},
			[2] = {szName="幽冥枪碎片 (2/9) /9)", tbProp = {4, 685, 1, 1, 0, 0}},
			[3] = {szName="幽冥枪碎片 (3/9) /9)", tbProp = {4, 686, 1, 1, 0, 0}},
			[4] = {szName="幽冥枪碎片 (4/9) /9)", tbProp = {4, 687, 1, 1, 0, 0}},
			[5] = {szName="幽冥枪碎片 (5/9) /9)", tbProp = {4, 688, 1, 1, 0, 0}},
			[6] = {szName="幽冥枪碎片 (6/9) /9)", tbProp = {4, 689, 1, 1, 0, 0}},
			[7] = {szName="幽冥枪碎片 (7/9) /9)", tbProp = {4, 690, 1, 1, 0, 0}},
			[8] = {szName="幽冥枪碎片 (8/9) /9)", tbProp = {4, 691, 1, 1, 0, 0}},
			[9] = {szName="幽冥枪碎片 (9/9) /9)", tbProp = {4, 692, 1, 1, 0, 0}},
		},
		[2] = {
			nRate = 30,
			[1] = {szName = "魔嗜之山海飞鸿履碎片(1/6) /6)", tbProp = {4, 873, 1, 1, 0, 0}},
			[2] = {szName = "魔嗜之山海飞鸿履碎片(1/6) /6)", tbProp = {4, 874, 1, 1, 0, 0}},
			[3] = {szName = "魔嗜之山海飞鸿履碎片(1/6) /6)", tbProp = {4, 875, 1, 1, 0, 0}},
			[4] = {szName = "魔嗜之山海飞鸿履碎片(1/6) /6)", tbProp = {4, 876, 1, 1, 0, 0}},
			[5] = {szName = "魔嗜之山海飞鸿履碎片(1/6) /6)", tbProp = {4, 877, 1, 1, 0, 0}},
			[6] = {szName = "魔嗜之山海飞鸿履碎片(1/6) /6)", tbProp = {4, 878, 1, 1, 0, 0}},
		},
		[3] = {
			nRate = 30,
			[1] = {szName = "魔煌之按出虎项圈 (1/6) /6)", tbProp = {4, 867, 1, 1, 0, 0}},
			[2] = {szName = "魔煌之按出虎项圈 (2/6) /6)", tbProp = {4, 868, 1, 1, 0, 0}},
			[3] = {szName = "魔煌之按出虎项圈 (3/6) /6)", tbProp = {4, 869, 1, 1, 0, 0}},
			[4] = {szName = "魔煌之按出虎项圈 (4/6) /6)", tbProp = {4, 870, 1, 1, 0, 0}},
			[5] = {szName = "魔煌之按出虎项圈 (5/6) /6)", tbProp = {4, 871, 1, 1, 0, 0}},
			[6] = {szName = "魔煌之按出虎项圈 (6/6) /6)", tbProp = {4, 872, 1, 1, 0, 0}},
		},
		[4] = {
			nRate = 10,
			[1] = {szName = "魔煞之残阳映血甲碎片 (1/6)", tbProp = {4, 1097, 1, 1, 0, 0}},
			[2] = {szName = "魔煞之残阳映血甲碎片 (2/6)", tbProp = {4, 1098, 1, 1, 0, 0}},
			[3] = {szName = "魔煞之残阳映血甲碎片 (3/6)", tbProp = {4, 1099, 1, 1, 0, 0}},
			[4] = {szName = "魔煞之残阳映血甲碎片 (4/6)", tbProp = {4, 1100, 1, 1, 0, 0}},
			[5] = {szName = "魔煞之残阳映血甲碎片 (5/6)", tbProp = {4, 1101, 1, 1, 0, 0}},
			[6] = {szName = "魔煞之残阳映血甲碎片 (6/6)", tbProp = {4, 1102, 1, 1, 0, 0}},
		},
	},
	[8]	= {	-- 武当
		[1] =
		{
			nRate	= 10,
			[1] = {szName = "真武剑碎片 (1/9) /9)", tbProp = {4, 693, 1, 1, 0, 0}},
			[2] = {szName = "真武剑碎片 (2/9) /9)", tbProp = {4, 694, 1, 1, 0, 0}},
			[3] = {szName = "真武剑碎片 (3/9) /9)", tbProp = {4, 695, 1, 1, 0, 0}},
			[4] = {szName = "真武剑碎片 (4/9) /9)", tbProp = {4, 696, 1, 1, 0, 0}},
			[5] = {szName = "真武剑碎片 (6/9) /9)", tbProp = {4, 698, 1, 1, 0, 0}},
			[7] = {szName = "真武剑碎片 (7/9) /9)", tbProp = {4, 699, 1, 1, 0, 0}},
			[8] = {szName = "真武剑碎片 (8/9) /9)", tbProp = {4, 700, 1, 1, 0, 0}},
			[9] = {szName = "真武剑碎片 (9/9) /9)", tbProp = {4, 701, 1, 1, 0, 0}},
		},
		[2] =
		{
			nRate	= 50,
			[1] = {szName = "及丰之三清符(1/6) /6)", tbProp = {4, 885, 1, 1, 0, 0}},
			[2] = {szName = "及丰之三清符(2/6) /6)", tbProp = {4, 886, 1, 1, 0, 0}},
			[3] = {szName = "及丰之三清符(3/6) /6)", tbProp = {4, 887, 1, 1, 0, 0}},
			[4] = {szName = "及丰之三清符(4/6) /6)", tbProp = {4, 888, 1, 1, 0, 0}},
			[5] = {szName = "及丰之三清符(5/6) /6)", tbProp = {4, 889, 1, 1, 0, 0}},
			[6] = {szName = "及丰之三清符(6/6) /6)", tbProp = {4, 890, 1, 1, 0, 0}},
		},
		[3] =
		{
			nRate	= 10,
			[1] = {szName = "凌岳之无极玄玉佩碎片(1/6) /6)", tbProp = {4, 879, 1, 1, 0, 0}},
			[2] = {szName = "凌岳之无极玄玉佩碎片 (2/6) /6)", tbProp = {4, 880, 1, 1, 0, 0}},
			[3] = {szName = "凌岳之无极玄玉佩碎片 (3/6) /6)", tbProp = {4, 881, 1, 1, 0, 0}},
			[4] = {szName = "凌岳之无极玄玉佩碎片 (4/6) /6)", tbProp = {4, 882, 1, 1, 0, 0}},
			[5] = {szName = "凌岳之无极玄玉佩碎片(5/6) /6)", tbProp = {4, 883, 1, 1, 0, 0}},
			[6] = {szName = "凌岳之无极玄玉佩碎片 (6/6) /6)", tbProp = {4, 884, 1, 1, 0, 0}},
		},
		[4] =
		{
			nRate	= 30,
			[1] = {szName = "凌岳之怒雷法戒碎片 (1/6)", tbProp = {4, 1260, 1, 1, 0, 0}},
			[2] = {szName = "凌岳之怒雷法戒碎片  (2/6)", tbProp = {4, 1261, 1, 1, 0, 0}},
			[3] = {szName = "凌岳之怒雷法戒碎片  (3/6)", tbProp = {4, 1262, 1, 1, 0, 0}},
			[4] = {szName = "凌岳之怒雷法戒碎片  (4/6)", tbProp = {4, 1263, 1, 1, 0, 0}},
			[5] = {szName = "凌岳之怒雷法戒碎片  (5/6)", tbProp = {4, 1264, 1, 1, 0, 0}},
			[6] = {szName = "凌岳之怒雷法戒碎片  (6/6)", tbProp = {4, 1265, 1, 1, 0, 0}},
		},
	},
	[9] = {	-- 昆仑
		[1] = {
			nRate	= 20,
			[1] = {szName = "千年寒铁碎片 (1/9) /9)", tbProp = {4, 702, 1, 1, 0, 0}},
			[2] = {szName = "千年寒铁碎片 (2/9) /9)", tbProp = {4, 703, 1, 1, 0, 0}},
			[3] = {szName = "千年寒铁碎片 (3/9) /9)", tbProp = {4, 704, 1, 1, 0, 0}},
			[4] = {szName = "千年寒铁碎片 (4/9) /9)", tbProp = {4, 705, 1, 1, 0, 0}},
			[5] = {szName = "千年寒铁碎片 (5/9) /9)", tbProp = {4, 706, 1, 1, 0, 0}},
			[6] = {szName = "千年寒铁碎片 (6/9) /9)", tbProp = {4, 707, 1, 1, 0, 0}},
			[7] = {szName = "千年寒铁碎片 (7/9) /9)", tbProp = {4, 708, 1, 1, 0, 0}},
			[8] = {szName = "千年寒铁碎片 (8/9) /9)", tbProp = {4, 709, 1, 1, 0, 0}},
			[9] = {szName = "千年寒铁碎片 (9/9) /9)", tbProp = {4, 710, 1, 1, 0, 0}},
		},
		[2] = {
			nRate = 30,
			[1] = {szName = "雷穹之天地护符(1/6) /6)", tbProp = {4, 891, 1, 1, 0, 0}},
			[2] = {szName = "雷穹之天地护符(2/6) /6)", tbProp = {4, 892, 1, 1, 0, 0}},
			[3] = {szName = "雷穹之天地护符(3/6) /6)", tbProp = {4, 893, 1, 1, 0, 0}},
			[4] = {szName = "雷穹之天地护符(4/6) /6)", tbProp = {4, 894, 1, 1, 0, 0}},
			[5] = {szName = "雷穹之天地护符(5/6) /6)", tbProp = {4, 895, 1, 1, 0, 0}},
			[6] = {szName = "雷穹之天地护符(6/6) /6)", tbProp = {4, 896, 1, 1, 0, 0}},
		},
		[3] = {
			nRate = 30,
			[1] = {szName = "雾幻之北冥道冠(1/6) /6)", tbProp = {4, 897, 1, 1, 0, 0}},
			[2] = {szName = "雾幻之北冥道冠 (2/6) /6)", tbProp = {4, 898, 1, 1, 0, 0}},
			[3] = {szName = "雾幻之北冥道冠 (3/6) /6)", tbProp = {4, 899, 1, 1, 0, 0}},
			[4] = {szName = "雾幻之北冥道冠 (4/6) /6)", tbProp = {4, 900, 1, 1, 0, 0}},
			[5] = {szName = "雾幻之北冥道冠 (5/6) /6)", tbProp = {4, 901, 1, 1, 0, 0}},
			[6] = {szName = "雾幻之北冥道冠 (6/6) /6)", tbProp = {4, 902, 1, 1, 0, 0}},
		},
		[4] = {
			nRate = 20,
			[1] = {szName="霜晶之清风缕带碎片 (1/6)", tbProp={4, 1272, 1, 1, 0, 0}},
			[2] = {szName="霜晶之清风缕带碎片(2/6)", tbProp={4, 1273, 1, 1, 0, 0}},
			[3] = {szName="霜晶之清风缕带碎片 (3/6)", tbProp={4, 1274, 1, 1, 0, 0}},
			[4] = {szName="霜晶之清风缕带碎片(4/6)", tbProp={4, 1275, 1, 1, 0, 0}},
			[5] = {szName="霜晶之清风缕带碎片 (5/6)", tbProp={4, 1276, 1, 1, 0, 0}},
			[6] = {szName="霜晶之清风缕带碎片 (6/6)", tbProp={4, 1277, 1, 1, 0, 0}},
		},
	},
};

function here_main()
	if (hero_check_player() == 0) then
		return 0;
	end
	
	AddExtPoint(hero_Award_ExtPoint, 1);
	
	local nFaction = GetLastFactionNumber();
	tbAwardTemplet:GiveAwardByList(hero_tbAward[nFaction], "英雄少年");
	Say("万年加：果真不凡，这是少侠的奖励!", 1, "多谢前辈，小辈告辞/OnCancel");
end

function hero_check_player()
	if (GetExtPoint(hero_Award_ExtPoint) ~= 1 and GetExtPoint(hero_Award_ExtPoint) ~= 2) then
		Say("万年加：真是遗憾，该账号不能在活动期间制造，不能参加该活动.");
		return 0;
	end
	
	if (GetExtPoint(hero_Award_ExtPoint) == 2) then
		Say("万年加：该账号已领奖，不能领了.", 1, "好的，真是不好意思/OnCancel");
		return 0;
	end
	
	if (GetLevel() < 140) then
		Say("万年加：真是遗憾，等级不够，不能参加该活动.");
		return 0;
	end
	
	if (GetRepute() < 455) then
		Say("万年加：: 少侠虽然已经够140级了，但是名望值过低，需要更加努力。1，好的，小辈会更努力琻./OnCancel");
		return 0;
	end
	
	if (GetTask(747) < 900) then
		Say("万年加：: 少侠虽然已经够140级了，但是宋金积分不够，需要更加努力。1，好的，小辈会更努力./OnCancel");
		return 0;
	end
	
	if (GetLeadLevel() < 30) then
		Say("万年加：: 少侠虽然已经够140级了，但是统帅点过低，需要更加努力。1，好的，小辈会更努力./OnCancel");
		return 0;
	end
	
	if (GetTask(151) < 1000) then
		Say("万年加：: 少侠虽然已经够140级了，但是福缘点不够，需要更加努力。1，好的，小辈会更努力./OnCancel");
		return 0;
	end
	
	if (hero_get_task_account() < 300) then	-- renwu
		Say("万年加：: 少侠虽然已经够140级了，但是野叟任务不足，需要更加努力。1，好的，小辈会更努力./OnCancel");
		return 0;
	end
	
	local _, nTongID = GetTongName();
	if (nTongID == 0) then
		Say("万年加：: 少侠虽然已经够140级了，但是还未加入帮会，需要更加努力。1，好的，小辈会更努力./OnCancel");
		return 0;
	end
	
	if (GetTask(2463) <= 0 ) then	-- 120skill
		Say("万年加：: 少侠虽然已经够140级了，但是还未学120技能，需要更加努力。1，好的，小辈会更努力./OnCancel");
		return 0;
	end
	
	if (CalcFreeItemCellCount() < here_nFreeCell) then
		Say("万年加：: 不能了，装备已满，请先整理装备.");
		return 0;
	end	
	return 1;
end


function hero_get_task_account()
	local tb_tasklevel = {
		{1,		1},
		{20,	3},
		{50,	6},
		{80,	11},
		{100,	16},
		{201,	21},
		}
	local n_hardbase = 1;
	local n_hardtime = 0;
	local n_nexthard = 1;
	local ring	= GetByte(GetTask(1020),3);
	local hard	= GetByte(GetTask(1020),2);
	local times	= GetByte(GetTask(1020),1);
	local chain	= GetTask(1035);
	if (hard > 20) then
		hard = 20
	end
	
	for i=1, getn(tb_tasklevel) do
		if (hard >= tb_tasklevel[i][2]) then
			n_hardbase = tb_tasklevel[i][2];
			n_nexthard = tb_tasklevel[i+1][2];
		else
			break
		end
	end
	
	n_hardtime = floor(400 / (n_nexthard - n_hardbase));
	
	return (ring * 400 + (hard - n_hardbase) * n_hardtime + times + chain * 20);
end

function hero_intruduction()
	local szTitle = "万年佳: 从<color=yellow>11-06-2008 到 11-08-2008<color>, 在此期间内创立的账号人物达到140级，可以获得455点名望值，30点统帅值，1000点福缘值，300个野叟任务，900点宋金积分，加入帮会学到120技能，可以到这领取有价值的奖励。";
	Say(szTitle, 1, "多谢前辈指教!/OnCancel");
end