-- 职能　铁匠
-- by：Li_Xin(2004-07-26)


function help()
        Say("铁匠：近来盛传江湖中出现了一些武器图谱， 依照图谱可以提升武器等级。我这里有一些关于武器图谱的线索，你想知道吗？",11,"武器图谱升级流程/onhelp","陵王枪锻造残篇/onhelp","玄武锤之铸造术/onhelp","龙吟剑锻造图/onhelp","诸葛机括密要/onhelp","柳叶碎风刀·萃取篇/onhelp","玄月刀紫荆宝录/onhelp","天机棍图谱/onhelp","暗器总谱·卷一/onhelp","鸳鸯刀·开光篇/onhelp","什么也不想知道/no")
end;

function onhelp(nSel)
        if(nSel == 0) then
        	Talk(1,"","铁匠：我来为你解释一下武器图谱的用途吧。将需要升级的武器放入镶嵌框正中位置，图谱放在等级一栏。如果符合条件，我自然能够帮你提升武器等级。")
        elseif(nSel == 1) then
        	Talk(1,"","铁匠:陵王枪锻造残篇是枪类武器的武器图谱，用它可以提升枪的等级。听说它现在在扬州和临安的神秘商人手上。")
        elseif(nSel == 2) then
        	Talk(1,"","铁匠:玄武锤之铸造术是锤类武器的武器图谱，用它可以提升锤的等级。听说它现在在扬州和临安的神秘商人手上。")
        elseif(nSel == 3) then
        	Talk(1,"","铁匠:龙吟剑锻造图是剑类武器的武器图谱，用它可以提升剑的等级。听说它现在在扬州和临安的神秘商人手上。")
        elseif(nSel == 4) then
        	Talk(1,"","铁匠:诸葛机括密要是弩类武器的武器图谱，用它可以提升弩的等级。听说它现在在扬州和临安的神秘商人手上。")
        elseif(nSel == 5) then
        	Talk(1,"","铁匠:柳叶碎风刀·萃取篇是飞刀类武器的武器图谱，用它可以提升飞刀的等级。听说它现在在扬州和临安的神秘商人手上。")
        elseif(nSel == 6) then
        	Talk(1,"","铁匠:玄月刀紫荆宝录是刀类武器的武器图谱，用它可以提升刀的等级。听说它现在在扬州和临安的神秘商人手上。")
        elseif(nSel == 7) then
        	Talk(1,"","铁匠:天机棍图谱是棍类武器的武器图谱，用它可以提升棍的等级。听说它现在在扬州和临安的神秘商人手上。")
        elseif(nSel == 8) then
        	Talk(1,"","铁匠:暗器总谱·卷一是飞镖类武器的武器图谱，用它可以提升飞镖的等级。听说它现在在扬州和临安的神秘商人手上。")
        elseif(nSel == 9) then
        	Talk(1,"","铁匠:鸳鸯刀·开光篇是双刀类武器的武器图谱，用它可以提升双刀的等级。听说它现在在扬州和临安的神秘商人手上。")
        end;
end;
   	
       