
-- 各地图入口点索引表
-- Edited by peres

-- 表格的格式为：{地图编号, 地图名称, 地图传入 X 轴, 地图传入 Y  轴}
-- PS：做完这张表我要昏了……



TL_MAPTRAPINDEX = {

	{1,  "凤翔",  1528,  2733},
	{2,  "华山",  2287,  4092},
	{3,  "剑阁蜀道西北入口",  932,  4076},
	{4,  "剑阁蜀道金光洞",  1797,  3058},
	{5,  "剑阁蜀道经皇洞",  1822,  3473},
	{6,  "剑阁蜀道锁云洞",  1384,  3286},
	{7,  "秦始皇陵地表",  2417,  2631},
	{8,  "秦始皇陵一层",  1603,  3497},
	{9,  "长江源头",  2478,  5691},
	{10,  "雁石洞",  1603,  3209},
	{11,  "成都",  3100,  4822},
	{12,  "信相寺后院地道迷宫",  1589,  3188},
	{13,  "峨嵋派",  1867,  5021},
	{14,  "猛虎洞穴迷宫",  1589,  3217},
	{15,  "讲经堂",  1588,  3200},
	{16,  "峨嵋派前殿",  1595,  3180},
	{17,  "峨嵋派正殿",  1592,  3211},
	{18,  "峨嵋派左偏殿",  1608,  3191},
	{19,  "剑阁蜀道西南入口",  3486,  4070},
	{20,  "江津村",  3701,  6232},
	{21,  "青城山",  2247,  3923},
	{22,  "白云洞",  1752,  3372},
	{23,  "神仙洞",  1710,  3077},
	{24,  "响水洞",  1692,  3189},
	{25,  "唐门",  3532,  5770},
	{26,  "竹丝洞一层",  1603,  3210},
	{27,  "竹丝洞二层",  1607,  3208},
	{28,  "竹丝洞三层",  1551,  3192},
	{29,  "唐门暗器房",  1604,  3201},
	{30,  "唐门火器房",  1597,  3205},
	{31,  "唐门武功房",  1610,  3209},
	{32,  "唐门医药房",  1595,  3205},
	{33,  "唐门会客大厅",  1596,  3213},
	{34,  "唐门议事大厅",  1599,  3211},
	{35,  "唐门正房",  1598,  3208},
	{36,  "唐门祭祖厅",  1592,  3193},
	{37,  "汴京",  2081,  2477},
	{38,  "铁塔迷宫一",  1702,  3134},
	{39,  "铁塔迷宫二",  1690,  3032},
	{40,  "铁塔迷宫三",  1668,  3133},
	{41,  "伏牛山西",  2078,  2804},
	{42,  "天心洞",  1648,  3119},
	{43,  "剑阁中原",  1673,  2713},
	{45,  "天忍教",  1559,  3246},
	{46,  "天忍教室内",  1611,  3201},
	{47,  "天忍教室内左",  1606,  3054},
	{48,  "天忍教室内右",  1672,  3138},
	{49,  "天忍教室内",  1608,  3192},
	{50,  "七杀洞",  1425,  3217},
	{51,  "天忍教圣洞",  1666,  3291},
	{52,  "天忍教圣洞",  1617,  3261},
	{53,  "巴陵县",  1342,  3346},
	{54,  "南岳镇",  1618,  2969},
	{55,  "桃花源",  1729,  3282},
	{56,  "衡山",  1594,  3210},
	{57,  "衡山大厅",  1586,  3202},
	{58,  "独孤剑卧室",  1608,  3192},
	{59,  "天王帮",  1425,  3472},
	{60,  "天王帮前殿",  1594,  3193},
	{61,  "天王大殿",  1591,  3204},
	{62,  "天王帮寝宫",  1611,  3202},
	{65,  "天王岛山洞",  1596,  3250},
	{66,  "洞庭湖底",  1596,  3199},
	{67,  "洞庭湖底",  1591,  3193},
	{68,  "青螺岛",  1545,  2972},
	{69,  "青螺岛山洞",  1600,  3207},
	{70,  "武陵山",  1649,  3050},
	{71,  "白水洞迷宫",  1739,  3208},
	{72,  "大酋洞迷宫",  1611,  2969},
	{73,  "伏流洞迷宫",  1599,  3210},
	{74,  "神农架",  1947,  3120},
	{75,  "蚩尤洞迷宫",  1872,  3071},
	{76,  "山宝洞迷宫",  1796,  2959},
	{77,  "燕子洞迷宫",  1549,  3169},
	{78,  "襄阳",  1299,  3483},
	{79,  "襄阳衙门秘道",  1599,  3206},
	{80,  "扬州",  1345,  3359},
	{81,  "武当派",  1620,  3595},
	{82,  "武当派井底迷宫",  1593,  3193},
	{83,  "武当派火狼洞迷宫",  1584,  3248},
	{84,  "武当派紫霄大殿",  1590,  3193},
	{85,  "武当派十方殿",  1597,  3192},
	{86,  "武当派父母殿",  1606,  3191},
	{87,  "武当派龙虎殿",  1596,  3190},
	{90,  "伏牛山东",  1649,  3567},
	{91,  "鸡冠洞",  1806,  2858},
	{92,  "蜀冈山",  2025,  3040},
	{93,  "荐菊洞",  1526,  3172},
	{94,  "灵谷洞",  1751,  3107},
	{96,  "新手客栈",  1583,  3217},
	{98,  "清溪洞",  1526,  2958},
	{99,  "永乐镇",  1849,  2835},
	{100,  "朱仙镇",  1852,  3356},
	{101,  "稻香村",  1767,  2816},
	{102,  "天忍教圣洞二层密室",  1608,  3199},
	{103,  "少林派",  1622,  3565},
	{104,  "藏经阁",  1592,  3190},
	{105,  "达摩堂",  1601,  3190},
	{106,  "大雄宝殿",  1591,  3204},
	{107,  "弟子房一",  1593,  3178},
	{108,  "弟子房二",  1596,  3182},
	{109,  "方丈禅室",  1596,  3185},
	{110,  "罗汉堂",  1606,  3199},
	{111,  "木人巷",  1580,  3417},
	{112,  "千佛殿",  1601,  3193},
	{113,  "少林密室",  1675,  3361},
	{114,  "一百零八罗汉阵",  1499,  3312},
	{115,  "丐帮",  1538,  4021},
	{116,  "地下迷宫一层",  1787,  2980},
	{117,  "地下迷宫二层",  1660,  2947},
	{118,  "地下迷宫三层",  1525,  2962},
	{119,  "地下迷宫四层",  1569,  3099},
	{120,  "地下迷宫五层",  1815,  3195},
	{121,  "龙门镇",  1715,  4394},
	{122,  "黄河源头",  1612,  3328},
	{123,  "老虎洞迷宫",  1698,  3363},
	{124,  "轩辕洞迷宫",  1672,  3420},
	{125,  "留仙洞一层",  1811,  3219},
	{126,  "留仙洞二层",  1496,  2929},
	{127,  "留仙洞三层",  1769,  3216},
	{128,  "留仙洞四层",  1515,  3123},
	{129,  "留仙洞五层",  1597,  3212},
	{130,  "留仙洞六层",  1547,  3143},
	{131,  "昆仑派",  1872,  3659},
	{132,  "冰穴山洞",  1701,  3407},
	{135,  "见性峰山洞",  1748,  3198},
	{136,  "快活林",  1716,  3144},
	{137,  "天微殿",  1603,  3202},
	{138,  "昆仑派正殿",  1604,  3203},
	{139,  "紫微殿",  1612,  3207},
	{140,  "药王谷",  2429,  3731},
	{141,  "药王洞一层",  1603,  3372},
	{142,  "药王洞二层",  1467,  3288},
	{143,  "药王洞三层",  1602,  3215},
	{144,  "药王洞四层",  1690,  3023},
	{145,  "雪豹洞一层",  1563,  3245},
	{146,  "雪豹洞二层",  1630,  3325},
	{147,  "雪豹洞三层",  1630,  3323},
	{148,  "雪豹洞四层",  1527,  3273},
	{149,  "雪豹洞五层",  1611,  3220},
	{150,  "雪豹洞六层",  1613,  3184},
	{151,  "雪豹洞七层",  1612,  3218},
	{152,  "雪豹洞八层",  1675,  3365},
	{153,  "石鼓镇",  1439,  3042},
	{154,  "翠烟门",  628,  1261},
	{155,  "翠烟门百花厅",  1585,  3207},
	{156,  "翠烟门弟子房一",  1599,  3203},
	{157,  "翠烟门弟子房二",  1587,  3221},
	{158,  "翠烟门禁地迷宫",  1584,  3191},
	{160,  "翠烟门守玉厅",  1596,  3208},
	{161,  "翠烟门主房",  1600,  3202},
	{162,  "大理",  1642,  2935},
	{163,  "恶霸家地道",  1559,  3201},
	{164,  "千寻塔一层",  1606,  3194},
	{165,  "千寻塔二层",  1501,  3295},
	{166,  "千寻塔三层",  1662,  3245},
	{167,  "点苍山",  1214,  2731},
	{168,  "凤眼洞迷宫",  1508,  3005},
	{169,  "龙眼洞迷宫",  1596,  3212},
	{170,  "土匪洞迷宫",  1605,  3191},
	{171,  "点苍山洞一层",  1532,  3130},
	{172,  "点苍山洞二层",  1586,  3223},
	{173,  "点苍山洞三层",  1353,  3102},
	{174,  "龙泉村",  1818,  3017},
	{175,  "西山村",  1595,  3240},
	{176,  "临安",  1614,  2561},
	{177,  "御花园",  1619,  3222},
	{178,  "御花园山洞",  1609,  3200},
	{179,  "罗霄山",  1618,  3292},
	{180,  "龙宫洞迷宫",  1509,  3106},
	{181,  "两水洞迷宫",  1590,  3199},
	{182,  "孽龙洞迷宫",  1997,  3067},
	{183,  "五毒教",  1371,  3677},
	{184,  "赤蝎寨",  1590,  3208},
	{185,  "金蛇寨",  1612,  3204},
	{186,  "墨蛛寨",  1613,  3210},
	{187,  "青蜈寨",  1605,  3200},
	{188,  "银蟾寨",  1587,  3205},
	{189,  "总寨",  1581,  3194},
	{190,  "五毒教入门迷宫",  1380,  3003},
	{193,  "武夷山",  1937,  2851},
	{194,  "玉华洞迷宫",  1599,  3199},
	{195,  "雁荡山",  682,  2863},
	{196,  "羊角洞迷宫",  1691,  3068},
	{198,  "清溪洞",  1522,  2955},
	{199,  "武陵洞",  1644,  2906},
	{200,  "古阳洞",  1612,  3171},
	{201,  "冰河洞",  1599,  3197},
	{202,  "芙蓉洞",  1786,  2823},
	{203,  "无名洞",  1551,  2992},
	{204,  "飞天洞",  1679,  3391},
	{205,  "阳中洞",  1698,  3408},
	{206,  "秦始皇陵二层",  1790,  3265},
	{207,  "秦始皇陵三层",  1595,  3205},
	{224,  "沙漠迷宫地表",  1591,  3013},
	{225,  "沙漠迷宫山洞一",  1476,  3274},
	{226,  "沙漠迷宫山洞二",  1553,  3173},
	{227,  "沙漠迷宫山洞三",  1530,  3270},
	{231,  "沧浪客居所",  1611,  3193},
	{319,  "临渝关",  2031,  3286},
	{320,  "长白山脚",  1386,  2253},
	{321,  "长白山南麓",  966,  2296},
	{322,  "长白山北麓",  2048,  4120},
	{340,  "莫高窟",  1853,  3446}
}


-- 传入参数为想要搜寻的地图 ID 号
-- 返回值为地图的名称、入口 X 轴坐标、入口 Y 轴坐标

function tl_getMapInfo(myMapID)

local i

	for i=1, getn(TL_MAPTRAPINDEX) do
		if (TL_MAPTRAPINDEX[i][1] == myMapID) then
			return TL_MAPTRAPINDEX[i][2], TL_MAPTRAPINDEX[i][3], TL_MAPTRAPINDEX[i][4]
		end
	end

return 0,0,0 -- 如果在表中没找到相应的地图则返回 0

end


-- 传送人物到任务指定的地图

function tl_moveToTaskMap()

local myMapID, myMapName, myMapX, myMapY

	myMapID = GetTask(1031)
			
	myMapName, myMapX, myMapY = tl_getMapInfo(myMapID)
			
	if (myMapName ~= 0) then
		Say("车夫：您现在是要前往野叟任务的所在地".."<color=yellow>"..myMapName.."<color>".."吗？看在野叟老大人的份上此行可以免费哦！",2,"是的，快点送我过去吧/tl_moveToTaskMap_Confirm","算了，我还有别的事情/tl_moveToTaskMap_Cancel");
	else
		Say("车夫：实在不好意思，您要去的那个地方实在太难了，还是请阁下自己努力走过去吧。",0);
	end

end


function tl_moveToTaskMap_Confirm()

local nResult

local myMapID, myMapName, myMapX, myMapY

	myMapID = GetTask(1031)
			
	myMapName, myMapX, myMapY = tl_getMapInfo(myMapID)

	nResult = NewWorld(myMapID, myMapX, myMapY)
	
	SetFightState(1)
	
	if (nResult == 0) then
		SetFightState(0)
		Msg2Player("抱歉，目前还未能传送过去");
		return
	end
	
end


function tl_moveToTaskMap_Cancel()

end