-- 扬州 路人NPC 如意（入门任务）
-- by：Dan_Deng(2003-07-28)

function main()
	Uworld30 = GetByte(GetTask(30),2)
	if (Uworld30 == 10) and (HaveItem(74) == 0) then		--入门任务中并且没有该物品
		Say("要怎么表扬呢 ",4,"相貌/prise_1","学识 /prise_2","朋友 /prise_3","离开/prise_exit")
	else					--在普通对话中给一点点任务提示。
		i = random(0,2)
		if (i == 0) then
			Talk(1,"","妓女：这里是个卖笑买快乐的地方，公子，你别不好意思……你是第一次来吧？")
		elseif (i == 1) then
			Talk(1,"","妓女：别碍着我做生意！")
		else
			Talk(1,"","为什么总是嫉妒我的美色？难道美也有罪吗?")
		end
	end
end;

function prise_1()
--	if (GetSex() == 1) then		--若玩家角色是女性，对话应该修改。先留出接口，具体的言词以后再改。
--		Talk(4,"","玩家：这位姑娘眉如翠羽，肌如白雪，腰如束素，齿如含贝。增之一分则太长，减之一分则太短。著粉则太白，施朱则太赤。当真有西施之貌，贵妃之容啊！","女子：你真有眼光，姑娘我号称扬州第一美人，八岁以上，八十岁以下，只要是男人，没有不拜倒在本姑娘的裙下的！","玩家：我真是荣幸，竟能见识到扬州第一美女，不知姑娘能否送我一条手帕，让我见帕如见人，永远记住姑娘的美貌？","女子：这有何难？")
--	else
		Talk(4,"","玩家：这位姑娘眉如翠羽，肌如白雪，腰如束素，齿如含贝。不输西施、贵妃!","女子：你真有眼光，姑娘我号称扬州第一美人，八岁以上，八十岁以下，只要是男人，没有不拜倒在本姑娘的裙下的！","玩家：我真是荣幸，竟能见识到扬州第一美女，不知姑娘能否送我一条手帕，让我见帕如见人，永远记住姑娘的美貌？","女子：这有何难 ?")
--	end
	AddEventItem(74)
	Msg2Player("书生送你一把扇子")
	AddNote("得到一块手帕. ")
end;

function prise_2()
	Talk(2,"","这位姑娘气质清净，一定是有学问的家庭出身。真是女中状元.","小女子无德无能!")
end;

function prise_3()
	Talk(2,"","姑娘真是让人爱戴，一定有很多朋友吧?","他们妒忌我的美丽，所以我不和他们做朋友!")
end;

function prise_exit()
end;
