-- 大理城 路人NPC 段花农（翠烟门30级任务）
-- by：Dan_Deng(2003-07-26)

function main()
	UTask_cy = GetTask(6)
	if (UTask_cy == 30*256+10) then		--30级任务进行中（救孙女启动）
		Talk(6,"",".段大爷，听说你种花很厉害，我来想麻烦你传给我种舞衣霓裳的秘诀","呜呜.....我可怜的孩纸.....","大爷，你的孩纸怎么了?","她被点苍山的土匪给抓走了，现在不懂生死如何。.....","段大爷，不用担心，我会帮你去救她.","女侠，你真是一个好人，只要你救了我的孩纸，什么事我都答应你! ")
		SetTask(6,30*256+20)
		AddNote("到点苍山，找土匪解救茶农的孩纸 ")
		Msg2Player("到点苍山，找土匪解救茶农的孩纸")
	elseif (UTask_cy == 30*256+30) then		--30级任务进行中（救孙女完成）
		Talk(5,"","感谢你救了我的孩纸，这个大恩大德我不会忘.","段大爷，你知道种舞衣霓裳吗?","小姑娘，算你问对人了，种舞衣霓裳的秘密只有我知道，从来没有传给外人，但是，你救了我的孩纸，我就传给你.","种舞衣霓裳需要有3种原料：一种是洱海的银鳕鱼，第二种是蝴蝶泉旁边的碧常凤蝶，第三种是云农亭的红蚯蚓.","多谢大爷! ")
		SetTask(6,30*256+40)
		AddNote("种舞衣霓裳需要有3种原料：洱海的银鳕鱼，蝴蝶泉旁边的碧常凤蝶，云农亭的红蚯蚓")
		Msg2Player("种舞衣霓裳需要有3种原料：洱海的银鳕鱼，蝴蝶泉旁边的碧常凤蝶，云农亭的红蚯蚓")
	elseif (UTask_cy == 30*256+20) then
		Talk(1,"","女侠，只要你救了我的孩纸，什么事我都答应你! ")
	else
		Talk(1,"","种这种花，既是科学，又是艺术.")
	end
end
