-- 大理城　路人　崇圣寺虚圆方丈（翠烟门50级任务）
-- by：Dan_Deng(2003-07-27)

function main()
	UTask_cy = GetTask(6)
	if (UTask_cy == 50*256+10) then		--50级任务
		SetTask(6,50*256+32)
		Talk(4,"","方丈大师，我是翠烟弟子，掌门叫我来帮贵寺找宝物.","阿弥陀佛，麻烦施主了，盗贼已经躲进天蚕塔了.","此塔是大理圣地，所以，为了防止他人进入，在塔里有很多铜人。施主进去要小心。!","大师放心! ")
	elseif (UTask_cy == 50*256+32) and (HaveItem(5) == 1) then		-- 完成
		SetTask(6,50*256+50)
		DelItem(5)
		Talk(3,"","方丈大师，这个是贵寺丢失的梧桐观音，现在还给大师.","阿弥陀佛，镇寺宝物找到了，真是菩萨保佑，多谢施主。请替我谢谢贵派掌门.","大师不要客气!")
		Msg2Player("交梧桐观音给方丈虚圆")
		AddNote("交梧桐观音给方丈虚圆")
	elseif (UTask_cy >= 50*256+32) and (UTask_cy < 50*256+50) then		-- 任务过程中
		Talk(1,"","一切就麻烦女施主了，我在这里念经给施主祈祷")
	elseif (UTask_cy >= 50*256+50) then						-- 任务完成以后
		Talk(1,"","多谢施主，施主的恩德不懂怎么报答.")
	else
		Talk(3,"","梧桐观音是崇圣寺的宝物，也是崇圣寺的骄傲","你出家怎么有好胜高傲的心理呢？","施主的教训，贫僧会好好想想，阿弥陀佛，阿弥陀佛，阿弥陀佛. ")
	end
end;
