-- 翠烟门 路人NPC 春香婆婆（翠烟门出师任务）
-- by：Dan_Deng(2003-07-27)

function main()
	UTask_cy = GetTask(6)
	if (GetFaction() == "cuiyan") then
		if (UTask_cy == 60*256+20) then				--出师任务进行中
			Talk(2,"","婆婆，那个老伯告诉我事情的真相了，我将带那封信给掌门，大家看完就知道师祖的苦心了 ","师姐的心愿，我已经帮她完成了，那也幸运了! ")
			SetTask(6,60*256+30)
		elseif (UTask_cy == 60*256) and (GetLevel() >= 50) then		--出师任务
			Talk(3,"L60_get","外面的人对咱们翠烟门一直存有偏见，门下弟子里也一直有一种传言，说本门的创派祖师因为当年遭爱人遗弃，性情大变，恨尽天下男子，所以定下门规，要让本门弟子世世代代都痛恨男子，这些门规就像绳索，一直束缚着大家，其实事实根本不是这样！这其中的缘由外人不明也就罢了，咱们自己人也这么想，就让人太伤心了.","怎样才能让大家明白事情的真相呢?")
		else
			Talk(1,"","从小流落江湖，转眼间就多年过去了")
		end
	else
		Talk(1,"","记得那天还抱着尹掌门，现在已经这么大了，时间飞逝! ")
	end
end;

function L60_get()
	Say("事实真相和一个在禁地里的人有关，只用找到他就事情真相大白了",2,"继续了解/L60_get_yes","不用担心/L60_get_no")
end;

function L60_get_yes()
	Talk(4,"","身为本门弟子，有责任找出真相?","出门向东北方向走就能到玉女湖，禁地在玉女湖附近! ","可以，我去了! ","不用急，年轻人，为了保护你的性命，在见那个人之前，需要一条丝帕，这个丝帕将出现在禁宫山洞."	)
	SetTask(6,60*256+10)
	AddNote("接翠烟门出师任务，调查翠烟门禁地真相")
	Msg2Player("接翠烟门出师任务，调查翠烟门禁地真相")
end;

function L60_get_no()
end;
