
Include("\\script\\task\\newtask\\newtask_head.lua");
-- Include("\\script\\task\\newtask\\master\\xiepai\\giveaward.lua");
Include("\\script\\task\\newtask\\master\\clearskillpoint.lua");
Include("\\script\\task\\newtask\\master\\newtaskprize.lua")

--   ////////////////////////////
--  //  邪教主线任务模块实例  //
-- ////////////////////////////

-- Edited by peres
-- 2004/12/23

-- 过程函数名命名形式：task_ + level(任务等级)_ + 过程环节ID


--   ///////////////////////////////
--  //  20 级主线任务的处理过程  //
-- ///////////////////////////////

-- 与朱仙镇云儿的对话
function task_level20_00()

		-- 判断玩家的性别说不同的话
		if (GetSex()==0) then
			Talk(10,"task_level20_01","云儿：呦，好俊俏的人儿，来找我有何事呀？","玩家：嗯……听说您知道“天煌龙器”的下落？","云儿：哎，俊哥哥，别一上来就讲什么龙器不龙器的嘛，陪奴家聊点高兴的事儿？","玩家：这个……如果您见过“天煌龙器”……或许可以和我说一下……","云儿：哼！你怎么这么没情趣，敢情是根刚出道的嫩草吧？","玩家：你要怎样才肯告诉我龙器的下落嘛？","云儿：那得看你的能力可不可以讨老娘的欢心咯？","玩家：这个……","云儿：这个什么？我只不过想让你去<color=yellow>临安处找蔡公公<color>要一瓶美容养颜的天香玉脂膏。","玩家：我还以为……这个简单，<color=yellow>找蔡公公要天香玉脂膏<color>是吧？看我稍后便到。");
		else
			Talk(8,"task_level20_01","云儿：咦？小妹子来找姐姐有何事？","玩家：嗯……听说姐姐知道“天煌龙器”的下落？","云儿：天煌龙器？那听起来好像是很值钱的东西哦……小妹妹你打听这个干什么？","玩家：出来行走江湖就只是想长一下见识而已，所以对很多东西都好奇嘛。","云儿：哦……可最近我也正遇着一件难事呢，不知妹妹可否先帮着我？","玩家：好呀，姐姐有什么事请直说。","云儿：最近天气转寒，脸上着实是难受着呢，听说<color=yellow>临安的蔡公公<color>处有一种天香玉脂膏能抵御风寒，洁肌润肤，不懂妹妹可不可以帮我向蔡公公要一瓶回来？","玩家：这个简单，姐姐等着我哦。");
		end
end

-- 与云儿的对话结束，正式开始邪教主线，弹出任务面版
function task_level20_01()
	nt_setTask(1003,20)
	DelItem(506)
end

-- 与临安的蔡公公对话
function task_level20_02()
	Talk(8,"task_level20_03","玩家：听说蔡公公有一种天香玉脂膏？","蔡公公：哼，有是有，你想怎么的？","玩家：嗯……看来蔡公公今天心情不是很好？","蔡公公：可不是！被那天杀的小太监偷了我的一尊金佛，那可是足金赤佛呀，气死我了！","玩家：哦？在宫中也有这种偷盗之事，那太监应该逃到别处去了吧？","蔡公公：哼，听说那小畜生跑到<color=yellow>伏牛山<color>上去了。","玩家：找人我是拿手好戏，如果我把那金佛再给要回来的话那公公可否给我一瓶天香玉脂膏呀？","蔡公公：只要你能把金佛给我要回来并且把那小畜生给分尸了的话，别说一瓶，就是满满一箱我都给你！");	
end

-- 与汴京的蔡公公对话结束，改变任务变量并弹出任务面版
function task_level20_03()
	nt_setTask(1003,30)
end

-- 杀死小太监后，提示已经拿到金佛（任务变量为 35），改变任务变量并弹出任务面版
function task_level20_04()
	Msg2Player("您得到了一个足金佛像！")
end

-- 得到金佛后，回到汴京与蔡公公的对话
function task_level20_05()
	Talk(3,"task_level20_06","玩家：蔡公公，这是不是你被偷走的那个金佛呀？","蔡公公：嘿，没想到你真的给我拿回来了！","蔡公公：年轻人做的好，给，这就是你要的天香玉脂膏。");
end

-- 与汴京的蔡公公对话结束，得到天香玉脂膏，改变任务变量并弹出任务面版
function task_level20_06()
	nt_setTask(1003,50)
	Msg2Player("您得到了一个天香玉脂膏！")
end



--   ///////////////////////////////
--  //  30 级主线任务的处理过程  //
-- ///////////////////////////////

-- 拿到天香玉脂膏后与云儿的对话
function task_level30_01()
	Talk(8,"task_level30_02","云儿：我大老远的就看到你手上拿的东西了，还真是说有就有呢。","玩家：你也知道做这种事情的辛苦啦，快点告诉我你在哪里见过“镇冥之链”？","云儿：说到这条项链嘛……其实我也只是在几年前听一个光顾过我的男人说过……","玩家：……还是在几年前听说过的。","云儿：是呀，所以先前只让你帮我找一小瓶东西而已嘛，要是我有的话早就要你去拿皇上头上的明珠回来了。","玩家：……那你见过哪一个男人有这条项链呢？","云儿：应该是一位从<color=yellow>扬州来的镖师<color>，其它的我就不记得很清楚了。","玩家：<color=yellow>扬州的镖师<color>？好吧，我去找找看。");
end

-- 与云儿的对话结束，改变任务变量并弹出任务面版，在此发予奖励
function task_level30_02()

local myText1, myText2, myText3 = "", "", ""
local curCamp = nt_getCamp()

	nt_setTask(1003,100)
	
	myText1 = "30000 点经验值"
	myText2 = "一匹 20 级的骏马"
	myText3 = "一双精致的鞋子"
	
	
	if (curCamp==2) then
		AddOwnExp(30000)
		AddItem(0,10,2,1,1,1)  --增加20级马
		AddGoldItem(0,184) --增加一双20跑的鞋子
		ex_add_xp_level20();
		
		Msg2Player("你得到了"..myText1);
		Msg2Player("你得到了"..myText2);
		Msg2Player("你得到了"..myText3);
		
		Say("云儿：看在你那么辛苦替我跑腿的份上，这些东西就赏给你吧：<enter><enter><color=yellow>"..myText1.."<color><enter><color=yellow>"..myText2.."<color><enter><color=yellow>"..myText3.."<color>",0);		
	else
		AddOwnExp(30000)
		
		Msg2Player("你得到了"..myText1);
		
		Say("云儿：看在你那么辛苦替我跑腿的份上，这些东西就赏给你吧：<enter><enter><color=yellow>"..myText1.."<color>",0);
	end
	
end


-- 与扬州镖师的对话
function task_level30_03()
	Talk(3,"task_level30_03_01","玩家：请教一下这位大哥知不知道“镇冥之链”的下落呢？","镖师：年轻人，你从哪里听来的消息？我以前只是听说这里的镖头夏侯复身上带有一条很奇特的项链，但并不知道那是什么“镇冥之链”。","玩家：那现在夏侯复又在哪里呢？");
end

-- 判断玩家是否已经达到了 30 级
function task_level30_03_01()
	if (GetLevel() >= 30) then
		nt_setTask(1003,109)
		task_level30_03_04()
	else
		task_level30_03_02()
	end
end


-- 如果没有达到 30 级时的对话与改变任务变量
function task_level30_03_02()
	nt_setTask(1003,108)
	Talk(2,"","镖师：这两天他有一趟镖，路途遥远，具体什么时候回来我也不清楚。","镖师：看你现在身轻无力的样子，还是把等级练到 <color=yellow>30 级<color>再来找他吧。");
end

-- 当上一次等级未够 30 级被拒绝，这次达到条件时再回来与镖师对话
function task_level30_03_03()
	Talk(2,"task_level30_04","玩家：上问你夏侯复在何处，现在可以回答我了吧？","镖师：这两天他往<color=yellow>青城山<color>一带运镖，路途遥远，具体什么时候回来我也不清楚。");
end

-- 如果玩家等级达到了 30 级
function task_level30_03_04()
	Talk(1,"task_level30_04","镖师：这两天他往<color=yellow>青城山<color>一带运镖，路途遥远，具体什么时候回来我也不清楚。");
end

-- 与扬州镖师对话结束，改变任务变量并弹出任务面版
function task_level30_04()
	nt_setTask(1003,110)
end

-- 与夏侯复战斗并且胜利后，与其对话
function task_level30_05()
	Talk(6,"task_level30_06","玩家：听说“镇冥之链”在你的手上？","夏侯复：哼……原来你想找那件东西……早在十几年前就被那婆娘拿走了！","玩家：什么婆娘？你最好说清楚点！","夏侯复：就是我以前的妻子彩霓……不过天下之大，你想再找到她就难了，哈哈哈……","玩家：彩霓……？","玩家：不知道是谁，还是先去<color=yellow>问问云儿<color>吧，她对这些可能比较熟悉。")
end

-- 与夏侯复的对话结束后，改变任务变量并弹出任务面版
function task_level30_06()
--	nt_setTask(1003,130)
	Msg2Player("你已经杀死了夏侯复，回去找云儿吧！");
end

-- 回到朱仙镇与云儿的对话
function task_level30_07()
	Talk(9,"task_level30_08","云儿：哟，这次急急忙忙的回来找我有什么事呀？","玩家：我这次来是向你打听一个女人的行踪。","云儿：哈，道上混的姐妹哪一个不算在我的五指之间？什么女人你想知道的尽管问来。","玩家：……不是那种女子啦……，是扬州镖师夏侯复以前的妻子，叫彩霓。","云儿：那我可怎么晓得哟！她又没来找过我讨回她的丈夫。","玩家：……","云儿：不过或许你可以去找一下在<color=yellow>龙泉村的傅雷书<color>，那个老头自称是江南万事通，江南一带无事不晓，无人不知。","玩家：真有这样的人？那我去会会他。","云儿：下次来的时候可别像这样空手来哟！");
end

-- 与云儿的对话结束后，改变任务变量并且弹出任务面版
function task_level30_08()
	nt_setTask(1003,140)
end

-- 来到龙泉村与傅雷书的对话
function task_level30_09()
	Talk(17,"task_level30_10","傅雷书：嗯、咳咳、穹隐处兮窟穴自藏……","玩家：老伯伯……","傅雷书：与其随佞而得志兮……","玩家：老丈人……","傅雷书：不若从孤竹于首阳……","玩家：老先生？","傅雷书：哎……对了，年轻人有什么事情？","玩家：……听闻老先生对江南是无事不晓，不知可否向您打听一个人？","傅雷书：哈哈哈，年轻人，你可算问对人了，我既然号称江南万事通那就没有问题我不知道的。","玩家：呵呵呵，那实在是谢谢老先生了。","傅雷书：那就拿钱来吧。","玩家：啊？！","傅雷书：怎么？难道想知道事情不用交钱啊？","玩家：这个……我想知道扬州镖师夏侯复之前的妻子彩霓现在在何处需要交多少钱啊？","傅雷书：找人嘛……想知道的人身份越高，所要交的钱就越多，所以要找夏侯复以前的妻子彩霓的话……","傅雷书：嗯，这个人的来头不简单，那就白银一万两吧。","玩家：什么！？真是……#￥￥%%?%");
end

-- 用以判断玩家身上所持有的金钱是否达到要求
function task_level30_10()

local n

n = Pay(10000)

	if (n == 1) then -- 如果成功的扣除了玩家一万两银子
		nt_setTask(1003,150)
		-- 在此置入改变任务面版的选项，但不弹出界面
		Talk(6,"task_level30_11","傅雷书：一万两刚好，你听好了啊，这个彩霓原来是夏侯复的妻子，但是由于夏侯复喜欢到处拈花惹草又时常毒打彩霓，所以彩霓不堪忍受一气之下离家出走。","傅雷书：彩霓从此以后下决心苦练蛊毒之术、短短十数年之间已经大有所成……","玩家：那她现在呢？","傅雷书：彩霓现在就是<color=yellow>五毒教<color>中五大香主之一的<color=yellow>墨蛛香主<color>！","玩家：原来如此……那再此谢过了。","傅雷书：下次记得多带点银子来啊。");
	else
		Talk(2,"task_level30_12","玩家：那……你看看我的这些钱够吗？","傅雷书：年轻人，我虽老但眼可清着那，先凑够了银子再来吧。");
	end
	
end

-- 成功的扣除了玩家的银子之后，改变任务变量并弹出任务面版
function task_level30_11()
	nt_setTask(1003,150)
end

-- 身上的钱不够，记录变量并弹出任务面版的过程
function task_level30_12()
	nt_setTask(1003,151)
end

-- 之前没有钱，等身上有了足够的银子给傅雷书后的对话
function task_level30_13()
	Talk(10,"task_level30_11","傅雷书：怎么样？凑好银子来问人了吗？","玩家：……你数数看吧。（心痛）","傅雷书：年轻人？你怎么了？为什么流着眼泪呢？","玩家：没事……风沙大……","傅雷书：一万两刚好，你听好了啊，这个彩霓原来是夏侯复的妻子，但是由于夏侯复喜欢到处拈花惹草又时常毒打彩霓，所以彩霓不堪忍受一气之下离家出走。","傅雷书：彩霓从此以后下决心苦练蛊毒之术、短短十数年之间已经大有所成……","玩家：那她现在呢？","傅雷书：彩霓现在就是五毒教中五大香主之一的墨蛛香主！","玩家：原来如此……那再此谢过了。","傅雷书：下次记得多带点银子来啊。");
end

-- 来到五毒教后与桑珠的对话
function task_level30_14()
	Talk(10,"task_level30_14_01","桑珠：你为什么突然闯进来？","玩家：墨香主请恕在下冒昧，我是来打听一条叫“镇冥之链”的项链的下落。","桑珠：“镇冥之链”？我可从来没有听说过这件东西。","玩家：我也是听你的……前夫所说，你在离开他后带走的那条项链。","桑珠：哼！原来如此！我也很想知道它的下落，它就在我失散多年的儿子身上！","玩家：墨香主还有一个儿子？","桑珠：唉……当年我离开那个负心的男人之时已经有孕在身……当孩子不足周岁大的时候在一次战乱中我便与其失散了。这么多年每当想起那时候的事情我就……","玩家：原来是这样……反正我也是时常往返于各地，我或许可以帮你打听得到你儿子的消息。","桑珠：你可以帮我找到儿子的话那可太好不过了！","玩家：那墨香主就等我的消息吧。");
end


function task_level30_14_01()
	Talk(1,"task_level30_15","玩家：（惨，天下之大到哪去找一个失散了十几年的小孩子，还是回去找那守财老头问一下吧。）");
end

-- 与桑珠对话结束后，改变任务变量并弹出任务面版
function task_level30_15()
	nt_setTask(1003,160)
end

-- 回到龙泉村与傅雷书的对话
function task_level30_16()
	Talk(9,"task_level30_17","玩家：老……先生。（老钱棍！）","傅雷书：年轻人，这次又所求呀？","玩家：我想知道桑蛛的儿子现在倒底在哪里？要交多少钱你说吧！","傅雷书：嗯……这个……不收你钱。","玩家：咦？老先生那可太感谢你了！","傅雷书：因为我也不知道。","玩家：我昏……","傅雷书：不过年轻人，我奉劝你一句话：物以极时极必反，正以邪时邪必正。有时侯看上去是无恶不作的人，其最亲的人有可能在<color=yellow>武当等名门正派<color>之中哦。","玩家：名门正派？这可有点玄……好吧，谢谢你老先生。");
end

-- 回到龙泉村与傅雷书的对话结束后，改变任务变量并弹出任务面版，在此发予奖励
function task_level30_17()

local myText1, myText2, myText3 = "", "", ""
local curCamp = nt_getCamp()

	nt_setTask(1003,170)
	
	myText1 = "80000 点经验值"
	myText2 = "一顶精制的帽子"
	
	if (curCamp==2) then
	
		AddOwnExp(80000)	
		AddGoldItem(0,177)
		ex_add_xp_level30();
		
		Msg2Player("你得到了"..myText1);
		Msg2Player("你得到了"..myText2);
		
		Say("傅雷书：年轻人，你这样出外面去闯荡很危险，我给你这些东西或许对你有所帮助。<enter><enter><color=yellow>"..myText1.."<color><enter><color=yellow>"..myText2.."<color>",0);
	else
	
		AddOwnExp(80000)
		Msg2Player("你得到了"..myText1);
		
		Say("傅雷书：年轻人，你这样出外面去闯荡很危险，我给你这些东西或许对你有所帮助。<enter><enter><color=yellow>"..myText1.."<color>",0);
	
	end
	
end


--   ///////////////////////////////
--  //  40 级主线任务的处理过程  //
-- ///////////////////////////////



-- 来到武当派后与姚石门的对话
function task_level40_01()
	Talk(9,"task_level40_01_01","玩家：……（他脖子上戴着的项链怎么这么奇特？）","玩家：这位少侠，你这条项链是从哪儿来的？","姚石门：这条项链？我也不清楚……听师傅说从我被捡来的那时候起就戴在我身上了。","玩家：（真的是他没错！那这条一定就是镇冥之链了！）","玩家：那少侠可有没有想过要去找过你的生母呢？","姚石门：这个我倒从来没有想过，而且师傅说过目前国难当头，我们习武之人理应尽自己的一份力量。","玩家：但是可能你的母亲也在盼着你呢？我想我可以帮你找到你的生身之母哦。","姚石门：真的吗？你见过我的母亲？","玩家：或许有一个人真的是你的母亲……我也说不准，不知你能不能同我一起去探访她？");
end

-- 对话扩展
function task_level40_01_01()
	Talk(3,"task_level40_02","姚石门：可是现在不行啊，我们武当派最近出了一个叛徒，这个败类竟然把描绘江南一带的军事战略图想要带给金国的将领！目前我们中原武林上下都在通缉此人。一日不把他缉拿回来夺回站略图我寝食难安！","玩家：（有那么严重么……这又不是你傻小子一个人的事情。）","玩家：那不如这样吧，我帮你去清除那个武当败类，之后你可以和我去找你的母亲吗？");
end

-- 判断玩家当前等级是否达到了 40 级
function task_level40_02()

	if (GetLevel() >= 40) then
		nt_setTask(1003,209)
		Talk(3,"task_level40_04","姚石门：如果你可以找到那位叛徒实在是武林的大幸！我想作为宋人你也应该尽一份自己的义务是吗？","玩家：嗯，是呀是呀。（只要把你那条项链弄到手什么都好说）","姚石门：那个叛徒名叫<color=yellow>肖无常<color>，听说他目前就躲在<color=yellow>蜀冈山<color>上。",0);
	else
		Talk(1,"task_level40_03","姚石门：可是你好像对武艺还未熟悉，我想你此去定然不敌于他，还是等你的等级过了 <color=yellow>40 级<color>再说吧。",0);
	end
	
end

-- 玩家等级不够 40 级，所以暂存变量
function task_level40_03()
	nt_setTask(1003,208)
end

-- 玩家等级已经达到了 40 级，保存任务变量并且弹出任务面版
function task_level40_04()
	nt_setTask(1003,210)
end

-- 玩家战胜了肖无常后，保存任务变量并且弹出任务面版
function task_level40_05()
--	nt_setTask(1003,220)
	Msg2Player("你拿到了肖无常身上的中原战略部署图！");
-- 任务变量在肖无常身上直接改变，此处仅弹出任务面版
end

-- 玩家战胜了肖无常后回到武当山与姚石门对话
function task_level40_06()
	Talk(10,"task_level40_06_01","姚石门：啊！真的夺回了战略图！你帮助武林清除了这样一个败类实在是可喜可贺！","玩家：呵呵，小事一桩何足挂齿，我们就一起去找你的母亲吧？","姚石门：嗯，你所说可能是我母亲的那个人她目前在哪里呢？","玩家：她现在是五毒教的墨蛛香主桑珠。","姚石门：什么！？","玩家：嗯？怎么了？","姚石门：你竟然让我去见五毒教的人！？我可绝不答应！","玩家：（……也不用变脸变的那么快吧？）","玩家：可是……她有可能是你的母亲呀！看你脖子上的那条项链，就是她在生你的时候给你留下的。","姚石门：哼！自古以来正邪如水火一般势不两立，我宁愿没有这个母亲！");
end

-- 对话的第二行
function task_level40_06_01()
	Talk(2,"task_level40_07","姚石门：这条项链给你！告诉她以后如果见面必定是战场上相见！","玩家：既然如此公子之意如此坚决……那我就不打搅了。（嘿嘿，没想到得来全不费功夫，怎么武当派净出这样的人才？）");
end

-- 玩家拿到了镇冥之链后，保存任务变量，
function task_level40_07()

local myText1, myText2, myText3 = "", "", ""
local curCamp = nt_getCamp()

	nt_setTask(1003,230)
	
	myText1 = "280000 点经验值"
	myText2 = "你所有的技能点现在可以重新分配了！"	
	
	Msg2Player("你得到了镇冥之链！");
	
	if (curCamp==2) then
		AddOwnExp(280000)
		ex_add_xp_level40();
		ClearMagicPoint()  --增加40级时洗点的功能
		Talk(1,"task_level40_08","姚石门：不过这次还是得多谢你帮了我这个忙，这些东西就给你吧。<enter><enter><color=yellow>"..myText1.."<color><enter><color=yellow>"..myText2.."<color>");
	else
		AddOwnExp(280000)
		Talk(1,"task_level40_08","姚石门：不过这次还是得多谢你帮了我这个忙，这些东西就给你吧。<enter><enter><color=yellow>"..myText1.."<color>");
	
	end
	
-- 在这里弹出任务面板

end

-- 告诉玩家下一步应怎样做
function task_level40_08()
	Talk(2,0,"玩家：……","玩家：这条项链似乎有种不可思议的感觉……还是<color=yellow>找那守财老头<color>打听一?抡庑疤旎土鳌钡睦蠢?");
end


--   ///////////////////////////////
--  //  50 级主线任务的处理过程  //
-- ///////////////////////////////

-- 在龙泉村与傅雷书的对话
function task_level50_01()
	Talk(5,"task_level50_01_01","玩家：老先生，你可知道这条项链的来历？","傅雷书：这个……这个不就是“天煌龙器”中的“镇冥之链”吗？","玩家：嘿嘿，算你识货，那这些什么龙器之间倒底有什么秘密呢？","傅雷书：年轻人，你可知道，这“天煌龙器”一共有八件，乃是是秦始皇统一中原后征集七国名匠秘密铸造，铸成之后置于咸阳，后来随着秦始皇之死而神秘失踪，据传如果集齐这八件神器将会引发一个惊人的秘密。","玩家：……一个惊人的秘密？那倒底是什么嘛？");
end


function task_level50_01_01()
	Talk(9,"task_level50_02","傅雷书：这个……或许只有等你真正找全了这八件龙器后才有可能知道了。","玩家：那剩下的龙器你知道什么线索吗？","傅雷书：嘿，如果被我知道了我还能有命活在这里？最近武林中为了这几件东西而丧命的人还真的不在少数……","玩家：难道想找全这所有的龙器真的是可望而不可及？","傅雷书：咳，年轻人你听说过有志者事竟成吗？龙器的消息这个倒是谁都听说过一点……","玩家：嗯，不过要交钱是吧？","傅雷书：呵呵，我都一把年纪了很实在，不是确切的消息我从来不收钱。","傅雷书：据说最近金人的宫廷里发生了不少事情，而引起这些事端的起因极有可能是其中的一件龙器“磐龙瑰”！","玩家：金人的宫廷呀……即是要去<color=yellow>汴京<color>找一下线索了，谢谢你老先生。");
end


-- 与傅雷书对话后，保存任务变量并且弹出任务面版
function task_level50_02()
	nt_setTask(1003,300)
end

-- 在汴京与如玉的对话
function task_level50_03()
	Talk(5,"task_level50_04","如玉：最近这些金人都不知道怎么了，整天调集兵马在城中穿街走巷的，似乎在找什么东西……","玩家：哦？那你可知道他们在找什么吗？","如玉：那些金人的事情我们哪里敢问哟！多管闲事的话轻则入狱半年，重则满门抄家呢！","如玉：如今只有和金人扯上关系才能求得自保，你看像买瓷器的<color=yellow>陈三宝<color>那样经常得以出入金人高官的府第，不知羡慕死多少人呢。","玩家：这样啊……看来这个<color=yellow>陈三宝<color>还能接触不少金人呢。");
end

-- 与如玉对话结束后，保存任务变量并且弹出任务面版
function task_level50_04()
	nt_setTask(1003,310)
end

-- 在汴京与陈三宝对话
function task_level50_05()
	Talk(8,"task_level50_06","陈三宝：唉……","玩家：这位大哥为何在此哀声叹气的？","陈三宝：看来我全家老小的性命就要丧在我一个人手上了……","玩家：什么事情这么严重？！","陈三宝：朝中的徒单大人点名要一尊蓝花瓷瓶进奉给他，谁知道我托人从景德镇运来的途中被一伙贼人给抢走了！","陈三宝：以金人一贯的脾气我这次怕是全家的性命都难保了……","玩家：这样看来你们全家确实危险，没关系，或许我能帮得了你。","陈三宝：真的么……？");
end

-- 判断玩家等级是否达到 50 级，之后再接着做任务
function task_level50_06()
	if (GetLevel() >= 50) then
		nt_setTask(1003,329)
		Talk(3,"task_level50_08","玩家：那当然，你说的瓷器是在什么地方被劫走的？","陈三宝：据说是一个叫<color=yellow>陆非<color=>的盗贼在<color=yellow>雁荡山<color>附近……","玩家：那好，你就等着看我帮你拿回来吧。");
	else
		Talk(1,"task_level50_07","陈三宝：你……真的能帮我么？看你那样子我还不忍心再让你去送死呢。我想你还是练到了 50 级再说吧。");
	end
end

-- 如果玩家等级没有达到 50 级的对话，并保存任务变量
function task_level50_07()
	nt_setTask(1003,328)
end

-- 玩家等级到了 50 级，接下了陈三宝的任务，弹出任务面版
function task_level50_08()
	nt_setTask(1003,330)
end

-- 玩家战胜了陆非后保存任务变量，弹出任务面版
function task_level50_09()
--	nt_setTask(1003,340)
	Msg2Player("你战胜了陆非并拿到了蓝花瓷瓶！");
-- 任务变量在陆非身上直接改变，此处仅弹出任务面版
end

-- 玩家拿到了蓝花瓷瓶后回来与陈三宝的对话
function task_level50_10()
	Talk(8,"task_level50_11","玩家：这就是你订购的那件蓝花瓷器吧？我替你给拿回来了。","陈三宝：啊！真的是徒单大人想要的那件！我真的不敢相信自己的眼睛！","陈三宝：你可是救了我全家人的性命了，要我怎么感谢你好呢？","玩家：呵呵，小事一桩了，我就只想知道最近那个徒单大人在做些什么事情？","陈三宝：徒单大人最近好像得到了一件宝物，但是又神神秘秘的藏起来似乎不想让人知道。","玩家：哦？难道就是“磐龙瑰”？那一般徒单大人会经常去哪里呢？","陈三宝：他最近常去<color=yellow>铁塔<color>那里，或许你会在那能遇见他。","玩家：嗯，明白了。");
end

-- 玩家在与陈三宝对话结束后，改变任务变量并弹出任务面版
function task_level50_11()
	nt_setTask(1003,350)
end

-- 玩家在战胜了徒单大人后，改变任务变量
function task_level50_12()

local curCamp = nt_getCamp()

--	nt_setTask(1003,360)
	Msg2Player("你战胜了徒单大人！");
	-- 玩家在与徒单大人对话结束后，弹出任务面版
	if (curCamp==2) then
		AddOwnExp(350000)
		AddExp_Skill_Extend(350000)
		AddItem(6,1,71,1,1,1)  --增加一个仙草露
		ex_add_xp_level50();
	
		Msg2Player("你得到了 350000 点经验值");
		Msg2Player("你得到了一个仙草露");
	else
		AddOwnExp(350000)
		AddExp_Skill_Extend(350000)
		Msg2Player("你得到了 350000 点经验值");
	end
	
	Talk(8,"","徒单大人：你……你为什么这样对我穷追不舍？","玩家：很简单，我就想要你的“磐龙瑰”。","徒单大人：哼……原来都是为了这个东西。","徒单大人：不过很可惜的是，早在一个月之前就已经完颜宏康给夺走了，呵呵……","玩家：完颜宏康？","徒单大人：哼哼，无可奈何吧？就是号称金国第一高手的金国国师、金主之兄的完颜宏康！有本事你就找他去吧！","玩家：……","玩家：（既然是金主之兄那想必同天忍教人有关系，我应该到<color=yellow>天忍教<color>那里看看了）");
end


--   ///////////////////////////////
--  //  60 级主线任务的处理过程  //
-- ///////////////////////////////

-- 玩家在天忍教大堂与端木睿的对话
function task_level60_01()
	Talk(6,"task_level60_02","端木睿：你找完颜宏康所为何事？","玩家：为了要一件东西。","端木睿：哈哈哈……我是第一次见到像你这般有勇气的。","玩家：为何？","端木睿：胆敢向我们金国国师索要东西的人，无异于虎头拔毛，在这世界上只怕就得你一个。","端木睿：不过我很欣赏你的勇气，你去<color=yellow>龙门镇<color>找我的妹妹<color=yellow>端木清<color>，或许只有她知道完颜宏康在哪。");
end

-- 与端木睿的对话结束，改变任务变量并弹出任务面版
function task_level60_02()
	nt_setTask(1003,400)
end

-- 在龙门镇与端木清的对话
function task_level60_03()
	Talk(10,"task_level60_03_01","玩家：你是天忍教左护法端木睿之妹？","端木清：哼，肯定又是我哥让你来的吧？你回去告诉他，我是绝对不会回去的！","玩家：……","玩家：虽然是你哥让我来的，但他可没让你回去哦。","端木清：那你来这里做什么？","玩家：我只是想知道完颜宏康的下落。","端木清：……你想找宏康做什么？","玩家：因为他手上有我想要的东西。","端木清：哦？那还得看看你有没有这个能力向他要东西呢。","玩家：我要怎样才能见到他？");
end

-- 对话扩展
function task_level60_03_01()
	Talk(4,"task_level60_04","端木清：这个嘛……让我想想，目前宋人的将领廖定还在冥顽不化的与我大金对抗，如果你能取廖定的人头来的话或许我可以考虑让你见宏康一面。","玩家：我为什么一定要听你的？","端木清：嘻嘻，只怕在这世界上除了我之外没第二个人能知道宏康的行踪了。","玩家：……那好吧，告诉我廖定现在在什么地方。");
end

-- 判断玩家等级是否达到 60 级
function task_level60_04()
	if (GetLevel() >= 60) then
		nt_setTask(1003,409)
		Talk(2,"task_level60_05","端木清：这个不知天高地厚的家伙目前正在<color=yellow>灵谷洞<color>一带与我们作对，你去把他的头提回来见我就行。","玩家：……");
	else
		nt_setTask(1003,408)
		Talk(1,"","端木清：嘿，就凭你这两下子想杀廖定？别妄想了，还是把等级提升到 <color=yellow>60 级<color>以后再来吧。");
	end
end

-- 如果玩家等级达到 60 级，保存任务变量并弹出任务面板
function task_level60_05()
	nt_setTask(1003,410)
end


-- 如果玩家战胜了廖定
function task_level60_06()

--	nt_setTask(1003,420)
	Msg2Player("你战胜了廖定！");
	
	AddOwnExp(800000)
	AddExp_Skill_Extend(800000)
	Msg2Player("你得到了 800000 点经验值！");
	
	Talk(10,"","廖定：……","廖定：……我万万没想到我廖定……最终竟然是死在大一个宋子民的手里！","玩家：廖将军，你我本素无冤仇，只是你的人头可以帮我得到我想要的东西。","廖定：哼哼……我倒想知道我廖定之人头值的是一件什么样东西？","玩家：天煌龙器里面的磐龙瑰。","廖定：……","廖定：年轻人……金人的话不可信……","廖定：你所想找的天煌龙器……一旦集全后之后既可以让大宋重夺江山，也可以让金人的铁骑踏破大江南北，百姓生灵涂炭！","廖定：正邪之分皆在一念之差，请你戒之慎之！","玩家：……");
end

-- 玩家战胜了廖定之后回到龙门镇与端木清的对话
function task_level60_07()
	Talk(11,"task_level60_08","（你把廖定的人头掷于地上）","玩家：这就是你要的廖定人头。","端木清：嗯，很好，果然不负我所望，我很欣赏你这点。","玩家：废话少说，完颜宏康现在倒底在哪？","端木清：宏康现在有要事在身，暂时还不能见你。","玩家：你耍我！？","端木清：哈哈……你想本姑娘是言而无信的人吗？其实宏康一早就知道你想要的是什么。","玩家：此话怎讲？","端木清：他看得出来你是会为我们大金卖命的人，所以就嘱咐我把这个东西赏给你。","端木清：记住，以后为我们大金办事是绝对不会亏待你的。呵呵呵呵。","玩家：……");
end

-- 玩家得到磐龙瑰，邪教主线正式结束
function task_level60_08()
	nt_setTask(1003,430)
	ex_add_xp_level60();
	Msg2Player("你得到了天煌龙器之一的磐龙瑰！");
	AddSkillState( 509, 1, 0, 180);
end