-- 少林派帮助NPC
-- By: Dan_Deng(2003-12-01)

function main(sel)
	UTask_sl = GetTask(7)
	player_faction = GetFaction()
	if (player_faction == "shaolin") then		-- 本门弟子
		RestoreLife()		-- 本门免费治疗
		RestoreMana()
		RestoreStamina()
		Say("本寺有千年历史，关于武艺方面的事，可以去找方丈或者各位首座问问，其他问题可以问我.",4,"了解本门典故/faction","了解各位尊长/member","了解任务 /task_get","不问了!/nothing")
	elseif (UTask_sl >= 70*256) then				-- 本门出师
		Say("首先你从木人巷到罗汉阵，快去看看各位师弟吧.",4,"回忆本门以前的事/faction","回忆以前的道友/member","我还能帮什么忙吗？/task_get","不问了!/nothing")
	elseif (player_faction ~= "") then			-- 非本门出师、其它门派（门派不为空即指非新手）
		Say("欢迎来少林 !各位可以自己游玩，有什么问题就问老衲.",3,"了解贵派/faction","了解各位道长/member","不问了!/nothing")
	else													-- 新手
		Say("欢迎来少林，不懂是来拜师还是拜佛呢?",4,"了解贵派/faction","了解各位道长/member","了解入门条件/task_get","不问了!/nothing")
	end
end

----------------- 门派介绍部份 ----------------------------
function faction()
	Say("你想知道少林哪方面?",5,"门派起源/F1","地理位置/F2","江湖地位 /F3","门派特色/F4","不问了!/nothing")
end

function F1()
	Say("少林寺创建于北魏孝文帝太和十九年（公元四九五年）。当时，天竺僧人跋陀由西域来到中原，得到虔信佛学的孝文帝的礼敬。跋陀见嵩山很象一朵莲花，便有意在「花」中立寺，孝文帝遂在少室山建造少林寺供养跋陀。后来又过三十余年，南天竺僧人菩提达摩来到少林寺，广罗弟子，传授禅宗，成为中国佛教禅宗的开山祖师",2,"了解其他问题/main","不问了!/nothing")
end

function F2()
	Say("本寺坐落在河南嵩山，嵩山东边是太岐山，西边是少岐山，每边有16顶'.",2,"了解其他问题/main","不问了!/nothing")
end

function F3()
	Say("本派自古被称为武林第一门派，是武林中原的泰山北斗。少林寺遂以武闻名于世。后来更以“少林七十二绝技”名闻天下",2,"了解其他问题/main","不问了!/nothing")
end

function F4()
	Say("少林派有诵经拜佛与练武并重的传统，门中弟子武功高强，富有正义感。.",2,"了解其他问题/main","不问了!/nothing")
end

----------------- 成员介绍部份 ----------------------------
function member()
	Say("您想了解本寺什么问题？",9,"方丈玄因大师 /M01","达摩院首座玄悲/M02","般若堂首座玄觉/M03","藏经阁首座玄慈 /M04","罗汉堂首座玄难/M05","澄墨/M101","澄节/M102","澄微/M103","不问了!/nothing")
end

function M01()
	Say("方丈玄因大师 位置： 方丈禅房  坐标: 230,184<enter> 洞察秋毫，极具智慧，但为人深藏不露，高深莫测",2,"了解其他问题/main","不问了!/nothing")
end

function M02()
	Say("达摩堂首座玄悲  位置： 达摩堂  坐标: 210,188<enter> 为人铁面无私，执法严明，但有时教条僵化，不知变通",2,"了解其他问题/main","不问了!/nothing")
end

function M03()
	Say("般若堂首座玄觉  位置： 放生湖  坐标: 220,193<enter> 嫉恶如仇，性烈如火，慷慨豪放，有侠客气",2,"了解其他问题/main","不问了!/nothing")
end

function M04()
	Say("藏经阁首座玄慈      位置： 藏经阁       坐标: 218,190<enter> 饱读经书，遇事便引经据典，书呆子一个，为人性情随和，不喜与人争斗，凡事以忍让为先，有时显得过于迂腐",2,"了解其他问题/main","不问了!/nothing")
end

function M05()
	Say("罗汉堂首座玄难  位置： 罗汉堂  坐标: 201,192<enter> 门户观念重，为人心高气傲，好胜心强，与达摩院不和，总想一争高下. ",2,"了解其他问题/main","不问了!/nothing")
end

function M101()
	Say("澄墨  位置： 广场  坐标: 211,196  负责：交易兵器",2,"了解其他问题/main","不问了!/nothing")
end

function M102()
	Say("澄节  位置： 广场  坐标: 209,194  负责：交易装备 ",2,"了解其他问题/main","不问了!/nothing")
end

function M103()
	Say("澄微  位置： 广场  坐标: 208,195  负责：交易药品",2,"了解其他问题/main","不问了!/nothing")
end

----------------- 任务介绍部份 ----------------------------
function task_get()
	UTask_sl = GetTask(7)
	if (UTask_sl < 10*256) then	-- 未入门
		Say("你还未入门，想入门，去新手村见接引弟子",4,"继续了解目前任务/T_enroll","了解其他任务/T_all","了解其他问题/main","不问了!/nothing")
	elseif (UTask_sl >= 10*256) and (UTask_sl < 20*256) then
		Say(" 你目前进行的任务为木人巷",4,"继续了解目前任务/T_L10","了解其他任务/T_all","了解其他问题/main","不问了!/nothing")
	elseif (UTask_sl >= 20*256) and (UTask_sl < 30*256) then
		Say("你目前进行的任务为蛮人 ",4,"继续了解目前任务/T_L20","了解其他任务/T_all","了解其他问题/main","不问了!/nothing")
	elseif (UTask_sl >= 30*256) and (UTask_sl < 40*256) then
		Say("你目前进行的任务为塔林一松",4,"继续了解目前任务/T_L30","了解其他任务/T_all","了解其他问题/main","不问了!/nothing")
	elseif (UTask_sl >= 40*256) and (UTask_sl < 50*256) then
		Say("你目前进行的任务为寂灭二僧",4,"继续了解目前任务/T_L40","了解其他任务/T_all","了解其他问题/main","不问了!/nothing")
	elseif (UTask_sl >= 50*256) and (UTask_sl < 60*256) then
		Say("你目前进行的任务为易骨经",4,"继续了解目前任务/T_L50","了解其他任务/T_all","了解其他问题/main","不问了!/nothing")
	elseif (UTask_sl >= 60*256) and (UTask_sl < 70*256) then
		Say("你目前进行的任务为罗汉阵,",4,"继续了解目前任务/T_L60","了解其他任务/T_all","了解其他问题/main","不问了!/nothing")
	elseif (UTask_sl >= 70*256) and (UTask_sl < 80*256) then
		Say("你目前进行的任务为重返师门",4,"继续了解目前任务/T_return","了解其他任务/T_all","了解其他问题/main","不问了!/nothing")
	else
		Say("你可以自由出入门派，暂时没有心任务",3,"了解其他任务/T_all","了解其他问题/main","不问了!/nothing")
	end
end

function T_all()
	Say("想了解任务g?",10,"入门任务/T_enroll","任务木人巷/T_L10","任务蛮人/T_L20","任务塔林一松/T_L30","任务寂灭二僧/T_L40","任务易骨经/T_L50","任务罗汉阵/T_L60","任务重返师门/T_return","了解其他问题/main","不问了!/nothing")
end

function T_enroll()
	Talk(1,"t_all","想入门学艺，只要属金系，达到10级。去和接引弟子对话就行。入门后，依次完成门派任务，将学到武功，被封称号。完成出师任务后，就能出师。")
end

function T_L10()
	Talk(4,"t_all","入门并达到10级后, 可以接任务木人巷. 完成此任务, 你将升为护院武僧, 学到武功少林拳法，少林棍法，少林刀法.","第1步: 到禅房见方丈, 接任务木人巷, 去拿金莲花.","第2步: 进入木人巷, 打败木人, 将有30%机会拿到金莲花.","第3步: 返回禅房交金莲花给玄因方丈, 完成任务")
end

function T_L20()
	Talk(4,"t_all","完成任务木人巷及达到等级20, 你可以接任务蛮人. 完成此任务, 你将升为护持金刚, 学到武功不动明王","第1步: 到达摩堂见玄悲, 接任务，去伏牛西山教训5个蛮人.","第2步: 到伏牛西山，依次打败5个蛮人.","第3步: 返回达摩堂,见玄悲复命, 完成任务")
end

function T_L30()
	Talk(5,"t_all","完成任务蛮人及达到等级30, 你可以接任务塔林一松. 完成此任务, 你将升为护法罗汉, 学到武功罗汉阵","第1步: 到放生湖见玄觉, 接任务，到塔林打败行踪诡秘的人.","第2步: 到塔林, 打败他们，发现他们是金国间谍，他们的同党盗走了般若波罗蜜多心经，跑进了金光洞.","第3步: 到金光洞, 打败金国间谍，夺回般若波罗蜜多心经h'.","第4步: 返回放生湖,交般若波罗蜜多心经给玄觉, 完成任务")
end

function T_L40()
	Talk(6,"t_all","完成任务塔林一松 及达到等级40, 你可以接任务寂灭二僧. 完成此任务, 你将升为传经罗汉, 学到武功狮子吼","第1步: 到方丈禅房见玄因方丈, 接任务，找寂灭二僧请教天下事 ","第2步: 到后山密室回答正确问题进入密室.","第3步: 打败密室中的铜人，可以打开门，知道口诀和二僧说话.","第4步: 到密室最后的门前，正确读口诀，请教天下事.","第5步: 返回方丈禅房, 传达二僧说的话给方丈听, 完成任务。 如果忘记, 可以来请教我.")
end

function T_L50()
	Talk(6,"t_all","完成任务寂灭二僧 及达到等级50, 你可以接任务易骨经. 完成此任务, 你将升为伏魔天王, 学到武功莫哈无量，龙爪虎爪","第1步: 到藏经阁见玄慈 接任务，找澄远拼命拿到'易骨经' 在藏经阁.","第2步: 到到练功区和小和尚澄心对话，知道可以用一只烤鸡让澄心说出澄远的秘密.","第3步: 到汴京酒楼买烤鸡，然后回去找澄心知道秘密.","第4步: 根据澄心所说，去找树林中大石头下面，拿到'易骨经'.","第5步: 返回藏经阁,交'易骨经'给玄慈 完成任务")
end

function T_L60()
	Talk(4,"t_all","完成任务易骨经 及达到等级50, 你可以接任务罗汉阵. 完成此任务, 你将升为无量世尊，顺利出师","第1步: 到罗汉堂见玄难, 接任务 ，进入罗汉阵拿4件信物: 念珠、禅杖、木鱼、钵盂","第2步: 进入罗汉阵, 打败怪物，拿到四件信物.","第3步: 返回罗汉堂,交信物给玄难, 完成任务")
end

function T_return()
	Talk(3,"t_all","完成任务重返师门, 你将升为护法长老, 学到武功易筋经, 如来天业","第1步: 达到60级后，去方丈禅房见玄因方丈,申请重返少林.","第2步:交50000两，重返少林.")
end

----------------- 结束 ---------------------------
function nothing()
end
