--西南北区 成都府 路人22孙婉的对话
--author: yuanlan	
--date: 2003/3/10
-- Update: Dan_Deng(2003-08-13)

function main(sel)
	UTask_tm = GetTask(2);
	if (UTask_tm == 10*256+20) or (UTask_tm == 10*256+30) then						--唐门十级任务过程中
Talk(5, "", "孙婉：真是气死我了！黑心烂肝的龟儿子！", "玩家：这位姑娘，发生了什么事？", "孙婉：刚才在街上，有人拿着一包东西，说是天衣无缝针，那天衣无缝针十分稀罕，我当然想要了，结果就花了十两银子买下来。哪知道回来打开一看，里面包的竟是一把黑漆漆的细针，根本没法绣花！你说气不气人！", "玩家：（正是我要找的魔雨针！幸好偷针的人不识货）孙姑娘，反正这针你也用不上，不如给我吧！", "孙婉：这针可是我花了十两银子买来的，怎能随便给你？如果你真的想要，就拿一只玛瑙戒指来换吧。")
		SetTask(2, 10*256+40)
		Msg2Note("孙婉要求你用玛瑙戒指换取魔雨针")
		AddNote("找到孙婉(394, 323) , 知道魔雨针的踪迹，但是需要用玛瑙戒指换取. ")
	elseif ((UTask_tm == 10*256+40) and ( HaveItem(165) == 1)) then				--有玛瑙戒指
		Talk(1,"","啊，玛瑙戒指真是漂亮，这包绣花针你拿去.")
		DelItem(165)
		AddEventItem(36)
		Msg2Player("得到魔雨针。")
		SetTask(2, 10*256+80)
		AddNote("把玛瑙戒指送给孙婉，将会得到魔雨针")
	elseif ((UTask_tm == 10*256+80) and (HaveItem(36) == 0)) then		-- 道具丢了
		AddEventItem(36)
		Talk(1,"","那个人，你掉落了一包针，叫你也不关心，还给你，这次不要弄丢了!")
	else
		Talk(1,"","孙婉：绣女的命好苦，年年给他人做嫁衣，可是自己的青春却没有着落……")
	end
end;
