--description: 唐门20级任务 怪石阵石屋门前小石碑
--author: yuanlan	
--date: 2003/3/11
-- Update: Dan_Deng(2003-08-13)

function main()
	UTask_tm = GetTask(2);
	if (UTask_tm == 20*256+20) then		-- 20级任务，第一步：打四个字
		if (HaveItem(37) == 1) and (HaveItem(38) == 1) and (HaveItem(39) == 1) and (HaveItem(40) == 1) then
			Talk(9, "", "你既然找到了'擅闯者死'四个字，为什么还敢停留？难道天下有不怕死的人吗?", "天下没有不怕死的人，但是亲人生而不能相见，岂不是比死更难过?","你到底是什么人" ,"晚辈是唐门弟子，专程来请师姑回唐门，与掌门兄妹团聚! ", "我没有什么兄长！我的亲人都死光了！当年我被赶出家门的时候，可没有一个兄长为我说过好话！那时我就发誓，今生绝不再踏进唐门半步! ", "如果师姑真的对唐门没有半点留恋的话，又为什么要在这竹海后山隐居呢?", "唐幽:.....", "师姑，这么多年来，掌门一直十分懊悔当年没有阻止师祖将您赶出家门，您为什么不给他一次补偿的机会呢？何况兄妹乃是骨肉至亲，何必因为一时意气，而弄得抱憾终生呢?", "你不必再罗嗦！好，我就给他一次机会，免得说我冷酷无情。当年我离开家门时，一气之下将出生时爹送给我的金项圈扔进了翡翠湖，你如果能给我找回金项圈，我就和你回去 ")
   		DelItem(37)	
			DelItem(38)
			DelItem(39)
			DelItem(40)
			SetTask(2, 20*256+40)
			AddNote("在唐幽房前的石碑上，接任务，去翡翠湖找金项圈")
		else
			Talk(1,"","你没有口诀，不能通过石碑与唐幽说话.")
			AddNote("在无心谷石碑前知道要先找谷内石碑口诀. ")
		end
	elseif (UTask_tm == 20*256+40) then
		if (HaveItem(41) == 1) then
			Talk(2, "", "师姑，弟子已经在翡翠湖找到了金项圈，师姑愿意跟弟子回去了吗?", "你把金项圈交给我大哥，他见到项圈就知道我已经原谅他了.")
	  		SetTask(2, 20*256+60)
	  		Msg2Player("唐幽让你把金项圈交给掌门唐仇. ")
  			AddNote("唐幽让你把金项圈交给掌门唐仇. ")
		else								--没有得到或者丢失，金项圈可以反复打
			Talk(1,"","如果你能去翡翠湖替我找回金项圈，我就原谅你")
		end
	elseif ((UTask_tm == 20*256+60) and (HaveItem(41) == 0)) then		-- 道具丢了
		AddEventItem(41)
		Talk(1,"","你怎么那么多事，还有你，快给我消失!")
	elseif (UTask_tm >= 30*256) then
		Say("我一个人清静惯了，不喜被人打扰，往事已了，多说无益，你回去吧!", 0)
	else
		Talk(1,"","石碑上写着：擅入者，杀无赦。杀字已一种特别的血色写成. ")
	end
end;
