-- ====================== ÎÄ¼şĞÅÏ¢ ======================

-- ½£ÏÀÇéÔµÍøÂç°æÔ½ÄÏ°æ - ĞÂ°æÆì
-- ÎÄ¼şÃû¡¡£ºxinban_qi.lua
-- ´´½¨Õß¡¡£º×Ó·Çô~
-- ´´½¨Ê±¼ä£º2009-05-21 16:15:54

-- ======================================================

Include("\\script\\event\\birthday_jieri\\200905\\class.lua");
Include("\\script\\lib\\awardtemplet.lua")

local tbAward = 
{
	[1] = {szName = "¼ÌÒµ½ğÅÆ", tbProp = {6, 1, 2075, 1, 0, 0}, nRate = 1.000000},
	[2] = {szName = "ÃÎÁú½ğÅÆ", tbProp = {6, 1, 2076, 1, 0, 0}, nRate = 1.000000},
	[3] = {szName = "Ú¤»Ã½ğÅÆ", tbProp = {6, 1, 2077, 1, 0, 0}, nRate = 1.000000},
	[4] = {szName = "µØÆÇ½ğÅÆ", tbProp = {6, 1, 2078, 1, 0, 0}, nRate = 1.000000},
	[5] = {szName = "ÎŞ³¾½ğÅÆ", tbProp = {6, 1, 2079, 1, 0, 0}, nRate = 1.000000},
	[6] = {szName = "±Ìº£½ğÅÆ", tbProp = {6, 1, 2080, 1, 0, 0}, nRate = 1.000000},
	[7] = {szName = "Îí»Ã½ğÅÆ", tbProp = {6, 1, 2081, 1, 0, 0}, nRate = 1.000000},
	[8] = {szName = "Ä§ÊÈ½ğÅÆ", tbProp = {6, 1, 2082, 1, 0, 0}, nRate = 1.000000},
	[9] = {szName = "ÌôÕ½Àñ°ü", tbProp = {6, 1, 2006, 1, 0, 0}, nRate = 20.000000},
	[10] = {szName = "ÏÉ²İÂ¶", tbProp = {6, 1, 71, 1, 0, 0}, nRate = 11.966000},
	[11] = {szName = "ÌØĞ§ÏÉ²İÂ¶", tbProp = {6, 1, 1181, 1, 0, 0}, nRate = 5.000000},
	[12] = {szName = "½ğÏ¬", tbProp = {4, 979, 1, 1, 0, 0}, nRate = 1.000000},
	[13] = {szName = "Ç§ÄêºÎÊ×ÎÚ", tbProp = {6, 1, 2074, 1, 0, 0}, nRate = 1.000000},
	[14] = {szName = "½ğ¹â±±¾©Ö®ÃÎ", nQuality = 1, tbProp = {0, 197}, nRate = 0.001000},
	[15] = {szName = "½ğ¹âÑÅµäÖ®»ê", nQuality = 1, tbProp = {0, 202}, nRate = 0.001000},
	[16] = {szName = "ÌìÉ½Ñ©Á«", tbProp = {6, 1, 1431, 1, 0, 0}, nRate = 0.030000},
	[17] = {szName = "ĞşÕæµ¤", tbProp = {6, 1, 1678, 1, 0, 0}, nRate = 0.010000, tbParam = {1500000000}},
	[18] = {szName = "ÑªÕæµ¤", tbProp = {6, 1, 1677, 1, 0, 0}, nRate = 0.020000, tbParam = {1000000000}},
	[19] = {szName = "°×Õæµ¤", tbProp = {6, 1, 1676, 1, 0, 0}, nRate = 0.200000, tbParam = {500000000}},
	[20] = {szName = "ÉñÃØ¿óÊ¯", tbProp = {6, 1, 398, 1, 0, 0}, nRate = 1.000000},
	[21] = {szName = "×ÏË®¾§", tbProp = {4, 239, 1, 1, 0, 0}, nRate = 7.000000},
	[22] = {szName = "À¶Ë®¾§", tbProp = {4, 238, 1, 1, 0, 0}, nRate = 7.000000},
	[23] = {szName = "ÂÌË®¾§", tbProp = {4, 240, 1, 1, 0, 0}, nRate = 7.000000},
	[24] = {szName = "¾§ºì±¦Ê¯", tbProp = {4, 353, 1, 1, 0, 0}, nRate = 4.000000},
	[25] = {szName = "ÌúÂŞºº", tbProp = {6, 1, 23, 1, 0, 0}, nRate = 10.000000},
	[26] = {szName = "ÅÌÈôĞÄ¾­", tbProp = {6, 1, 12, 1, 0, 0}, nRate = 2.000000},
	[27] = {szName = "6¼¶Ğş¾§¿óÊ¯", tbProp = {6, 1, 147, 6, 0, 0}, nRate = 5.000000},
	[28] = {szName = "7¼¶Ğş¾§¿óÊ¯", tbProp = {6, 1, 147, 7, 0, 0}, nRate = 4.000000},
	[29] = {szName = "8¼¶Ğş¾§¿óÊ¯", tbProp = {6, 1, 147, 8, 0, 0}, nRate = 1.000000},
	[30] = {szName = "Áú·ïÎ°", 	tbProp = {6, 1, 2060, 8, 0, 0}, nRate = 0.5, nExpiredTime = tbBirthday0905.tbTask.item_expiredtime2},
	[31] = {szName = "¼ÌÒµÖ®°×»¢ÎŞË«¿ÛËéÆ¬(1/6)", tbProp = {4, 1146, 1, 1, 0, 0}, nRate = 0.005000},
	[32] = {szName = "¼ÌÒµÖ®°×»¢ÎŞË«¿ÛËéÆ¬(2/6)", tbProp = {4, 1147, 1, 1, 0, 0}, nRate = 0.005000},
	[33] = {szName = "¼ÌÒµÖ®°×»¢ÎŞË«¿ÛËéÆ¬(3/6)", tbProp = {4, 1148, 1, 1, 0, 0}, nRate = 0.005000},
	[34] = {szName = "¼ÌÒµÖ®°×»¢ÎŞË«¿ÛËéÆ¬(4/6)", tbProp = {4, 1149, 1, 1, 0, 0}, nRate = 0.005000},
	[35] = {szName = "¼ÌÒµÖ®°×»¢ÎŞË«¿ÛËéÆ¬(5/6)", tbProp = {4, 1150, 1, 1, 0, 0}, nRate = 0.005000},
	[36] = {szName = "¼ÌÒµÖ®°×»¢ÎŞË«¿ÛËéÆ¬(6/6)", tbProp = {4, 1151, 1, 1, 0, 0}, nRate = 0.005000},
	[37] = {szName = "Ú¤»ÃÖ®¸¯¹Ç»¤ÍóËéÆ¬(1/6)", tbProp = {4, 1194, 1, 1, 0, 0}, nRate = 0.004000},
	[38] = {szName = "Ú¤»ÃÖ®¸¯¹Ç»¤ÍóËéÆ¬ (2/6)", tbProp = {4, 1195, 1, 1, 0, 0}, nRate = 0.004000},
	[39] = {szName = "Ú¤»ÃÖ®¸¯¹Ç»¤ÍóËéÆ¬ (3/6)", tbProp = {4, 1196, 1, 1, 0, 0}, nRate = 0.004000},
	[40] = {szName = "Ú¤»ÃÖ®¸¯¹Ç»¤ÍóËéÆ¬ (4/6)", tbProp = {4, 1197, 1, 1, 0, 0}, nRate = 0.004000},
	[41] = {szName = "Ú¤»ÃÖ®¸¯¹Ç»¤ÍóËéÆ¬ (5/6)", tbProp = {4, 1198, 1, 1, 0, 0}, nRate = 0.004000},
	[42] = {szName = "Ú¤»ÃÖ®¸¯¹Ç»¤ÍóËéÆ¬(6/6)", tbProp = {4, 1199, 1, 1, 0, 0}, nRate = 0.004000},
	[43] = {szName = "µĞâéÖ®¹·¼¹Æ¤»¤ÍóËéÆ¬ (1/6)", tbProp = {4, 1091, 1, 1, 0, 0}, nRate = 0.010000},
	[44] = {szName = "µĞâéÖ®¹·¼¹Æ¤»¤ÍóËéÆ¬ (2/6)", tbProp = {4, 1092, 1, 1, 0, 0}, nRate = 0.010000},
	[45] = {szName = "µĞâéÖ®¹·¼¹Æ¤»¤ÍóËéÆ¬ (3/6)", tbProp = {4, 1093, 1, 1, 0, 0}, nRate = 0.010000},
	[46] = {szName = "µĞâéÖ®¹·¼¹Æ¤»¤ÍóËéÆ¬(4/6)", tbProp = {4, 1094, 1, 1, 0, 0}, nRate = 0.010000},
	[47] = {szName = "µĞâéÖ®¹·¼¹Æ¤»¤ÍóËéÆ¬ (5/6)", tbProp = {4, 1095, 1, 1, 0, 0}, nRate = 0.010000},
	[48] = {szName = "µĞâéÖ®¹·¼¹Æ¤»¤ÍóËéÆ¬ (6/6)", tbProp = {4, 1096, 1, 1, 0, 0}, nRate = 0.010000},
	[49] = {szName = "ËÄ¿ÕÖ®»¤·¨Ñü´øËéÆ¬ (1/6)", tbProp = {4, 1134, 1, 1, 0, 0}, nRate = 0.004000},
	[50] = {szName = "ËÄ¿ÕÖ®»¤·¨Ñü´øËéÆ¬(2/6)", tbProp = {4, 1135, 1, 1, 0, 0}, nRate = 0.004000},
	[51] = {szName = "ËÄ¿ÕÖ®»¤·¨Ñü´øËéÆ¬(3/6)", tbProp = {4, 1136, 1, 1, 0, 0}, nRate = 0.004000},
	[52] = {szName = "ËÄ¿ÕÖ®»¤·¨Ñü´øËéÆ¬(4/6)", tbProp = {4, 1137, 1, 1, 0, 0}, nRate = 0.004000},
	[53] = {szName = "ËÄ¿ÕÖ®»¤·¨Ñü´øËéÆ¬ (5/6)", tbProp = {4, 1138, 1, 1, 0, 0}, nRate = 0.004000},
	[54] = {szName = "ËÄ¿ÕÖ®»¤·¨Ñü´øËéÆ¬ (6/6)", tbProp = {4, 1139, 1, 1, 0, 0}, nRate = 0.004000},
	[55] = {szName = "ÎŞ¼äÖ®·÷ÔÆË¿´øËéÆ¬ (1/6)", tbProp = {4, 1158, 1, 1, 0, 0}, nRate = 0.008000},
	[56] = {szName = "ÎŞ¼äÖ®·÷ÔÆË¿´øËéÆ¬ (2/6)", tbProp = {4, 1159, 1, 1, 0, 0}, nRate = 0.008000},
	[57] = {szName = "ÎŞ¼äÖ®·÷ÔÆË¿´øËéÆ¬ (3/6)", tbProp = {4, 1160, 1, 1, 0, 0}, nRate = 0.008000},
	[58] = {szName = "ÎŞ¼äÖ®·÷ÔÆË¿´øËéÆ¬ (4/6)", tbProp = {4, 1161, 1, 1, 0, 0}, nRate = 0.008000},
	[59] = {szName = "ÎŞ¼äÖ®·÷ÔÆË¿´øËéÆ¬ (5/6)", tbProp = {4, 1162, 1, 1, 0, 0}, nRate = 0.008000},
	[60] = {szName = "ÎŞ¼äÖ®·÷ÔÆË¿´øËéÆ¬ (6/6)", tbProp = {4, 1163, 1, 1, 0, 0}, nRate = 0.008000},
	[61] = {szName = "±ùº®Ö®ĞÄ¼ıÑü¿ÛËéÆ¬(1/6)", tbProp = {4, 1206, 1, 1, 0, 0}, nRate = 0.004000},
	[62] = {szName = "±ùº®Ö®ĞÄ¼ıÑü¿ÛËéÆ¬ (2/6)", tbProp = {4, 1207, 1, 1, 0, 0}, nRate = 0.004000},
	[63] = {szName = "±ùº®Ö®ĞÄ¼ıÑü¿ÛËéÆ¬ (3/6)", tbProp = {4, 1208, 1, 1, 0, 0}, nRate = 0.004000},
	[64] = {szName = "±ùº®Ö®ĞÄ¼ıÑü¿ÛËéÆ¬ (4/6)", tbProp = {4, 1209, 1, 1, 0, 0}, nRate = 0.004000},
	[65] = {szName = "±ùº®Ö®ĞÄ¼ıÑü¿ÛËéÆ¬ (5/6)", tbProp = {4, 1210, 1, 1, 0, 0}, nRate = 0.004000},
	[66] = {szName = "±ùº®Ö®ĞÄ¼ıÑü¿ÛËéÆ¬ (6/6)", tbProp = {4, 1211, 1, 1, 0, 0}, nRate = 0.004000},
	[67] = {szName = "ÁèÔÀÖ®Å­À×·¨½äËéÆ¬ (1/6)", tbProp = {4, 1260, 1, 1, 0, 0}, nRate = 0.030000},
	[68] = {szName = "ÁèÔÀÖ®Å­À×·¨½äËéÆ¬ (2/6)", tbProp = {4, 1261, 1, 1, 0, 0}, nRate = 0.030000},
	[69] = {szName = "ÁèÔÀÖ®Å­À×·¨½äËéÆ¬ (3/6)", tbProp = {4, 1262, 1, 1, 0, 0}, nRate = 0.030000},
	[70] = {szName = "ÁèÔÀÖ®Å­À×·¨½äËéÆ¬ (4/6)", tbProp = {4, 1263, 1, 1, 0, 0}, nRate = 0.030000},
	[71] = {szName = "ÁèÔÀÖ®Å­À×·¨½äËéÆ¬ (5/6)", tbProp = {4, 1264, 1, 1, 0, 0}, nRate = 0.030000},
	[72] = {szName = "ÁèÔÀÖ®Å­À×·¨½äËéÆ¬ (6/6)", tbProp = {4, 1265, 1, 1, 0, 0}, nRate = 0.030000},
	[73] = {szName = "ÆÜ»ËÖ®·çÑ©°×ÔÆÊø´øËéÆ¬ (1/6)", tbProp = {4, 1176, 1, 1, 0, 0}, nRate = 0.003000},
	[74] = {szName = "ÆÜ»ËÖ®·çÑ©°×ÔÆÊø´øËéÆ¬ (2/6)", tbProp = {4, 1177, 1, 1, 0, 0}, nRate = 0.003000},
	[75] = {szName = "ÆÜ»ËÖ®·çÑ©°×ÔÆÊø´øËéÆ¬(3/6)", tbProp = {4, 1178, 1, 1, 0, 0}, nRate = 0.003000},
	[76] = {szName = "ÆÜ»ËÖ®·çÑ©°×ÔÆÊø´øËéÆ¬(4/6)", tbProp = {4, 1179, 1, 1, 0, 0}, nRate = 0.003000},
	[77] = {szName = "ÆÜ»ËÖ®·çÑ©°×ÔÆÊø´øËéÆ¬ (5/6)", tbProp = {4, 1180, 1, 1, 0, 0}, nRate = 0.003000},
	[78] = {szName = "ÆÜ»ËÖ®·çÑ©°×ÔÆÊø´øËéÆ¬ (6/6)", tbProp = {4, 1181, 1, 1, 0, 0}, nRate = 0.003000},
	[79] = {szName = "Ëª¾§Ö®Çå·çÂÆ´øËéÆ¬ (1/6)", tbProp = {4, 1272, 1, 1, 0, 0}, nRate = 0.007000},
	[80] = {szName = "Ëª¾§Ö®Çå·çÂÆ´øËéÆ¬ (2/6)", tbProp = {4, 1273, 1, 1, 0, 0}, nRate = 0.007000},
	[81] = {szName = "Ëª¾§Ö®Çå·çÂÆ´øËéÆ¬ (3/6)", tbProp = {4, 1274, 1, 1, 0, 0}, nRate = 0.007000},
	[82] = {szName = "Ëª¾§Ö®Çå·çÂÆ´øËéÆ¬(4/6)", tbProp = {4, 1275, 1, 1, 0, 0}, nRate = 0.007000},
	[83] = {szName = "Ëª¾§Ö®Çå·çÂÆ´øËéÆ¬(5/6)", tbProp = {4, 1276, 1, 1, 0, 0}, nRate = 0.007000},
	[84] = {szName = "Ëª¾§Ö®Çå·çÂÆ´øËéÆ¬(6/6)", tbProp = {4, 1277, 1, 1, 0, 0}, nRate = 0.007000},
	[85] = {szName = "Ä§É·Ö®²ĞÑôÓ³Ñª¼×ËéÆ¬(1/6)", tbProp = {4, 1097, 1, 1, 0, 0}, nRate = 0.004000},
	[86] = {szName = "Ä§É·Ö®²ĞÑôÓ³Ñª¼×ËéÆ¬ (2/6)", tbProp = {4, 1098, 1, 1, 0, 0}, nRate = 0.004000},
	[87] = {szName = "Ä§É·Ö®²ĞÑôÓ³Ñª¼×ËéÆ¬ (3/6)", tbProp = {4, 1099, 1, 1, 0, 0}, nRate = 0.004000},
	[88] = {szName = "Ä§É·Ö®²ĞÑôÓ³Ñª¼×ËéÆ¬(4/6)", tbProp = {4, 1100, 1, 1, 0, 0}, nRate = 0.004000},
	[89] = {szName = "Ä§É·Ö®²ĞÑôÓ³Ñª¼×ËéÆ¬ (5/6)", tbProp = {4, 1101, 1, 1, 0, 0}, nRate = 0.004000},
	[90] = {szName = "Ä§É·Ö®²ĞÑôÓ³Ñª¼×ËéÆ¬ (6/6)", tbProp = {4, 1102, 1, 1, 0, 0}, nRate = 0.004000},
	[91] = {szName = "ËÄ¿ÕÖ®½µÄ§½äµ¶ËéÆ¬(1/9) /9)", tbProp = {4, 585, 1, 1, 0, 0}, nRate = 0.030000},
	[92] = {szName = "ËÄ¿ÕÖ®½µÄ§½äµ¶ËéÆ¬ (2/9) /9)", tbProp = {4, 586, 1, 1, 0, 0}, nRate = 0.030000},
	[93] = {szName = "ËÄ¿ÕÖ®½µÄ§½äµ¶ËéÆ¬ (3/9) /9)", tbProp = {4, 587, 1, 1, 0, 0}, nRate = 0.030000},
	[94] = {szName = "ËÄ¿ÕÖ®½µÄ§½äµ¶ËéÆ¬ (4/9) /9)", tbProp = {4, 588, 1, 1, 0, 0}, nRate = 0.030000},
	[95] = {szName = "ËÄ¿ÕÖ®½µÄ§½äµ¶ËéÆ¬ (5/9) /9)", tbProp = {4, 589, 1, 1, 0, 0}, nRate = 0.030000},
	[96] = {szName = "ËÄ¿ÕÖ®½µÄ§½äµ¶ËéÆ¬ (6/9) /9)", tbProp = {4, 590, 1, 1, 0, 0}, nRate = 0.030000},
	[97] = {szName = "ËÄ¿ÕÖ®½µÄ§½äµ¶ËéÆ¬ (7/9) /9)", tbProp = {4, 591, 1, 1, 0, 0}, nRate = 0.030000},
	[98] = {szName = "ËÄ¿ÕÖ®½µÄ§½äµ¶ËéÆ¬ (8/9) /9)", tbProp = {4, 592, 1, 1, 0, 0}, nRate = 0.030000},
	[99] = {szName = "ËÄ¿ÕÖ®½µÄ§½äµ¶ËéÆ¬ (9/9) /9)", tbProp = {4, 593, 1, 1, 0, 0}, nRate = 0.030000},
	[100] = {szName = "·üÄ§Ö®×Ï½ğ¹÷ËéÆ¬(1/9) /9)", tbProp = {4, 576, 1, 1, 0, 0}, nRate = 0.020000},
	[101] = {szName = "·üÄ§Ö®×Ï½ğ¹÷ËéÆ¬ (2/9) /9)", tbProp = {4, 577, 1, 1, 0, 0}, nRate = 0.020000},
	[102] = {szName = "·üÄ§Ö®×Ï½ğ¹÷ËéÆ¬ (3/9) /9)", tbProp = {4, 578, 1, 1, 0, 0}, nRate = 0.020000},
	[103] = {szName = "·üÄ§Ö®×Ï½ğ¹÷ËéÆ¬ (4/9) /9)", tbProp = {4, 579, 1, 1, 0, 0}, nRate = 0.020000},
	[104] = {szName = "·üÄ§Ö®×Ï½ğ¹÷ËéÆ¬(5/9) /9)", tbProp = {4, 580, 1, 1, 0, 0}, nRate = 0.020000},
	[105] = {szName = "·üÄ§Ö®×Ï½ğ¹÷ËéÆ¬(6/9) /9)", tbProp = {4, 581, 1, 1, 0, 0}, nRate = 0.020000},
	[106] = {szName = "·üÄ§Ö®×Ï½ğ¹÷ËéÆ¬ (7/9) /9)", tbProp = {4, 582, 1, 1, 0, 0}, nRate = 0.020000},
	[107] = {szName = "·üÄ§Ö®×Ï½ğ¹÷ËéÆ¬ (8/9) /9)", tbProp = {4, 583, 1, 1, 0, 0}, nRate = 0.020000},
	[108] = {szName = "·üÄ§Ö®×Ï½ğ¹÷ËéÆ¬ (9/9) /9)", tbProp = {4, 584, 1, 1, 0, 0}, nRate = 0.020000},
	[109] = {szName = "º³ÌìÖ®³ËÁúÕ½Ñ¥ËéÆ¬ (1/6)", tbProp = {4, 1031, 1, 1, 0, 0}, nRate = 0.040000},
	[110] = {szName = "º³ÌìÖ®³ËÁúÕ½Ñ¥ËéÆ¬ (2/6)", tbProp = {4, 1032, 1, 1, 0, 0}, nRate = 0.040000},
	[111] = {szName = "º³ÌìÖ®³ËÁúÕ½Ñ¥ËéÆ¬(3/6)", tbProp = {4, 1033, 1, 1, 0, 0}, nRate = 0.040000},
	[112] = {szName = "º³ÌìÖ®³ËÁúÕ½Ñ¥ËéÆ¬(4/6)", tbProp = {4, 1034, 1, 1, 0, 0}, nRate = 0.040000},
	[113] = {szName = "º³ÌìÖ®³ËÁúÕ½Ñ¥ËéÆ¬(5/6)", tbProp = {4, 1035, 1, 1, 0, 0}, nRate = 0.040000},
	[114] = {szName = "º³ÌìÖ®³ËÁúÕ½Ñ¥ËéÆ¬ (6/6)", tbProp = {4, 1036, 1, 1, 0, 0}, nRate = 0.040000},
	[115] = {szName = "Ú¤»ÃÖ®Ğ°É²¶¾ÈĞËéÆ¬ (1/9) /9)", tbProp = {4, 648, 1, 1, 0, 0}, nRate = 0.020000},
	[116] = {szName = "Ú¤»ÃÖ®Ğ°É²¶¾ÈĞËéÆ¬  (2/9) /9)", tbProp = {4, 649, 1, 1, 0, 0}, nRate = 0.020000},
	[117] = {szName = "Ú¤»ÃÖ®Ğ°É²¶¾ÈĞËéÆ¬  (3/9) /9)", tbProp = {4, 650, 1, 1, 0, 0}, nRate = 0.020000},
	[118] = {szName = "Ú¤»ÃÖ®Ğ°É²¶¾ÈĞËéÆ¬  (4/9) /9)", tbProp = {4, 651, 1, 1, 0, 0}, nRate = 0.020000},
	[119] = {szName = "Ú¤»ÃÖ®Ğ°É²¶¾ÈĞËéÆ¬  (5/9) /9)", tbProp = {4, 652, 1, 1, 0, 0}, nRate = 0.020000},
	[120] = {szName = "Ú¤»ÃÖ®Ğ°É²¶¾ÈĞËéÆ¬  (6/9) /9)", tbProp = {4, 653, 1, 1, 0, 0}, nRate = 0.020000},
	[121] = {szName = "Ú¤»ÃÖ®Ğ°É²¶¾ÈĞËéÆ¬  (7/9) /9)", tbProp = {4, 654, 1, 1, 0, 0}, nRate = 0.020000},
	[122] = {szName = "Ú¤»ÃÖ®Ğ°É²¶¾ÈĞËéÆ¬  (8/9) /9)", tbProp = {4, 655, 1, 1, 0, 0}, nRate = 0.020000},
	[123] = {szName = "Ú¤»ÃÖ®Ğ°É²¶¾ÈĞËéÆ¬  (9/9) /9)", tbProp = {4, 656, 1, 1, 0, 0}, nRate = 0.020000},
	[124] = {szName = "»¨ÓêÂşÌìËéÆ¬ (1/9) /9)", tbProp = {4, 657, 1, 1, 0, 0}, nRate = 0.004000},
	[125] = {szName = "»¨ÓêÂşÌìËéÆ¬(2/9) /9)", tbProp = {4, 658, 1, 1, 0, 0}, nRate = 0.004000},
	[126] = {szName = "»¨ÓêÂşÌìËéÆ¬ (3/9) /9)", tbProp = {4, 659, 1, 1, 0, 0}, nRate = 0.004000},
	[127] = {szName = "»¨ÓêÂşÌìËéÆ¬ (4/9) /9)", tbProp = {4, 660, 1, 1, 0, 0}, nRate = 0.004000},
	[128] = {szName = "»¨ÓêÂşÌìËéÆ¬ (5/9) /9)", tbProp = {4, 661, 1, 1, 0, 0}, nRate = 0.004000},
	[129] = {szName = "»¨ÓêÂşÌìËéÆ¬ (6/9) /9)", tbProp = {4, 662, 1, 1, 0, 0}, nRate = 0.004000},
	[130] = {szName = "»¨ÓêÂşÌìËéÆ¬ (7/9) /9)", tbProp = {4, 663, 1, 1, 0, 0}, nRate = 0.004000},
	[131] = {szName = "»¨ÓêÂşÌìËéÆ¬ (8/9) /9)", tbProp = {4, 664, 1, 1, 0, 0}, nRate = 0.004000},
	[132] = {szName = "»¨ÓêÂşÌìËéÆ¬ (9/9) /9)", tbProp = {4, 665, 1, 1, 0, 0}, nRate = 0.004000},
	[133] = {szName = "±ùº®Ö®µ¯Ö¸·Éµ¶ËéÆ¬(1/9)", tbProp = {4, 980, 1, 1, 0, 0}, nRate = 0.030000},
	[134] = {szName = "±ùº®Ö®µ¯Ö¸·Éµ¶ËéÆ¬ (2/9)", tbProp = {4, 981, 1, 1, 0, 0}, nRate = 0.030000},
	[135] = {szName = "±ùº®Ö®µ¯Ö¸·Éµ¶ËéÆ¬ (3/9)", tbProp = {4, 982, 1, 1, 0, 0}, nRate = 0.030000},
	[136] = {szName = "±ùº®Ö®µ¯Ö¸·Éµ¶ËéÆ¬ (4/9)", tbProp = {4, 983, 1, 1, 0, 0}, nRate = 0.030000},
	[137] = {szName = "±ùº®Ö®µ¯Ö¸·Éµ¶ËéÆ¬ (5/9)", tbProp = {4, 984, 1, 1, 0, 0}, nRate = 0.030000},
	[138] = {szName = "±ùº®Ö®µ¯Ö¸·Éµ¶ËéÆ¬ (6/9)", tbProp = {4, 985, 1, 1, 0, 0}, nRate = 0.030000},
	[139] = {szName = "±ùº®Ö®µ¯Ö¸·Éµ¶ËéÆ¬(7/9)", tbProp = {4, 986, 1, 1, 0, 0}, nRate = 0.030000},
	[140] = {szName = "±ùº®Ö®µ¯Ö¸·Éµ¶ËéÆ¬ (8/9)", tbProp = {4, 987, 1, 1, 0, 0}, nRate = 0.030000},
	[141] = {szName = "±ùº®Ö®µ¯Ö¸·Éµ¶ËéÆ¬ (9/9)", tbProp = {4, 988, 1, 1, 0, 0}, nRate = 0.030000},
	[142] = {szName = "·ÉĞÇ¶á»êËéÆ¬ (1/9) /9)", tbProp = {4, 666, 1, 1, 0, 0}, nRate = 0.020000},
	[143] = {szName = "·ÉĞÇ¶á»êËéÆ¬ (2/9) /9)", tbProp = {4, 667, 1, 1, 0, 0}, nRate = 0.020000},
	[144] = {szName = "·ÉĞÇ¶á»êËéÆ¬ (3/9) /9)", tbProp = {4, 668, 1, 1, 0, 0}, nRate = 0.020000},
	[145] = {szName = "·ÉĞÇ¶á»êËéÆ¬ (4/9) /9)", tbProp = {4, 669, 1, 1, 0, 0}, nRate = 0.020000},
	[146] = {szName = "·ÉĞÇ¶á»êËéÆ¬(5/9) /9)", tbProp = {4, 670, 1, 1, 0, 0}, nRate = 0.020000},
	[147] = {szName = "·ÉĞÇ¶á»êËéÆ¬ (6/9) /9)", tbProp = {4, 671, 1, 1, 0, 0}, nRate = 0.020000},
	[148] = {szName = "·ÉĞÇ¶á»êËéÆ¬ (7/9) /9)", tbProp = {4, 672, 1, 1, 0, 0}, nRate = 0.020000},
	[149] = {szName = "·ÉĞÇ¶á»êËéÆ¬(8/9) /9)", tbProp = {4, 673, 1, 1, 0, 0}, nRate = 0.020000},
	[150] = {szName = "·ÉĞÇ¶á»êËéÆ¬ (9/9) /9)", tbProp = {4, 674, 1, 1, 0, 0}, nRate = 0.020000},
	[151] = {szName = "Ï´ÏóÓñ¿ÛËéÆ¬ (1/6) /6)", tbProp = {4, 801, 1, 1, 0, 0}, nRate = 0.020000},
	[152] = {szName = "Ï´ÏóÓñ¿ÛËéÆ¬ (2/6) /6)", tbProp = {4, 802, 1, 1, 0, 0}, nRate = 0.020000},
	[153] = {szName = "Ï´ÏóÓñ¿ÛËéÆ¬ (3/6) /6)", tbProp = {4, 803, 1, 1, 0, 0}, nRate = 0.020000},
	[154] = {szName = "Ï´ÏóÓñ¿ÛËéÆ¬ (4/6) /6)", tbProp = {4, 804, 1, 1, 0, 0}, nRate = 0.020000},
	[155] = {szName = "Ï´ÏóÓñ¿ÛËéÆ¬(5/6) /6)", tbProp = {4, 805, 1, 1, 0, 0}, nRate = 0.020000},
	[156] = {szName = "Ï´ÏóÓñ¿ÛËéÆ¬(6/6) /6)", tbProp = {4, 806, 1, 1, 0, 0}, nRate = 0.020000},
	[157] = {szName = "ºìç»Èí¶NĞ¬ËéÆ¬ (1/6) /6)", tbProp = {4, 807, 1, 1, 0, 0}, nRate = 0.030000},
	[158] = {szName = "ºìç»Èí¶NĞ¬ËéÆ¬ (2/6) /6)", tbProp = {4, 808, 1, 1, 0, 0}, nRate = 0.030000},
	[159] = {szName = "ºìç»Èí¶NĞ¬ËéÆ¬ (3/6) /6)", tbProp = {4, 809, 1, 1, 0, 0}, nRate = 0.030000},
	[160] = {szName = "ºìç»Èí¶NĞ¬ËéÆ¬ (4/6) /6)", tbProp = {4, 810, 1, 1, 0, 0}, nRate = 0.030000},
	[161] = {szName = "ºìç»Èí¶NĞ¬ËéÆ¬ (5/6) /6)", tbProp = {4, 811, 1, 1, 0, 0}, nRate = 0.030000},
	[162] = {szName = "ºìç»Èí¶NĞ¬ËéÆ¬ (6/6) /6)", tbProp = {4, 812, 1, 1, 0, 0}, nRate = 0.030000},
	[163] = {szName = "ÎŞ¼äÖ®ÒĞÌì½£ËéÆ¬(1/9) /9)", tbProp = {4, 621, 1, 1, 0, 0}, nRate = 0.020000},
	[164] = {szName = "ÎŞ¼äÖ®ÒĞÌì½£ËéÆ¬ (2/9) /9)", tbProp = {4, 622, 1, 1, 0, 0}, nRate = 0.020000},
	[165] = {szName = "ÎŞ¼äÖ®ÒĞÌì½£ËéÆ¬ (3/9) /9)", tbProp = {4, 623, 1, 1, 0, 0}, nRate = 0.020000},
	[166] = {szName = "ÎŞ¼äÖ®ÒĞÌì½£ËéÆ¬ (4/9) /9)", tbProp = {4, 624, 1, 1, 0, 0}, nRate = 0.020000},
	[167] = {szName = "ÎŞ¼äÖ®ÒĞÌì½£ËéÆ¬ (5/9) /9)", tbProp = {4, 625, 1, 1, 0, 0}, nRate = 0.020000},
	[168] = {szName = "ÎŞ¼äÖ®ÒĞÌì½£ËéÆ¬ (6/9) /9)", tbProp = {4, 626, 1, 1, 0, 0}, nRate = 0.020000},
	[169] = {szName = "ÎŞ¼äÖ®ÒĞÌì½£ËéÆ¬ (7/9) /9)", tbProp = {4, 627, 1, 1, 0, 0}, nRate = 0.020000},
	[170] = {szName = "ÎŞ¼äÖ®ÒĞÌì½£ËéÆ¬ (8/9) /9)", tbProp = {4, 628, 1, 1, 0, 0}, nRate = 0.020000},
	[171] = {szName = "ÎŞ¼äÖ®ÒĞÌì½£ËéÆ¬ (9/9) /9)", tbProp = {4, 629, 1, 1, 0, 0}, nRate = 0.020000},
	[172] = {szName = "ÆÜ»ËÖ®·ïÒÇµ¶ËéÆ¬ (1/9) /9)", tbProp = {4, 630, 1, 1, 0, 0}, nRate = 0.020000},
	[173] = {szName = "ÆÜ»ËÖ®·ïÒÇµ¶ËéÆ¬ (2/9) /9)", tbProp = {4, 631, 1, 1, 0, 0}, nRate = 0.020000},
	[174] = {szName = "ÆÜ»ËÖ®·ïÒÇµ¶ËéÆ¬(3/9) /9)", tbProp = {4, 632, 1, 1, 0, 0}, nRate = 0.020000},
	[175] = {szName = "ÆÜ»ËÖ®·ïÒÇµ¶ËéÆ¬(4/9) /9)", tbProp = {4, 633, 1, 1, 0, 0}, nRate = 0.020000},
	[176] = {szName = "ÆÜ»ËÖ®·ïÒÇµ¶ËéÆ¬(5/9) /9)", tbProp = {4, 634, 1, 1, 0, 0}, nRate = 0.020000},
	[177] = {szName = "ÆÜ»ËÖ®·ïÒÇµ¶ËéÆ¬ (6/9) /9)", tbProp = {4, 635, 1, 1, 0, 0}, nRate = 0.020000},
	[178] = {szName = "ÆÜ»ËÖ®·ïÒÇµ¶ËéÆ¬(7/9) /9)", tbProp = {4, 636, 1, 1, 0, 0}, nRate = 0.020000},
	[179] = {szName = "ÆÜ»ËÖ®·ïÒÇµ¶ËéÆ¬(8/9) /9)", tbProp = {4, 637, 1, 1, 0, 0}, nRate = 0.020000},
	[180] = {szName = "ÆÜ»ËÖ®·ïÒÇµ¶ËéÆ¬(9/9) /9)", tbProp = {4, 638, 1, 1, 0, 0}, nRate = 0.020000},
	[181] = {szName = "ÆÜ»ËÖ®±ù×Ù½õÍóËéÆ¬ (1/6)", tbProp = {4, 1055, 1, 1, 0, 0}, nRate = 0.030000},
	[182] = {szName = "ÆÜ»ËÖ®±ù×Ù½õÍóËéÆ¬ (2/6)", tbProp = {4, 1056, 1, 1, 0, 0}, nRate = 0.030000},
	[183] = {szName = "ÆÜ»ËÖ®±ù×Ù½õÍóËéÆ¬ (3/6)", tbProp = {4, 1057, 1, 1, 0, 0}, nRate = 0.030000},
	[184] = {szName = "ÆÜ»ËÖ®±ù×Ù½õÍóËéÆ¬(4/6)", tbProp = {4, 1058, 1, 1, 0, 0}, nRate = 0.030000},
	[185] = {szName = "ÆÜ»ËÖ®±ù×Ù½õÍóËéÆ¬ (5/6)", tbProp = {4, 1059, 1, 1, 0, 0}, nRate = 0.030000},
	[186] = {szName = "ÆÜ»ËÖ®±ù×Ù½õÍóËéÆ¬ (6/6)", tbProp = {4, 1060, 1, 1, 0, 0}, nRate = 0.030000},
	[187] = {szName = "ÓÄÚ¤Ç¹ËéÆ¬(1/9) /9)", tbProp = {4, 684, 1, 1, 0, 0}, nRate = 0.020000},
	[188] = {szName = "ÓÄÚ¤Ç¹ËéÆ¬ (2/9) /9)", tbProp = {4, 685, 1, 1, 0, 0}, nRate = 0.020000},
	[189] = {szName = "ÓÄÚ¤Ç¹ËéÆ¬ (3/9) /9)", tbProp = {4, 686, 1, 1, 0, 0}, nRate = 0.020000},
	[190] = {szName = "ÓÄÚ¤Ç¹ËéÆ¬ (4/9) /9)", tbProp = {4, 687, 1, 1, 0, 0}, nRate = 0.020000},
	[191] = {szName = "ÓÄÚ¤Ç¹ËéÆ¬ (5/9) /9)", tbProp = {4, 688, 1, 1, 0, 0}, nRate = 0.020000},
	[192] = {szName = "ÓÄÚ¤Ç¹ËéÆ¬ (6/9) /9)", tbProp = {4, 689, 1, 1, 0, 0}, nRate = 0.020000},
	[193] = {szName = "ÓÄÚ¤Ç¹ËéÆ¬ (7/9) /9)", tbProp = {4, 690, 1, 1, 0, 0}, nRate = 0.020000},
	[194] = {szName = "ÓÄÚ¤Ç¹ËéÆ¬ (8/9) /9)", tbProp = {4, 691, 1, 1, 0, 0}, nRate = 0.020000},
	[195] = {szName = "ÓÄÚ¤Ç¹ËéÆ¬ (9/9) /9)", tbProp = {4, 692, 1, 1, 0, 0}, nRate = 0.020000},
	[196] = {szName = "Ä§ÊÈÖ®É½º£·ÉºèÂÄËéÆ¬(1/6) /6)", tbProp = {4, 873, 1, 1, 0, 0}, nRate = 0.040000},
	[197] = {szName = "Ä§ÊÈÖ®É½º£·ÉºèÂÄËéÆ¬(1/6) /6)", tbProp = {4, 874, 1, 1, 0, 0}, nRate = 0.040000},
	[198] = {szName = "Ä§ÊÈÖ®É½º£·ÉºèÂÄËéÆ¬(1/6) /6)", tbProp = {4, 875, 1, 1, 0, 0}, nRate = 0.040000},
	[199] = {szName = "Ä§ÊÈÖ®É½º£·ÉºèÂÄËéÆ¬(1/6) /6)", tbProp = {4, 876, 1, 1, 0, 0}, nRate = 0.040000},
	[200] = {szName = "Ä§ÊÈÖ®É½º£·ÉºèÂÄËéÆ¬(1/6) /6)", tbProp = {4, 877, 1, 1, 0, 0}, nRate = 0.040000},
	[201] = {szName = "Ä§ÊÈÖ®É½º£·ÉºèÂÄËéÆ¬(1/6) /6)", tbProp = {4, 878, 1, 1, 0, 0}, nRate = 0.040000},
	[202] = {szName = "Í¬³ğÖ®½µÁúØ¤ÒÂËéÆ¬ (1/6) /6)", tbProp = {4, 849, 1, 1, 0, 0}, nRate = 0.080000},
	[203] = {szName = "Í¬³ğÖ®½µÁúØ¤ÒÂËéÆ¬ (2/6) /6)", tbProp = {4, 850, 1, 1, 0, 0}, nRate = 0.080000},
	[204] = {szName = "Í¬³ğÖ®½µÁúØ¤ÒÂËéÆ¬ (3/6) /6)", tbProp = {4, 851, 1, 1, 0, 0}, nRate = 0.080000},
	[205] = {szName = "Í¬³ğÖ®½µÁúØ¤ÒÂËéÆ¬ (4/6) /6)", tbProp = {4, 852, 1, 1, 0, 0}, nRate = 0.080000},
	[206] = {szName = "Í¬³ğÖ®½µÁúØ¤ÒÂËéÆ¬(5/6) /6)", tbProp = {4, 853, 1, 1, 0, 0}, nRate = 0.080000},
	[207] = {szName = "Í¬³ğÖ®½µÁúØ¤ÒÂËéÆ¬ (6/6) /6)", tbProp = {4, 854, 1, 1, 0, 0}, nRate = 0.080000},
	[208] = {szName = "Í¬³ğÖ®¿ºÁú»¤ÊÖËéÆ¬ (1/6) /6)", tbProp = {4, 855, 1, 1, 0, 0}, nRate = 0.020000},
	[209] = {szName = "Í¬³ğÖ®¿ºÁú»¤ÊÖËéÆ¬  (2/6) /6)", tbProp = {4, 856, 1, 1, 0, 0}, nRate = 0.020000},
	[210] = {szName = "Í¬³ğÖ®¿ºÁú»¤ÊÖËéÆ¬  (3/6) /6)", tbProp = {4, 857, 1, 1, 0, 0}, nRate = 0.020000},
	[211] = {szName = "Í¬³ğÖ®¿ºÁú»¤ÊÖËéÆ¬  (4/6) /6)", tbProp = {4, 858, 1, 1, 0, 0}, nRate = 0.020000},
	[212] = {szName = "Í¬³ğÖ®¿ºÁú»¤ÊÖËéÆ¬  (5/6) /6)", tbProp = {4, 859, 1, 1, 0, 0}, nRate = 0.020000},
	[213] = {szName = "Í¬³ğÖ®¿ºÁú»¤ÊÖËéÆ¬  (6/6) /6)", tbProp = {4, 860, 1, 1, 0, 0}, nRate = 0.020000},
	[214] = {szName = "ÂÌÓñÕÈËéÆ¬ (1/9) /9)", tbProp = {4, 675, 1, 1, 0, 0}, nRate = 0.020000},
	[215] = {szName = "ÂÌÓñÕÈËéÆ¬ (2/9) /9)", tbProp = {4, 676, 1, 1, 0, 0}, nRate = 0.020000},
	[216] = {szName = "ÂÌÓñÕÈËéÆ¬(3/9) /9)", tbProp = {4, 677, 1, 1, 0, 0}, nRate = 0.020000},
	[217] = {szName = "ÂÌÓñÕÈËéÆ¬(4/9) /9)", tbProp = {4, 678, 1, 1, 0, 0}, nRate = 0.020000},
	[218] = {szName = "ÂÌÓñÕÈËéÆ¬ (5/9) /9)", tbProp = {4, 679, 1, 1, 0, 0}, nRate = 0.020000},
	[219] = {szName = "ÂÌÓñÕÈËéÆ¬(6/9) /9)", tbProp = {4, 680, 1, 1, 0, 0}, nRate = 0.020000},
	[220] = {szName = "ÂÌÓñÕÈËéÆ¬ (7/9) /9)", tbProp = {4, 681, 1, 1, 0, 0}, nRate = 0.020000},
	[221] = {szName = "ÂÌÓñÕÈËéÆ¬(8/9) /9)", tbProp = {4, 682, 1, 1, 0, 0}, nRate = 0.020000},
	[222] = {szName = "ÂÌÓñÕÈËéÆ¬ (9/9) /9)", tbProp = {4, 683, 1, 1, 0, 0}, nRate = 0.020000},
	[223] = {szName = "»Æ½ğ-À×ñ·Ö®º®ËÉ±ù°Ø¹ÚËéÆ¬(1/6)", tbProp = {4, 1004, 1, 1, 0, 0}, nRate = 0.005000},
	[224] = {szName = "»Æ½ğ-À×ñ·Ö®º®ËÉ±ù°Ø¹ÚËéÆ¬(2/6)", tbProp = {4, 1005, 1, 1, 0, 0}, nRate = 0.005000},
	[225] = {szName = "»Æ½ğ-À×ñ·Ö®º®ËÉ±ù°Ø¹ÚËéÆ¬(3/6)", tbProp = {4, 1006, 1, 1, 0, 0}, nRate = 0.005000},
	[226] = {szName = "»Æ½ğ-À×ñ·Ö®º®ËÉ±ù°Ø¹ÚËéÆ¬(4/6)", tbProp = {4, 1007, 1, 1, 0, 0}, nRate = 0.005000},
	[227] = {szName = "»Æ½ğ-À×ñ·Ö®º®ËÉ±ù°Ø¹ÚËéÆ¬(5/6)", tbProp = {4, 1008, 1, 1, 0, 0}, nRate = 0.005000},
	[228] = {szName = "»Æ½ğ-À×ñ·Ö®º®ËÉ±ù°Ø¹ÚËéÆ¬(6/6)", tbProp = {4, 1009, 1, 1, 0, 0}, nRate = 0.005000},
	[229] = {szName = "Ç§Äêº®ÌúËéÆ¬ (1/9) /9)", tbProp = {4, 702, 1, 1, 0, 0}, nRate = 0.020000},
	[230] = {szName = "Ç§Äêº®ÌúËéÆ¬  (2/9) /9)", tbProp = {4, 703, 1, 1, 0, 0}, nRate = 0.020000},
	[231] = {szName = "Ç§Äêº®ÌúËéÆ¬  (3/9) /9)", tbProp = {4, 704, 1, 1, 0, 0}, nRate = 0.020000},
	[232] = {szName = "Ç§Äêº®ÌúËéÆ¬  (4/9) /9)", tbProp = {4, 705, 1, 1, 0, 0}, nRate = 0.020000},
	[233] = {szName = "Ç§Äêº®ÌúËéÆ¬  (5/9) /9)", tbProp = {4, 706, 1, 1, 0, 0}, nRate = 0.020000},
	[234] = {szName = "Ç§Äêº®ÌúËéÆ¬  (6/9) /9)", tbProp = {4, 707, 1, 1, 0, 0}, nRate = 0.020000},
	[235] = {szName = "Ç§Äêº®ÌúËéÆ¬  (7/9) /9)", tbProp = {4, 708, 1, 1, 0, 0}, nRate = 0.020000},
	[236] = {szName = "Ç§Äêº®ÌúËéÆ¬  (8/9) /9)", tbProp = {4, 709, 1, 1, 0, 0}, nRate = 0.020000},
	[237] = {szName = "Ç§Äêº®ÌúËéÆ¬  (9/9) /9)", tbProp = {4, 710, 1, 1, 0, 0}, nRate = 0.020000},
	[238] = {szName = "ÕæÎä½£ËéÆ¬ (1/9) /9)", tbProp = {4, 693, 1, 1, 0, 0}, nRate = 0.008000},
	[239] = {szName = "ÕæÎä½£ËéÆ¬  (2/9) /9)", tbProp = {4, 694, 1, 1, 0, 0}, nRate = 0.008000},
	[240] = {szName = "ÕæÎä½£ËéÆ¬ (3/9) /9)", tbProp = {4, 695, 1, 1, 0, 0}, nRate = 0.008000},
	[241] = {szName = "ÕæÎä½£ËéÆ¬  (4/9) /9)", tbProp = {4, 696, 1, 1, 0, 0}, nRate = 0.008000},
	[242] = {szName = "ÕæÎä½£ËéÆ¬  (5/9) /9)", tbProp = {4, 697, 1, 1, 0, 0}, nRate = 0.008000},
	[243] = {szName = "ÕæÎä½£ËéÆ¬  (6/9) /9)", tbProp = {4, 698, 1, 1, 0, 0}, nRate = 0.008000},
	[244] = {szName = "ÕæÎä½£ËéÆ¬  (7/9) /9)", tbProp = {4, 699, 1, 1, 0, 0}, nRate = 0.008000},
	[245] = {szName = "ÕæÎä½£ËéÆ¬  (8/9) /9)", tbProp = {4, 700, 1, 1, 0, 0}, nRate = 0.008000},
	[246] = {szName = "ÕæÎä½£ËéÆ¬  (9/9) /9)", tbProp = {4, 701, 1, 1, 0, 0}, nRate = 0.008000},
	[247] = {szName = "ÁèÔÀÖ®ÎŞ¼«ĞşÓñÅåËéÆ¬ (1/6) /6)", tbProp = {4, 879, 1, 1, 0, 0}, nRate = 0.020000},
	[248] = {szName = "ÁèÔÀÖ®ÎŞ¼«ĞşÓñÅåËéÆ¬(2/6) /6)", tbProp = {4, 880, 1, 1, 0, 0}, nRate = 0.020000},
	[249] = {szName = "ÁèÔÀÖ®ÎŞ¼«ĞşÓñÅåËéÆ¬ (3/6) /6)", tbProp = {4, 881, 1, 1, 0, 0}, nRate = 0.020000},
	[250] = {szName = "ÁèÔÀÖ®ÎŞ¼«ĞşÓñÅåËéÆ¬ (4/6) /6)", tbProp = {4, 882, 1, 1, 0, 0}, nRate = 0.020000},
	[251] = {szName = "ÁèÔÀÖ®ÎŞ¼«ĞşÓñÅåËéÆ¬ (5/6) /6)", tbProp = {4, 883, 1, 1, 0, 0}, nRate = 0.020000},
	[252] = {szName = "ÁèÔÀÖ®ÎŞ¼«ĞşÓñÅåËéÆ¬ (6/6) /6)", tbProp = {4, 884, 1, 1, 0, 0}, nRate = 0.020000},

};

function main(nItemIdx)
	local n_item_date = tonumber(FormatTime2String("%Y%m%d%H%M",ITEM_GetExpiredTime(nItemIdx)));
	local n_cur_date = tonumber(GetLocalDate("%Y%m%d%H%M"));
	if n_cur_date > n_item_date then
		Msg2Player("ÎïÆ·¹ıÊ¹ÓÃÆÚ£¬×Ô¶¯ÏûÊ§.")
		return 0;
	end
	
	local bRet, szFailMsg = tbBirthday0905:IsPlayerEligible();
	
	if bRet ~= 1 then
		Talk(2, "", szFailMsg, "Äú²»¹»Ìõ¼şÁìÈ¡´ËÎïÆ·");
		return 1;
	end
	
	if CalcFreeItemCellCount() < 10 then
		Talk(1,"", format("×°±¸¿ÕÎ»²»×ã %d¿ÕÎ»£¬ÇëÕûÀíÒ»ÏÂ.", 10));
		return 1
	end
	
	if tbBirthday0905.tbTask:get_task(tbBirthday0905.tbTask.tsk_zhuhe_maxexp) == 0 or tbBirthday0905.tbTask:get_task(tbBirthday0905.tbTask.tsk_zhuhe_maxexp) == nil then
		tbBirthday0905.tbTask:add_zhuhe_maxexp();
	end	
	
	if (tbBirthday0905.tbTask:get_task(tbBirthday0905.tbTask.tsk_zhuhe_curexp) >= tbBirthday0905.tbTask:get_task(tbBirthday0905.tbTask.tsk_zhuhe_maxexp)) then
		Msg2Player("ÒÑ»ñµÃ×î¸ß¾­ÑéÉÏÏŞ.");
		return 1;
	end
	
	local n_rand = random(1, 100);
	local n_sum = 0;
	local n_exp = 0;
	for i = 1, getn(tbBirthday0905.tbxinbanqi_addexp) do
		n_sum = n_sum + tbBirthday0905.tbxinbanqi_addexp[i][2];
		if (n_sum >= n_rand) then
			n_exp = tbBirthday0905.tbxinbanqi_addexp[i][1];
			break
		end
	end
	
	AddOwnExp(n_exp);
	tbBirthday0905.tbTask:add_task(tbBirthday0905.tbTask.tsk_zhuhe_curexp, floor(n_exp / tbBirthday0905.expbase));
	Msg2Player(format("»ñµÃ²»µş¼Ó¾­Ñé%d.", n_exp ));
	
	 tbAwardTemplet:GiveAwardByList(%tbAward, "birthday_jieri zhuhe");
end
