Include("\\RelaySetting\\Task\\goldbosshead_2300.lua");

tb_goldboss	=
{
	[1]		= {Sid = 52301,		n_npcid = 523,	str = "听说唐门柳青青已经杀了很多江湖高手 "}, -- 柳青青
	[2]		= {Sid = 51302,		n_npcid = 513,	str = "听说最近峨眉妙如已下山!"},	-- 妙如
	[3]		= {Sid = 51102,		n_npcid = 511,	str = "听说最近官府正在张宗政去追拿罪犯 "}, -- 张宗政
	[4]		= {Sid = 135403,	n_npcid = 1358,	str = "听说西王左毒已出现，制造了很多罪恶?"}, -- 西王邪毒
	[5]		= {Sid = 135604,	n_npcid = 1360,	str = "听说翠烟弟子是尹青芸，最近下山?"}, -- 尹青芸
	[6]		= {Sid = 135705,	n_npcid = 1361,	str = "听说竹丝洞的杀手已派黑衣杀手行刺对手?"}, -- 黑衣杀手
	[7]		= {Sid = 135206,	n_npcid = 1356,	str = "听说有人看到傲天将军出现在江湖?"}, -- 傲天将军
	[8]		= {Sid = 135807,	n_npcid = 1362,	str = "听说最近十方俱灭出现在江湖，想统一中原!"}, -- 十方俱灭
	[9]		= {Sid = 136008,	n_npcid = 1364,	str = "听说最近有一个神秘女子青衣子出现，武功很是高超?"}, -- 青衣子
	[10]	= {Sid = 135109,	n_npcid = 1355,	str = "听说少林弟子静通最近已下山?"}, -- 静通
};