xmas2007_findgirl_taskID = 1859		--Ñ°ÕÒÉñÃØÉÙÅ®ÈÎÎñ±äÁ¿
xmas2007_findgirl_limit_taskID = 1862		--Ñ°ÕÒÉñÃØÉÙÅ®³¡´Î
xmas2007_findgirl_gblvalue_taskID = 1245 --È«¾Ö¿ªÆô±äÁ¿
xmas2007_findgirl_exp = 10000000	--Ñ°ÕÒÉñÃØÉÙÅ®»ñµÃ¾­Ñé

tb_xmas2007_findgirl_item = --Ñ°ÕÒÉñÃØÉÙÅ®½±Àø
{
	100000,--×Ü¸ÅÂÊ
	{0.00625,{0,143},"¶´²ì°×½ğµñÁú½ä"},
	{0.00625,{0,144},"¶´²ì°×ÓñÇ¬À¤Åå"},
	{0.00625,{0,145},"¶´²ì°×½ğĞã·ï½ä"},
	{0.00625,{0,146},"¶´²ìôä´äÓñÏîÈ¦"},
}

tb_xmas2007_bossmap = 	--Ëæ»úµØÍ¼×ø±êµã
{
	[1]=		--·ïÏè
	{--x,y×ø±ê(ÉñÃØÊ¥µ®Ê÷,°¢É½,°¢ĞÛ)
		{1420, 3275},
		{1800, 3069},
		{1810, 3384},
	},
	[37]=		--µí¾©
	{
		{2021,2821},
		{1600,2817},
		{1801,3411},
	},
	[80]=		--ÑïÖİ
	{
		{1629, 2868},
		{1549, 3369},
		{1630, 2869},
	},
	[11]=		--³É¶¼
	{
		{2964, 4809},
		{2999, 5258},
		{3339, 5157},
	},
	[78]=		-- ÏåÑô
	{
		{1719, 3355},
		{1690, 3550},
		{1391, 3052},
	},
	[176]=	-- ÁÙ°²
	{
		{1231,3348},
		{1203,3059},
		{1130,2693},
	},
	[162]=	-- ´óÀí
	{
		{1805,3322},
		{1784,2991},
		{1326,3134},
	},
	[321]=	-- ³¤°×É½ÄÏ
	{
		{1019,2698},
		{1195,2759},
		{1321,2492},
		{1431,3011},
		{1540,2290},
		{1450,3133},
	},
	[322]=  -- ³¤°×É½±±
	{
		{1609,4101},
		{1603,3509},
		{1705,3541},
		{1795,4054},
		{1831,3411},
		{1976,3586},
		{2049,3598},
	},
}
tb_xmas_city = 		--Ëæ»úµØÍ¼
{
	[1] 	= "·ïÏè",
	[37] 	= "ãê¾©",
	[80]  = "ÑïÖİ",
	[11]  = "³É¶¼",
	[78]  = "ÏåÑô",
	[176] = "ÁÙ°²",
	[162]	="´óÀí",
	[321]	="³¤°×É½ÄÏ",
	[322]	="³¤°×É½±±",
}
tb_xmas_girl = 	--ÉñÃØÉÙÅ®
{
	--bossID,µÈ¼¶,ÎåĞĞ(-1ÎªËæ»ú)
	{1326,95,-1,"¶¬¶ù"},
	{1327,95,-1,"°×¶ù"},
	{1328,95,-1,"Ñ©¶ù"},
}

tb_xmas_boss = 	--ÕÙ»½»Æ½ğboss
{
	--bossID,µÈ¼¶,ÎåĞĞ(-1ÎªËæ»ú)
	{1322,95,-1,"ÉñÃØÊ¥µ®Ê÷"},
	{1324,95,-1,"°¢É½"},
	{1323,95,-1,"°¢ĞÜ"},
}

tbxmas2007_callboss_item =		--ÕÙ»½»Æ½ğbossµôÂä±í
{
	100,--×Ü¸ÅÂÊ,µ¥¼ş¼ÆËã
	--¸ÅÂÊ,{ÎïÆ·ID},ÊıÁ¿,Ãû³Æ
	{100,{4,239,1},1,"×ÏË®¾§"},
	{100,{4,240,1},1,"ÂÌË®¾§"},
	{100,{4,238,1},1,"À¶Ë®¾§"},
	{100,{4,353,1},6,"¾§ºì±¦Ê¯"},
	{100,{6,1,1007},1,"Ë®¾§ºË"},
	{5,{0,142},1,"¶´²ì°×½ğµñÁú½ä"},
	{5,{0,143},1,"¶´²ì°×ÓñÇ¬Â¡Åå"},
	{5,{0,144},1,"¶´²ì°×½ğĞã·ï½ä"},
	{5,{0,145},1,"¶´²ìôä´äÓñÏîÈ¦"},
}

function xmas2007_sdl_writeLog(sztitle,szevent)	--¼ÇÂ¼,sztitle=ÊÂ¼şÃû,szevent=ÊÂ¼şÄÚÈİ
	WriteLog(format("[%s]\t Date:%s\t Account:%s\t Name:%s\t %s",sztitle,GetLocalDate("%y-%m-%d %H:%M:%S"),GetAccount(),GetName(),szevent));
end

function xmas2007_findgirl_returndate()
	local nmin = tonumber(GetLocalDate("%M"))
	local ntasknim = 0
	if nmin >=0 and nmin < 20 then
		ntasknim = 0
	elseif nmin >=20 and nmin < 40 then
		ntasknim = 20
	elseif nmin >=40 and nmin < 60 then
		ntasknim = 40	
	end	
	local ndate = tonumber(GetLocalDate("%y%m%d%H"))
	local ntaskdate = ndate * 100 + ntasknim
	return ntaskdate
end
