--两湖区 巴陵县 路人5游客对话
--巴陵县新手任务：古老太的宝贝
--suyu
-- Update: Dan_Deng(2003-08-10)

function main(sel)
	UTask_world19 = GetTask(47);
	if (UTask_world19 == 2) then
		if HaveItem(183) == 1 then
			Say("游客：哇啊啊，这是什么！年轻人你手上拿的字画能不能卖给我呀，价格好商量，这是范文正公的墨宝呀！",2,"卖/yes","不卖/no")
		else
			Talk(1,"","游客：唉……我何时才能找到范文正公的墨宝呢？")
		end
	else
		i = random(0,3)
		if (i == 0) then
			Talk(1,"","游客：这洞庭湖又叫“云梦泽”，北连长江，南接湘、资、沅、酆四水，号称“八百里洞庭湖”。")
		elseif (i == 1) then
			Talk(1,"","游客：洞庭湖浩瀚迂回，山峦突兀，最大的特点是湖外有湖，湖中有山，渔帆点点，芦叶青青，水天一色，鸥鹭翔飞。春秋四时之景不同，一日之中变化万千。")
		elseif (i == 2) then
			Talk(1,"","游客：范文正公曾在《岳阳楼记》中写道：“予观夫巴陵胜状，在洞庭一湖。衔远山，吞长江，浩浩汤汤，横无际涯；朝晖夕阴，气象万千”，这碧波万顷的洞庭湖真不愧为“天下第一湖”啊！")
		else
			Talk(1,"","游客：唉……我何时才能找到范文正公的墨宝呢？")
		end
	end
end;

function yes()
	i = 100 * (random(0,5)+10)
	Talk(2,"","游人：你答应卖给我的，不要反悔哦！让我看看我身上还有多少钱，一五一十十五二十……","好了给你"..i.."两银子好了。")
	DelItem(183)
	Earn(i)
	SetTask(47, 3)
	Msg2Player("将字画卖给游客，得到"..i.."两银子。")
	AddNote("将字画卖给游客，得到"..i.."两银子。")
end;

function no()
	Talk(1,"","游客：求求你再考虑考虑，好好考虑一下，我真的很想要这幅字画。")
end;
