--昆仑派帮助NPC
-- 记住需要加入GetTask(9) == 127的容错（尚未加）
-- By: Dan_Deng(2003-12-01)

function main(sel)
	UTask_kl = GetTask(9)
	player_faction = GetFaction()
	if (player_faction == "kunlun") then		-- 本门弟子
		RestoreLife()		-- 本门免费治疗
		RestoreMana()
		RestoreStamina()
		Say("老夫在本门几十年了，见证了太多的变迁，知道该说的说，不该说的就不要去刨根问底",4,"了解本门事务/faction","了解各位兄长/member","了解任务/task_get","不问了!/nothing")
	elseif (UTask_kl >= 70*256) then				-- 本门出师
		Say("少有同门成业归来的。看入门弟子，之后再看成业行走江湖的人，不得不感叹时光飞逝啊",4,"回忆本门往事/faction","探望故友/member","我还能帮什么忙/task_get","不问了!/nothing")
	elseif (player_faction ~= "") then			-- 非本门出师、其它门派（门派不为空即指非新手）
		Say("欢迎到昆仑派，一路辛苦了，不知道有何指教/faction","了解各位道长/member","不问了!/nothing")
	else													-- 新手
		Say("昆仑派祖先道法欢迎各位参观学习",4,"T譵 hi觰 qu?ph竔/faction","T譵 hi觰 c竎 v?o trng/member","了解入门条件/task_get","不问了!/nothing")
	end
end

----------------- 门派介绍部份 ----------------------------
function faction()
	Say("这样你要了解本门的哪部分? ",5,"门派起源/F1","地理位置/F2","江湖地位/F3","门派特色/F4","不问了!/nothing")
end

function F1()
	Say("昆仑在西域，虽然立派很久但是自从开派祖师过世之后就再没有出色的人。一直到百年前，昆仑出现一位奇人。他不仅在武林中有名望，也帮助昆仑在武林中崛起.",2,"了解别的问题/main","不问了!/nothing")
end

function F2()
	Say("昆仑山坐落于新疆，青海交界，又有万山之祖的辉煌地位，可谓是中国第一山'",2,"了解别的问题/main","不问了!/nothing")
end

function F3()
	Say("本派虽远在西域，但是也希望在中原可以有相应的地位，现在渐渐和少林、武当、峨眉平起平坐了",2,"了解别的问题/main","不问了!/nothing")
end

function F4()
	Say("本派弟子有男有女，信奉道教，弟子可以婚配，不必吃素。本派最大的特点有2个：1是野心，2是对外是正人君子，对内极其阴险狡诈，同门内部也不相互信任，不管什么事都不要多话",2,"了解别的问题/main","不问了!/nothing")
end

----------------- 成员介绍部份 ----------------------------
function member()
	Say("你想得到本门哪位的介绍?",11,"掌门璇玑子/Mxuan","青莲子/Mqing","玉衡子/Myu","朱缺/Mzhu","童夕颜/Mtong","小寒/Mxiao","叹息老人/Mtan","陈心/Mxin","陈愿/Myuan","陈念/Mnian","不问了!/nothing")
end

function Mxuan()
	Say("掌门人：璇玑子 位置：正殿 坐标: 190,196<enter>野心勃勃，表面是一谦谦君子，实际上心恨手辣，未达目的不择手段. ",2,"了解别的问题/main","不问了!/nothing")
end

function Mqing()
	Say("青莲子  位置：紫薇殿    坐标: 186/199<enter>极端自私，最大的目的是成为昆仑派掌门，为达到这个目的，不惜与玉衡子互相利用，其实各怀鬼胎",2,"了解别的问题/main","不问了!/nothing")
end

function Myu()
	Say("玉衡子 位置：天微殿 坐标: 195/195<enter>猜忌心极重，不相信任何人，包括自己的弟子。最大的目的是成为昆仑派掌门，为达到这个目的，不惜与青莲子互相利用，其实各怀鬼胎.",2,"了解别的问题/main","不问了!/nothing")
end

function Mzhu()
	Say("朱缺   位置：大门内 坐标: 198/200<enter>性情冷淡，嫉恨心重，被五毒教白莹莹利用",2,"了解别的问题/main","不问了!/nothing")
end

function Mtong()
	Say("童夕颜   位置：后花园 坐标: 178,195<enter>璇玑子的女儿，洁白无瑕，心底纯良",2,"了解别的问题/main","不问了!/nothing")
end

function Mxiao()
	Say("小寒   位置：夕颜亭 坐标: 184,196<enter>童夕颜的丫鬟，是一个聪明伶俐的小女孩",2,"了解别的问题/main","不问了!/nothing")
end

function Mtan()
	Say("叹息老人   位置：弟子房 坐标: 191,201<enter>上一代的掌门，璇玑子、青莲子、玉衡子三人的师父。昔日做掌门时候本心残忍，对待门徒粗暴无恩，遭到三个弟子的怨恨并合计将他残害。三个弟子相互顾忌，因此没有杀他",2,"了解别的问题/main","不问了!/nothing")
end

function Mxin()
	Say("陈心   位置广场 坐标: 189,197   负责: 兵器交易",2,"了解别的问题/main","不问了!/nothing")
end

function Myuan()
	Say("陈愿   位置：广场 坐标: 193,195   负责:装备交易",2,"了解别的问题/main","不问了!/nothing")
end

function Mnian()
	Say("陈念   位置：广场坐标: 193,197   负责: 药品交易",2,"了解别的问题/main","不问了!/nothing")
end

----------------- 任务介绍部份 ----------------------------
function task_get()
	UTask_kl = GetTask(9)
	if (UTask_kl < 10*256) then	-- 未入门
		Say("你现在还未入门，要入门的话就到新手村见本派的接引弟子就可以了",4,"继续了解现在任务/T_enroll","了解别的任务/T_all","了解别的问题/main","不问了!/nothing")
	elseif (UTask_kl >= 10*256) and (UTask_kl < 20*256) then
		Say("你现在进行的是采药任务.",4,"继续了解现在任务/T_L10","了解别的任务/T_all","了解别的问题/main","不问了!/nothing")
	elseif (UTask_kl >= 20*256) and (UTask_kl < 30*256) then
		Say("你现在进行的是骆驼头骨任务.",4,"继续了解现在任务/T_L20","了解别的任务/T_all","了解别的问题/main","不问了!/nothing")
	elseif (UTask_kl >= 30*256) and (UTask_kl < 40*256) then
		Say("你现在进行的是夜明珠任务.",4,"继续了解现在任务/T_L30","了解别的任务/T_all","了解别的问题/main","不问了!/nothing")
	elseif (UTask_kl >= 40*256) and (UTask_kl < 50*256) then
		Say("你现在进行的是血魂神剑任务.",4,"继续了解现在任务/T_L40","了解别的任务/T_all","了解别的问题/main","不问了!/nothing")
	elseif (UTask_kl >= 50*256) and (UTask_kl < 60*256) then
		Say("你现在进行的是雪怪任务.",4,"继续了解现在任务/T_L50","了解别的任务/T_all","了解别的问题/main","不问了!/nothing")
	elseif (UTask_kl >= 60*256) and (UTask_kl < 70*256) then
		Say("你现在进行的是五彩石任务.",4,"继续了解现在任务/T_L60","了解别的任务/T_all","了解别的问题/main","不问了!/nothing")
	elseif (UTask_kl >= 70*256) and (UTask_kl < 80*256) then
		Say("你现在进行的是重返师门任务.",4,"继续了解现在任务/T_return","了解别的任务/T_all","了解别的问题/main","不问了!/nothing")
	else
		Say("你现在可以自由进出门派，暂时没有新任务!",3,"了解别的任务/T_all","了解别的问题/main","不问了!/nothing")
	end
end

function T_all()
	Say("想了解什么任务?",10,"入门任务/T_enroll","采药任务/T_L10","骆驼头骨任务/T_L20","夜明珠任务/T_L30","冰雪任务/T_L40","血魂神剑任务/T_L50","五色石任务/T_L60","重返师门任务/T_return","了解别的问题/main","不问了!/nothing")
end

function T_enroll()
	Talk(1,"t_all","想入门学艺，只需选土系角色，打怪练到10级以后在新手村跟昆仑护法对话即可。入门以后按顺序完成5个门派任务就会学到武功，得封称号。完成出师任务就可以出师了")
end

function T_L10()
	Talk(4,"t_all","入门之后到10级，你可以接采药任务。通过完成这个任务，你得到奉剑弟子的称号，学会武功昆仑刀法，昆仑剑法，束缚咒，清风符","第一步：到夕颜亭见小寒，接任务。到药王谷采紫苜蓿、地锦草、茜草、虎耳草和灵芝5种药","第二步：到药王谷打怪，拿够药材","第三步: 将5种药草交给小寒，任务完成")
end

function T_L20()
	Talk(4,"t_all","完成采药任务等级达到20级之后你可以接骆驼头骨任务。通过完成这个任务，你得到紫微护法的称号，学会武功羁绊符","第一步: 在一间弟子房里找到叹息老人，接受任务，拿回骆驼头骨.","第二步: 来到药王谷一层，打败土匪，拿到骆驼头骨.","第三步: 回到弟子房，把骆驼头骨给叹息老人，任务完成")
end

function T_L30()
	Talk(4,"t_all","完成骆驼头骨任务等级达到30级之后你可以接夜明珠任务。通过完成这个任务，你得到太微护法的称号，学会武功一气三清、百川汇海、天际震雷、天清地浊","第一步: 到大门找到朱缺，接受任务。到药王谷雪豹洞找夜明珠.","第二步:到雪豹洞一层打败雪豹，拿到三颗夜明珠","第三步:回到昆仑派，把三颗夜明珠交给朱缺，任务完成")
end

function T_L40()
	Talk(4,"t_all","完成夜明珠任务等级达到40级之后你可以接血魂神剑任务。通过完成这个任务，你得到天微护法的称号，学会武功凄寒皓雪","第一步: 在紫微殿找到青莲子接受任务，到见性峰找血魂神剑.","第二步: 到见性峰山洞打败山贼小头目和山贼头领，拿到钥匙打开宝箱得到血魂神剑","第三步: 回到紫微殿，把血魂神剑交给青莲子，任务完成")
end

function T_L50()
	Talk(5,"t_all","完成血魂神剑任务等级达到50级之后你可以接冰雪怪人任务。通过完成这个任务，你得到授符天将的称号，学会武功狂风骤电、迷踪幻影","第一步: 在天微殿找到玉衡子，接受任务，到冰牢收服怪人.","第二步: 到冰穴洞打败5只雪怪，找到冰牢","第三步: 打败冰牢中的怪人，拿到一撮头发","第四步: 回到天微殿向玉衡子复命，任务完成")
end

function T_L60()
	Talk(6,"t_all","完成怪人任务等级达到50级之后你可以接五色石任务。通过完成这个任务，你得到仙符真君的称号，顺利出师","第一步: 在正殿找到掌门璇玑子，接受任务去找五色石.","第二步:来到黄河源头，遇到一名老人，知道五色石在留仙洞，要找5把天锁'","第三步:进入留仙洞，在每一层打败守钥匙的人，拿到钥匙","第四步: 到密室最底层用5把钥匙打开宝箱，拿到五色石.","第五步：回到正殿，把五色石交给掌门，任务完成")
end

function T_return()
	Talk(3,"t_all","通过重返师门，你可以获得护派真君的称号，学会镇派绝学五雷阵法，霜啸昆仑","第一步: 达到60级之后，到正殿见璇玑子，请求重返师门。.","第二步: 交5万两，重返昆仑派.")
end

----------------- 结束 ---------------------------
function nothing()
end
