function main()
Uworld130 = GetTask(130)
	if (Uworld130 == 10)then
		Talk(14,"Uworld130_find","飞哥，每次下山都神采飞扬啊.不知道让多少女孩神魂颠倒.  ","小真，你说的让我高兴，他们的武功怎么不和你一样厉害呢!","哈哈！飞哥又和小妹开玩笑，小妹的武功怎么算好呢.","呵呵，要不是你的劝阻，我才不会乖乖的这么早回山上","飞哥想得不是小真，而是小真手上的狂风骤电!","咳咳，不要开玩笑了，赶快把它给我!","哥哥先把五雷正法给小真读读. ","呵呵！附件有人！","是谁？快出来!","在下刚刚路过听见2位在讨论雷啊电啊的，其实是什么啊?","你听见什么雷电?"," (如果他们知道我听到了全部恐怕会杀人灭口的)在下没听清楚，因此希望阁下说清楚哦！我们只是在讨论昆仑今天的天气. ","你真是个捉摸不透的人，快离开这!")
	elseif (Uworld130 == 30)then
		Talk(5,"Uworld130_jump","怎么又是你?","说实话，你们刚刚说的我都听到了!","哼，本姑娘也是这样想的，今天你既然来了就别想活着走!","练武最重要的是循序渐进，你们练的武功不一样，如果心急的话会走火入魔，这样没有好处的!","胡说！老子不练，难道让别人练了来杀我吗？小子，看招!")
	elseif (Uworld130 >= 30) and (Uworld130 <40) then
		Talk(1,"Uworld130_jump","好小子！之前我已经高抬贵手了，你还不知道生死是什么啊？")
	elseif (Uworld130 >10) and (Uworld130 < 40)then
		Talk(1,"","你这个人怎么这么奇怪啊，滚开滚开!")
	else 
	   Talk(1,"","你们两人在说什么秘密呢，态度好奇怪!")
	end
end

function Uworld130_find()
	SetTask(130,20)
	Msg2Player("你发现鱼邵二人打情骂俏，好像要交换什么秘密")
	AddNote("你发现鱼邵二人打情骂俏，好像要交换什么秘密")
end

function Uworld130_jump()
	NewWorld(228,1600,3224)
end
